RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error "Not supported compiler type"
#endif

/* 定义大存储块映射基址 */
#define FLASH_ADDR_BASE    0x08000000u
#define EEPROM_BASE        0x08100000u
#define SRAM_BASE          0x20000000u

#define APB1_BASE          0x40000000u
#define APB2_BASE          0x40010000u

#define AHB1_1_BASE        0x40020000u
#define AHB1_2_BASE        0x40040000u
#define AHB2_BASE          0x50000000u
#define AHB3_BASE          0x60000000u

#define FSMC_BANK0_BASE    0x60000000u
#define FSMC_BANK1_BASE    0x64000000u
#define FSMC_BANK2_BASE    0x68000000u
#define FSMC_BANK3_BASE    0x6C000000u
/* 定义外设模块映射基址 */

#define TIM2_BASE     (APB1_BASE)
#define TIM3_BASE     (APB1_BASE + 0x0400)
#define TIM4_BASE     (APB1_BASE + 0x0800)
#define TIM5_BASE     (APB1_BASE + 0x0C00)
#define TIM6_BASE     (APB1_BASE + 0x1000)
#define TIM7_BASE     (APB1_BASE + 0x1400)
#define RTC_BKP_BASE  (APB1_BASE + 0x2800)
#define WWDG_BASE     (APB1_BASE + 0x2C00)
#define IWDG_BASE     (APB1_BASE + 0x3000)
#define SPI2_BASE     (APB1_BASE + 0x3800)
#define SPI3_BASE     (APB1_BASE + 0x3C00)
#define UART2_BASE    (APB1_BASE + 0x4400)
#define UART3_BASE    (APB1_BASE + 0x4800)
#define UART4_BASE    (APB1_BASE + 0x4C00)
#define UART5_BASE    (APB1_BASE + 0x5000)
#define I2C1_BASE     (APB1_BASE + 0x5400)
#define I2C2_BASE     (APB1_BASE + 0x5800)
#define CAN_BASE      (APB1_BASE + 0x6400)
#define CRS_BASE      (APB1_BASE + 0x6C00)
#define PWR_BASE      (APB1_BASE + 0x7000)
#define DAC_BASE      (APB1_BASE + 0x7400)
#define UART7_BASE    (APB1_BASE + 0x7800)
#define UART8_BASE    (APB1_BASE + 0x7C00)

#define SYSCFG_BASE   (APB2_BASE)
#define EXTI_BASE     (APB2_BASE + 0x0400)
#define ADC1_BASE     (APB2_BASE + 0x2400)
#define ADC2_BASE     (APB2_BASE + 0x2800)
#define TIM1_BASE     (APB2_BASE + 0x2C00)
#define SPI1_BASE     (APB2_BASE + 0x3000)
#define TIM8_BASE     (APB2_BASE + 0x3400)
#define UART1_BASE    (APB2_BASE + 0x3800)
#define UART6_BASE    (APB2_BASE + 0x3C00)
#define COMP_BASE     (APB2_BASE + 0x4000)
#define ADC3_BASE     (APB2_BASE + 0x4C00)
#define CACHE_BASE    (APB2_BASE + 0x6000)
#define SDIO_BASE     (APB2_BASE + 0x8000)

#define DMA1_BASE     (AHB1_1_BASE)
#define DMA2_BASE     (AHB1_1_BASE + 0x0400)
#define RCC_BASE      (AHB1_1_BASE + 0x1000)
#define FLASH_BASE    (AHB1_1_BASE + 0x2000)
#define CRC_BASE      (AHB1_1_BASE + 0x3000)
#define ETHERNET_BASE (AHB1_1_BASE + 0x8000)

#define GPIOA_BASE    (AHB1_2_BASE)
#define GPIOB_BASE    (AHB1_2_BASE + 0x400)
#define GPIOC_BASE    (AHB1_2_BASE + 0x800)
#define GPIOD_BASE    (AHB1_2_BASE + 0xC00)
#define GPIOE_BASE    (AHB1_2_BASE + 0x1000)
#define GPIOF_BASE    (AHB1_2_BASE + 0x1400)
#define GPIOG_BASE    (AHB1_2_BASE + 0x1800)
#define GPIOH_BASE    (AHB1_2_BASE + 0x1C00)

#define USB_FS_OTG_BASE (AHB2_BASE)

#define FSMC_BASE     (AHB3_BASE + 0x40000000)

/*!
 * @addtogroup FLASH_Peripheral_Access_Layer FLASH Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FLASH Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ACR;                                                            ///< Flash access control register                offset: 0x00
    __IO uint32_t KEYR;                                                           ///< FPEC key register                            offset: 0x04
    __IO uint32_t OPTKEYR;                                                        ///< Flash OPTKEY register                        offset: 0x08
    __IO uint32_t SR;                                                             ///< Flash Status Register                        offset: 0x0C
    __IO uint32_t CR;                                                             ///< Flash control register                       offset: 0x10
    __IO uint32_t AR;                                                             ///< Flash address register                       offset: 0x14
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t OBR;                                                            ///< Option byte register                         offset: 0x1C
    __IO uint32_t WRPR;                                                           ///< Write protection register                    offset: 0x20
} FLASH_Type;

/*******************************************************************************
 * FLASH Type
 ******************************************************************************/

/*!
 * @addtogroup FLASH_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief FLASH_ACR Register Bit Definition
 */

#define FLASH_ACR_PRFTBS_SHIFT                  (5)
#define FLASH_ACR_PRFTBS_MASK                   (0x01U << FLASH_ACR_PRFTBS_SHIFT)
#define FLASH_ACR_PRFTBS(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_PRFTBS_SHIFT)) & FLASH_ACR_PRFTBS_MASK)

#define FLASH_ACR_PRFTBE_SHIFT                  (4)
#define FLASH_ACR_PRFTBE_MASK                   (0x01U << FLASH_ACR_PRFTBE_SHIFT)
#define FLASH_ACR_PRFTBE(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_PRFTBE_SHIFT)) & FLASH_ACR_PRFTBE_MASK)

#define FLASH_ACR_LATENCY_SHIFT                 (0)
#define FLASH_ACR_LATENCY_MASK                  (0x7U << FLASH_ACR_LATENCY_SHIFT)
#define FLASH_ACR_LATENCY(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_LATENCY_SHIFT)) & FLASH_ACR_LATENCY_MASK)

/*!
 * @brief FLASH_KEYR Register Bit Definition
 */

#define FLASH_KEYR_FKEYR_SHIFT                  (0)
#define FLASH_KEYR_FKEYR_MASK                   (0xFFFFFFFFU << FLASH_KEYR_FKEYR_SHIFT)
#define FLASH_KEYR_FKEYR(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_KEYR_FKEYR_SHIFT)) & FLASH_KEYR_FKEYR_MASK)

/*!
 * @brief FLASH_OPTKEYR Register Bit Definition
 */

#define FLASH_OPTKEYR_OPTKEYR_SHIFT             (0)
#define FLASH_OPTKEYR_OPTKEYR_MASK              (0xFFFFFFFFU << FLASH_OPTKEYR_OPTKEYR_SHIFT)
#define FLASH_OPTKEYR_OPTKEYR(x)                (((uint32_t)(((uint32_t)(x)) << FLASH_OPTKEYR_OPTKEYR_SHIFT)) & FLASH_OPTKEYR_OPTKEYR_MASK)

/*!
 * @brief FLASH_SR Register Bit Definition
 */

#define FLASH_SR_EOP_SHIFT                      (5)
#define FLASH_SR_EOP_MASK                       (0x01U << FLASH_SR_EOP_SHIFT)
#define FLASH_SR_EOP(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_SR_EOP_SHIFT)) & FLASH_SR_EOP_MASK)

