RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
/*******************************************************************************
 * CACHE Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CCR;                                                            ///< Configuration and control register           offset: 0x00
    __IO uint32_t SR;                                                             ///< Status register                              offset: 0x04
    __IO uint32_t IMR;                                                            ///< Interrupt mask register                      offset: 0x08
    __IO uint32_t ISR;                                                            ///< Interrupt status register                    offset: 0x0C
    __IO uint32_t Reserved1[1];                                                   ///< Reserved
    __IO uint32_t CSHR;                                                           ///< Hit Statistics Register                      offset: 0x14
    __IO uint32_t CSMR;                                                           ///< Lost Statistics Register                     offset: 0x18
} CACHE_Type;

/*******************************************************************************
 * CACHE Type
 ******************************************************************************/

/*!
 * @addtogroup CACHE_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CACHE_CCR Register Bit Definition
 */

#define CACHE_CCR_STATISTICEN_SHIFT             (6)
#define CACHE_CCR_STATISTICEN_MASK              (0x01U << CACHE_CCR_STATISTICEN_SHIFT)
#define CACHE_CCR_STATISTICEN(x)                (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_STATISTICEN_SHIFT)) & CACHE_CCR_STATISTICEN_MASK)

#define CACHE_CCR_SETPREFETCH_SHIFT             (5)
#define CACHE_CCR_SETPREFETCH_MASK              (0x01U << CACHE_CCR_SETPREFETCH_SHIFT)
#define CACHE_CCR_SETPREFETCH(x)                (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_SETPREFETCH_SHIFT)) & CACHE_CCR_SETPREFETCH_MASK)

#define CACHE_CCR_SETMANINV_SHIFT               (4)
#define CACHE_CCR_SETMANINV_MASK                (0x01U << CACHE_CCR_SETMANINV_SHIFT)
#define CACHE_CCR_SETMANINV(x)                  (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_SETMANINV_SHIFT)) & CACHE_CCR_SETMANINV_MASK)

#define CACHE_CCR_SETMANPOW_SHIFT               (3)
#define CACHE_CCR_SETMANPOW_MASK                (0x01U << CACHE_CCR_SETMANPOW_SHIFT)
#define CACHE_CCR_SETMANPOW(x)                  (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_SETMANPOW_SHIFT)) & CACHE_CCR_SETMANPOW_MASK)

#define CACHE_CCR_POWREQ_SHIFT                  (2)
#define CACHE_CCR_POWREQ_MASK                   (0x01U << CACHE_CCR_POWREQ_SHIFT)
#define CACHE_CCR_POWREQ(x)                     (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_POWREQ_SHIFT)) & CACHE_CCR_POWREQ_MASK)

#define CACHE_CCR_INVREQ_SHIFT                  (1)
#define CACHE_CCR_INVREQ_MASK                   (0x01U << CACHE_CCR_INVREQ_SHIFT)
#define CACHE_CCR_INVREQ(x)                     (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_INVREQ_SHIFT)) & CACHE_CCR_INVREQ_MASK)

#define CACHE_CCR_EN_SHIFT                      (0)
#define CACHE_CCR_EN_MASK                       (0x01U << CACHE_CCR_EN_SHIFT)
#define CACHE_CCR_EN(x)                         (((uint32_t)(((uint32_t)(x)) << CACHE_CCR_EN_SHIFT)) & CACHE_CCR_EN_MASK)

/*!
 * @brief CACHE_SR Register Bit Definition
 */

#define CACHE_SR_POWSTAT_SHIFT                  (4)
#define CACHE_SR_POWSTAT_MASK                   (0x01U << CACHE_SR_POWSTAT_SHIFT)
#define CACHE_SR_POWSTAT(x)                     (((uint32_t)(((uint32_t)(x)) << CACHE_SR_POWSTAT_SHIFT)) & CACHE_SR_POWSTAT_MASK)

#define CACHE_SR_INVSTAT_SHIFT                  (2)
#define CACHE_SR_INVSTAT_MASK                   (0x01U << CACHE_SR_INVSTAT_SHIFT)
#define CACHE_SR_INVSTAT(x)                     (((uint32_t)(((uint32_t)(x)) << CACHE_SR_INVSTAT_SHIFT)) & CACHE_SR_INVSTAT_MASK)

#define CACHE_SR_CS_SHIFT                       (0)
#define CACHE_SR_CS_MASK                        (0x3U << CACHE_SR_CS_SHIFT)
#define CACHE_SR_CS(x)                          (((uint32_t)(((uint32_t)(x)) << CACHE_SR_CS_SHIFT)) & CACHE_SR_CS_MASK)

/*!
 * @brief CACHE_IMR Register Bit Definition
 */

#define CACHE_IMR_MANINVERR_SHIFT               (1)
#define CACHE_IMR_MANINVERR_MASK                (0x01U << CACHE_IMR_MANINVERR_SHIFT)
#define CACHE_IMR_MANINVERR(x)                  (((uint32_t)(((uint32_t)(x)) << CACHE_IMR_MANINVERR_SHIFT)) & CACHE_IMR_MANINVERR_MASK)

#define CACHE_IMR_POWERR_SHIFT                  (0)
#define CACHE_IMR_POWERR_MASK                   (0x01U << CACHE_IMR_POWERR_SHIFT)
#define CACHE_IMR_POWERR(x)                     (((uint32_t)(((uint32_t)(x)) << CACHE_IMR_POWERR_SHIFT)) & CACHE_IMR_POWERR_MASK)

/*!
 * @brief CACHE_ISR Register Bit Definition
 */

#define CACHE_ISR_MANINVERR_SHIFT               (1)
#define CACHE_ISR_MANINVERR_MASK                (0x01U << CACHE_ISR_MANINVERR_SHIFT)
#define CACHE_ISR_MANINVERR(x)                  (((uint32_t)(((uint32_t)(x)) << CACHE_ISR_MANINVERR_SHIFT)) & CACHE_ISR_MANINVERR_MASK)

#define CACHE_ISR_POWERR_SHIFT                  (0)
#define CACHE_ISR_POWERR_MASK                   (0x01U << CACHE_ISR_POWERR_SHIFT)
#define CACHE_ISR_POWERR(x)                     (((uint32_t)(((uint32_t)(x)) << CACHE_ISR_POWERR_SHIFT)) & CACHE_ISR_POWERR_MASK)

/*!
 * @brief CACHE_CSHR Register Bit Definition
 */

#define CACHE_CSHR_CSHR_SHIFT                   (0)
#define CACHE_CSHR_CSHR_MASK                    (0xFFFFFFFFU << CACHE_CSHR_CSHR_SHIFT)
#define CACHE_CSHR_CSHR(x)                      (((uint32_t)(((uint32_t)(x)) << CACHE_CSHR_CSHR_SHIFT)) & CACHE_CSHR_CSHR_MASK)

/*!
 * @brief CACHE_CSMR Register Bit Definition
 */

#define CACHE_CSMR_CSMR_SHIFT                   (0)
#define CACHE_CSMR_CSMR_MASK                    (0xFFFFFFFFU << CACHE_CSMR_CSMR_SHIFT)
#define CACHE_CSMR_CSMR(x)                      (((uint32_t)(((uint32_t)(x)) << CACHE_CSMR_CSMR_SHIFT)) & CACHE_CSMR_CSMR_MASK)

/*!
 * @}
 */ /* end of group CACHE_Register_Masks */
/******************************************************************************
 * CACHE Instance
******************************************************************************/
#define CACHE                               ((CACHE_Type*)CACHE_BASE)

/*!
 * @}
 */ /* end of group CACHE_Peripheral_Access_Layer */



/*!
 * @addtogroup PWR_Peripheral_Access_Layer PWR Peripheral Access Layer
 *  @{
 */

