RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define RCC_CSR_VDTRSTNEN_SHIFT                 (8)
#define RCC_CSR_VDTRSTNEN_MASK                  (0x01U << RCC_CSR_VDTRSTNEN_SHIFT)
#define RCC_CSR_VDTRSTNEN(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_CSR_VDTRSTNEN_SHIFT)) & RCC_CSR_VDTRSTNEN_MASK)

#define RCC_CSR_LOCKUPEN_SHIFT                  (7)
#define RCC_CSR_LOCKUPEN_MASK                   (0x01U << RCC_CSR_LOCKUPEN_SHIFT)
#define RCC_CSR_LOCKUPEN(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LOCKUPEN_SHIFT)) & RCC_CSR_LOCKUPEN_MASK)

#define RCC_CSR_PVDRSTEN_SHIFT                  (6)
#define RCC_CSR_PVDRSTEN_MASK                   (0x01U << RCC_CSR_PVDRSTEN_SHIFT)
#define RCC_CSR_PVDRSTEN(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CSR_PVDRSTEN_SHIFT)) & RCC_CSR_PVDRSTEN_MASK)

#define RCC_CSR_LSIOENLV_SHIFT                  (5)
#define RCC_CSR_LSIOENLV_MASK                   (0x01U << RCC_CSR_LSIOENLV_SHIFT)
#define RCC_CSR_LSIOENLV(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSIOENLV_SHIFT)) & RCC_CSR_LSIOENLV_MASK)

#define RCC_CSR_LSIRDY_SHIFT                    (1)
#define RCC_CSR_LSIRDY_MASK                     (0x01U << RCC_CSR_LSIRDY_SHIFT)
#define RCC_CSR_LSIRDY(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSIRDY_SHIFT)) & RCC_CSR_LSIRDY_MASK)

#define RCC_CSR_LSION_SHIFT                     (0)
#define RCC_CSR_LSION_MASK                      (0x01U << RCC_CSR_LSION_SHIFT)
#define RCC_CSR_LSION(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSION_SHIFT)) & RCC_CSR_LSION_MASK)

/*!
 * @brief RCC_SYSCFG Register Bit Definition
 */

#define RCC_SYSCFG_OSCLPFEN_SHIFT               (14)
#define RCC_SYSCFG_OSCLPFEN_MASK                (0x01U << RCC_SYSCFG_OSCLPFEN_SHIFT)
#define RCC_SYSCFG_OSCLPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_OSCLPFEN_SHIFT)) & RCC_SYSCFG_OSCLPFEN_MASK)

#define RCC_SYSCFG_PADOSCTRIM_SHIFT             (8)
#define RCC_SYSCFG_PADOSCTRIM_MASK              (0x1FU << RCC_SYSCFG_PADOSCTRIM_SHIFT)
#define RCC_SYSCFG_PADOSCTRIM(x)                (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_PADOSCTRIM_SHIFT)) & RCC_SYSCFG_PADOSCTRIM_MASK)

#define RCC_SYSCFG_DATAPREFETCH_SHIFT           (2)
#define RCC_SYSCFG_DATAPREFETCH_MASK            (0x01U << RCC_SYSCFG_DATAPREFETCH_SHIFT)
#define RCC_SYSCFG_DATAPREFETCH(x)              (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_DATAPREFETCH_SHIFT)) & RCC_SYSCFG_DATAPREFETCH_MASK)

#define RCC_SYSCFG_SECTOR1KCFG_SHIFT            (1)
#define RCC_SYSCFG_SECTOR1KCFG_MASK             (0x01U << RCC_SYSCFG_SECTOR1KCFG_SHIFT)
#define RCC_SYSCFG_SECTOR1KCFG(x)               (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_SECTOR1KCFG_SHIFT)) & RCC_SYSCFG_SECTOR1KCFG_MASK)

#define RCC_SYSCFG_PROGCHECKEN_SHIFT            (0)
#define RCC_SYSCFG_PROGCHECKEN_MASK             (0x01U << RCC_SYSCFG_PROGCHECKEN_SHIFT)
#define RCC_SYSCFG_PROGCHECKEN(x)               (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFG_PROGCHECKEN_SHIFT)) & RCC_SYSCFG_PROGCHECKEN_MASK)

/*!
 * @brief RCC_CFGR2 Register Bit Definition
 */

#define RCC_CFGR2_APB1CLKHVPRE_SHIFT            (16)
#define RCC_CFGR2_APB1CLKHVPRE_MASK             (0xFU << RCC_CFGR2_APB1CLKHVPRE_SHIFT)
#define RCC_CFGR2_APB1CLKHVPRE(x)               (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_APB1CLKHVPRE_SHIFT)) & RCC_CFGR2_APB1CLKHVPRE_MASK)

#define RCC_CFGR2_FSMCPRE_SHIFT                 (8)
#define RCC_CFGR2_FSMCPRE_MASK                  (0x1FU << RCC_CFGR2_FSMCPRE_SHIFT)
#define RCC_CFGR2_FSMCPRE(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_FSMCPRE_SHIFT)) & RCC_CFGR2_FSMCPRE_MASK)

#define RCC_CFGR2_TIMADVPRE_SHIFT               (1)
#define RCC_CFGR2_TIMADVPRE_MASK                (0x7U << RCC_CFGR2_TIMADVPRE_SHIFT)
#define RCC_CFGR2_TIMADVPRE(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_TIMADVPRE_SHIFT)) & RCC_CFGR2_TIMADVPRE_MASK)

#define RCC_CFGR2_TIMADVCKSEL_SHIFT             (0)
#define RCC_CFGR2_TIMADVCKSEL_MASK              (0x01U << RCC_CFGR2_TIMADVCKSEL_SHIFT)
#define RCC_CFGR2_TIMADVCKSEL(x)                (((uint32_t)(((uint32_t)(x)) << RCC_CFGR2_TIMADVCKSEL_SHIFT)) & RCC_CFGR2_TIMADVCKSEL_MASK)

/*!
 * @brief RCC_ICSCR Register Bit Definition
 */

#define RCC_ICSCR_HSICALSFT_SHIFT               (16)
#define RCC_ICSCR_HSICALSFT_MASK                (0x3FFU << RCC_ICSCR_HSICALSFT_SHIFT)
#define RCC_ICSCR_HSICALSFT(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_ICSCR_HSICALSFT_SHIFT)) & RCC_ICSCR_HSICALSFT_MASK)

#define RCC_ICSCR_HSICALSEL_SHIFT               (11)
#define RCC_ICSCR_HSICALSEL_MASK                (0x1FU << RCC_ICSCR_HSICALSEL_SHIFT)
#define RCC_ICSCR_HSICALSEL(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_ICSCR_HSICALSEL_SHIFT)) & RCC_ICSCR_HSICALSEL_MASK)

#define RCC_ICSCR_TRIMCRSSEL_SHIFT              (0)
#define RCC_ICSCR_TRIMCRSSEL_MASK               (0x01U << RCC_ICSCR_TRIMCRSSEL_SHIFT)
#define RCC_ICSCR_TRIMCRSSEL(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_ICSCR_TRIMCRSSEL_SHIFT)) & RCC_ICSCR_TRIMCRSSEL_MASK)

/*!
 * @brief RCC_PLLCFGR Register Bit Definition
 */

#define RCC_PLLCFGR_PLLMUL_SHIFT                (16)
#define RCC_PLLCFGR_PLLMUL_MASK                 (0x7FU << RCC_PLLCFGR_PLLMUL_SHIFT)
#define RCC_PLLCFGR_PLLMUL(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_PLLCFGR_PLLMUL_SHIFT)) & RCC_PLLCFGR_PLLMUL_MASK)

#define RCC_PLLCFGR_PLLDIV_SHIFT                (8)
#define RCC_PLLCFGR_PLLDIV_MASK                 (0x7U << RCC_PLLCFGR_PLLDIV_SHIFT)
#define RCC_PLLCFGR_PLLDIV(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_PLLCFGR_PLLDIV_SHIFT)) & RCC_PLLCFGR_PLLDIV_MASK)

#define RCC_PLLCFGR_PLLLDS_SHIFT                (4)
#define RCC_PLLCFGR_PLLLDS_MASK                 (0x3U << RCC_PLLCFGR_PLLLDS_SHIFT)
#define RCC_PLLCFGR_PLLLDS(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_PLLCFGR_PLLLDS_SHIFT)) & RCC_PLLCFGR_PLLLDS_MASK)

#define RCC_PLLCFGR_PLLICTRL_SHIFT              (2)
#define RCC_PLLCFGR_PLLICTRL_MASK               (0x3U << RCC_PLLCFGR_PLLICTRL_SHIFT)
#define RCC_PLLCFGR_PLLICTRL(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_PLLCFGR_PLLICTRL_SHIFT)) & RCC_PLLCFGR_PLLICTRL_MASK)

#define RCC_PLLCFGR_PLLXTPRE_SHIFT              (1)
#define RCC_PLLCFGR_PLLXTPRE_MASK               (0x01U << RCC_PLLCFGR_PLLXTPRE_SHIFT)
#define RCC_PLLCFGR_PLLXTPRE(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_PLLCFGR_PLLXTPRE_SHIFT)) & RCC_PLLCFGR_PLLXTPRE_MASK)

#define RCC_PLLCFGR_PLLSRC_SHIFT                (0)
#define RCC_PLLCFGR_PLLSRC_MASK                 (0x01U << RCC_PLLCFGR_PLLSRC_SHIFT)
#define RCC_PLLCFGR_PLLSRC(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_PLLCFGR_PLLSRC_SHIFT)) & RCC_PLLCFGR_PLLSRC_MASK)

/*!
 * @brief RCC_HSIDLY Register Bit Definition
 */

#define RCC_HSIDLY_HSIEQUCNT_SHIFT              (0)
#define RCC_HSIDLY_HSIEQUCNT_MASK               (0xFFU << RCC_HSIDLY_HSIEQUCNT_SHIFT)
#define RCC_HSIDLY_HSIEQUCNT(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_HSIDLY_HSIEQUCNT_SHIFT)) & RCC_HSIDLY_HSIEQUCNT_MASK)

/*!
 * @brief RCC_HSEDLY Register Bit Definition
 */

#define RCC_HSEDLY_HSEEQUCNT_SHIFT              (0)
#define RCC_HSEDLY_HSEEQUCNT_MASK               (0xFFFFU << RCC_HSEDLY_HSEEQUCNT_SHIFT)
#define RCC_HSEDLY_HSEEQUCNT(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_HSEDLY_HSEEQUCNT_SHIFT)) & RCC_HSEDLY_HSEEQUCNT_MASK)

/*!
 * @brief RCC_PLLDLY Register Bit Definition
 */

#define RCC_PLLDLY_PLLEQUCNT_SHIFT              (0)
#define RCC_PLLDLY_PLLEQUCNT_MASK               (0x3FFU << RCC_PLLDLY_PLLEQUCNT_SHIFT)
#define RCC_PLLDLY_PLLEQUCNT(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_PLLDLY_PLLEQUCNT_SHIFT)) & RCC_PLLDLY_PLLEQUCNT_MASK)

/*!
 * @}
 */ /* end of group RCC_Register_Masks */
/******************************************************************************
 * RCC Instance
******************************************************************************/
#define RCC                             ((RCC_Type*)RCC_BASE)

/*!
 * @}
 */ /* end of group RCC_Peripheral_Access_Layer */



/*!
 * @addtogroup SYSCFG_Peripheral_Access_Layer SYSCFG Peripheral Access Layer
 *  @{
 */

