RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define CRS_CR_AUTOTRIMEN_SHIFT                 (6)
#define CRS_CR_AUTOTRIMEN_MASK                  (0x01U << CRS_CR_AUTOTRIMEN_SHIFT)
#define CRS_CR_AUTOTRIMEN(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_CR_AUTOTRIMEN_SHIFT)) & CRS_CR_AUTOTRIMEN_MASK)

#define CRS_CR_CEN_SHIFT                        (5)
#define CRS_CR_CEN_MASK                         (0x01U << CRS_CR_CEN_SHIFT)
#define CRS_CR_CEN(x)                           (((uint32_t)(((uint32_t)(x)) << CRS_CR_CEN_SHIFT)) & CRS_CR_CEN_MASK)

#define CRS_CR_ESYNCIE_SHIFT                    (3)
#define CRS_CR_ESYNCIE_MASK                     (0x01U << CRS_CR_ESYNCIE_SHIFT)
#define CRS_CR_ESYNCIE(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_CR_ESYNCIE_SHIFT)) & CRS_CR_ESYNCIE_MASK)

#define CRS_CR_ERRIE_SHIFT                      (2)
#define CRS_CR_ERRIE_MASK                       (0x01U << CRS_CR_ERRIE_SHIFT)
#define CRS_CR_ERRIE(x)                         (((uint32_t)(((uint32_t)(x)) << CRS_CR_ERRIE_SHIFT)) & CRS_CR_ERRIE_MASK)

#define CRS_CR_SYNCWARNIE_SHIFT                 (1)
#define CRS_CR_SYNCWARNIE_MASK                  (0x01U << CRS_CR_SYNCWARNIE_SHIFT)
#define CRS_CR_SYNCWARNIE(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_CR_SYNCWARNIE_SHIFT)) & CRS_CR_SYNCWARNIE_MASK)

#define CRS_CR_SYNCOKIE_SHIFT                   (0)
#define CRS_CR_SYNCOKIE_MASK                    (0x01U << CRS_CR_SYNCOKIE_SHIFT)
#define CRS_CR_SYNCOKIE(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_CR_SYNCOKIE_SHIFT)) & CRS_CR_SYNCOKIE_MASK)

/*!
 * @brief CRS_CFGR Register Bit Definition
 */

#define CRS_CFGR_SYNCPOL_SHIFT                  (31)
#define CRS_CFGR_SYNCPOL_MASK                   (0x01U << CRS_CFGR_SYNCPOL_SHIFT)
#define CRS_CFGR_SYNCPOL(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_SYNCPOL_SHIFT)) & CRS_CFGR_SYNCPOL_MASK)

#define CRS_CFGR_SYNCSRC_SHIFT                  (28)
#define CRS_CFGR_SYNCSRC_MASK                   (0x3U << CRS_CFGR_SYNCSRC_SHIFT)
#define CRS_CFGR_SYNCSRC(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_SYNCSRC_SHIFT)) & CRS_CFGR_SYNCSRC_MASK)

#define CRS_CFGR_SYNCDIV_SHIFT                  (24)
#define CRS_CFGR_SYNCDIV_MASK                   (0x7U << CRS_CFGR_SYNCDIV_SHIFT)
#define CRS_CFGR_SYNCDIV(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_SYNCDIV_SHIFT)) & CRS_CFGR_SYNCDIV_MASK)

#define CRS_CFGR_FELIM_SHIFT                    (16)
#define CRS_CFGR_FELIM_MASK                     (0xFFU << CRS_CFGR_FELIM_SHIFT)
#define CRS_CFGR_FELIM(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_FELIM_SHIFT)) & CRS_CFGR_FELIM_MASK)

#define CRS_CFGR_RELOAD_SHIFT                   (0)
#define CRS_CFGR_RELOAD_MASK                    (0xFFFFU << CRS_CFGR_RELOAD_SHIFT)
#define CRS_CFGR_RELOAD(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_CFGR_RELOAD_SHIFT)) & CRS_CFGR_RELOAD_MASK)

/*!
 * @brief CRS_lSR Register Bit Definition
 */

#define CRS_lSR_FECAP_SHIFT                     (16)
#define CRS_lSR_FECAP_MASK                      (0xFFFFU << CRS_lSR_FECAP_SHIFT)
#define CRS_lSR_FECAP(x)                        (((uint32_t)(((uint32_t)(x)) << CRS_lSR_FECAP_SHIFT)) & CRS_lSR_FECAP_MASK)

#define CRS_lSR_FEDIR_SHIFT                     (15)
#define CRS_lSR_FEDIR_MASK                      (0x01U << CRS_lSR_FEDIR_SHIFT)
#define CRS_lSR_FEDIR(x)                        (((uint32_t)(((uint32_t)(x)) << CRS_lSR_FEDIR_SHIFT)) & CRS_lSR_FEDIR_MASK)

#define CRS_lSR_TRIMOVF_SHIFT                   (10)
#define CRS_lSR_TRIMOVF_MASK                    (0x01U << CRS_lSR_TRIMOVF_SHIFT)
#define CRS_lSR_TRIMOVF(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_lSR_TRIMOVF_SHIFT)) & CRS_lSR_TRIMOVF_MASK)

#define CRS_lSR_SYNCMISS_SHIFT                  (9)
#define CRS_lSR_SYNCMISS_MASK                   (0x01U << CRS_lSR_SYNCMISS_SHIFT)
#define CRS_lSR_SYNCMISS(x)                     (((uint32_t)(((uint32_t)(x)) << CRS_lSR_SYNCMISS_SHIFT)) & CRS_lSR_SYNCMISS_MASK)

#define CRS_lSR_SYNCERR_SHIFT                   (8)
#define CRS_lSR_SYNCERR_MASK                    (0x01U << CRS_lSR_SYNCERR_SHIFT)
#define CRS_lSR_SYNCERR(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_lSR_SYNCERR_SHIFT)) & CRS_lSR_SYNCERR_MASK)

#define CRS_lSR_ESYNCF_SHIFT                    (3)
#define CRS_lSR_ESYNCF_MASK                     (0x01U << CRS_lSR_ESYNCF_SHIFT)
#define CRS_lSR_ESYNCF(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_lSR_ESYNCF_SHIFT)) & CRS_lSR_ESYNCF_MASK)

#define CRS_lSR_ERRF_SHIFT                      (2)
#define CRS_lSR_ERRF_MASK                       (0x01U << CRS_lSR_ERRF_SHIFT)
#define CRS_lSR_ERRF(x)                         (((uint32_t)(((uint32_t)(x)) << CRS_lSR_ERRF_SHIFT)) & CRS_lSR_ERRF_MASK)

#define CRS_lSR_SYNCWARNF_SHIFT                 (1)
#define CRS_lSR_SYNCWARNF_MASK                  (0x01U << CRS_lSR_SYNCWARNF_SHIFT)
#define CRS_lSR_SYNCWARNF(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_lSR_SYNCWARNF_SHIFT)) & CRS_lSR_SYNCWARNF_MASK)

#define CRS_lSR_SYNCOKF_SHIFT                   (0)
#define CRS_lSR_SYNCOKF_MASK                    (0x01U << CRS_lSR_SYNCOKF_SHIFT)
#define CRS_lSR_SYNCOKF(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_lSR_SYNCOKF_SHIFT)) & CRS_lSR_SYNCOKF_MASK)

/*!
 * @brief CRS_lCR Register Bit Definition
 */

#define CRS_lCR_ESYNCC_SHIFT                    (3)
#define CRS_lCR_ESYNCC_MASK                     (0x01U << CRS_lCR_ESYNCC_SHIFT)
#define CRS_lCR_ESYNCC(x)                       (((uint32_t)(((uint32_t)(x)) << CRS_lCR_ESYNCC_SHIFT)) & CRS_lCR_ESYNCC_MASK)

#define CRS_lCR_ERRC_SHIFT                      (2)
#define CRS_lCR_ERRC_MASK                       (0x01U << CRS_lCR_ERRC_SHIFT)
#define CRS_lCR_ERRC(x)                         (((uint32_t)(((uint32_t)(x)) << CRS_lCR_ERRC_SHIFT)) & CRS_lCR_ERRC_MASK)

#define CRS_lCR_SYNCWARNC_SHIFT                 (1)
#define CRS_lCR_SYNCWARNC_MASK                  (0x01U << CRS_lCR_SYNCWARNC_SHIFT)
#define CRS_lCR_SYNCWARNC(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_lCR_SYNCWARNC_SHIFT)) & CRS_lCR_SYNCWARNC_MASK)

#define CRS_lCR_SYNCOKC_SHIFT                   (0)
#define CRS_lCR_SYNCOKC_MASK                    (0x01U << CRS_lCR_SYNCOKC_SHIFT)
#define CRS_lCR_SYNCOKC(x)                      (((uint32_t)(((uint32_t)(x)) << CRS_lCR_SYNCOKC_SHIFT)) & CRS_lCR_SYNCOKC_MASK)

/*!
 * @}
 */ /* end of group CRS_Register_Masks */
/******************************************************************************
 * CRS Instance
******************************************************************************/
#define CRS                             ((CRS_Type*)CRS_BASE)

/*!
 * @}
 */ /* end of group CRS_Peripheral_Access_Layer */



/*!
 * @addtogroup GPIO_Peripheral_Access_Layer GPIO Peripheral Access Layer
 *  @{
 */

