RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define GPIO_DCR_PX15PX1_SHIFT                 (2)
#define GPIO_DCR_PX15PX1_MASK                  (0x3FFFFFFFU << GPIO_DCR_PX15PX1_SHIFT)
#define GPIO_DCR_PX15PX1(x)                    (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX15PX1_SHIFT)) & GPIO_DCR_PX15PX1_MASK)

#define GPIO_DCR_PX0_SHIFT                      (0)
#define GPIO_DCR_PX0_MASK                       (0x3U << GPIO_DCR_PX0_SHIFT)
#define GPIO_DCR_PX0(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX0_SHIFT)) & GPIO_DCR_PX0_MASK)

/*!
 * @brief GPIO_AFRL Register Bit Definition
 */

#define GPIO_AFRL_AFRY_SHIFT                    (0)
#define GPIO_AFRL_AFRY_MASK                     (0xFFFFFFFFU << GPIO_AFRL_AFRY_SHIFT)
#define GPIO_AFRL_AFRY(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFRY_SHIFT)) & GPIO_AFRL_AFRY_MASK)

/*!
 * @brief GPIO_AFRH Register Bit Definition
 */

#define GPIO_AFRH_AFRY_SHIFT                    (0)
#define GPIO_AFRH_AFRY_MASK                     (0xFFFFFFFFU << GPIO_AFRH_AFRY_SHIFT)
#define GPIO_AFRH_AFRY(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFRY_SHIFT)) & GPIO_AFRH_AFRY_MASK)

/*!
 * @}
 */ /* end of group GPIO_Register_Masks */
/******************************************************************************
 * GPIO Instance
******************************************************************************/
#define GPIOA                               ((GPIO_Type*)GPIOA_BASE)
#define GPIOB                               ((GPIO_Type*)GPIOB_BASE)
#define GPIOC                               ((GPIO_Type*)GPIOC_BASE)
#define GPIOD                               ((GPIO_Type*)GPIOD_BASE)
#define GPIOE                               ((GPIO_Type*)GPIOE_BASE)
#define GPIOF                               ((GPIO_Type*)GPIOF_BASE)
#define GPIOG                               ((GPIO_Type*)GPIOG_BASE)
#define GPIOH                               ((GPIO_Type*)GPIOH_BASE)

/*!
 * @}
 */ /* end of group GPIO_Peripheral_Access_Layer */



/*!
 * @addtogroup TIM1_Peripheral_Access_Layer TIM1 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM1 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                            ///< Control register 1                           offset: 0x00
    __IO uint32_t CR2;                                                            ///< Control register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                           ///< Slave mode control register                  offset: 0x08
    __IO uint32_t DIER;                                                           ///< DMA/interrupt enable register                offset: 0x0C
    __IO uint32_t SR;                                                             ///< Status register                              offset: 0x10
    __IO uint32_t EGR;                                                            ///< Event generation register                    offset: 0x14
    __IO uint32_t CCMR1;                                                          ///< Capture/compare mode register 1              offset: 0x18
    __IO uint32_t CCMR2;                                                          ///< Capture/compare mode register 2              offset: 0x1C
    __IO uint32_t CCER;                                                           ///< Capture/compare enable register              offset: 0x20
    __IO uint32_t CNT;                                                            ///< Counter                                      offset: 0x24
    __IO uint32_t PSC;                                                            ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                            ///< Autoload register                            offset: 0x2C
    __IO uint32_t RCR;                                                            ///< Repeat count register                        offset: 0x30
    __IO uint32_t CCR[4];
//    __IO uint32_t CCR1;                                                           ///< Capture/compare register 1                   offset: 0x34
//    __IO uint32_t CCR2;                                                           ///< Capture/compare register 2                   offset: 0x38
//    __IO uint32_t CCR3;                                                           ///< Capture/compare register 3                   offset: 0x3C
//    __IO uint32_t CCR4;                                                           ///< Capture/compare register 4                   offset: 0x40
    __IO uint32_t BDTR;                                                           ///< Brake and dead zone registers                offset: 0x44
    __IO uint32_t DCR;                                                            ///< DMA control register                         offset: 0x48
    __IO uint32_t DMAR;                                                           ///< DMA address in continuous mode               offset: 0x4C
    __IO uint32_t Reserved7[1];                                                   ///< Reserved
    __IO uint32_t CCMR3;                                                          ///< Capture/compare mode register 3              offset: 0x54
    __IO uint32_t CCR5;                                                           ///< Capture/compare register 5                   offset: 0x58
    __IO uint32_t PDER;                                                           ///< PWM phase shift/DMA repeat update request enable register offset: 0x5C
    __IO uint32_t CCRFALL[5];                                                     ///< PWM phase shift down counting capture/compare register offset: 0x60
} TIM1_Type;

/*******************************************************************************
 * TIM1 Type
 ******************************************************************************/

/*!
 * @addtogroup TIM1_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM1_CR1 Register Bit Definition
 */

#define TIM1_CR1_CKD_SHIFT                      (8)
#define TIM1_CR1_CKD_MASK                       (0x3U << TIM1_CR1_CKD_SHIFT)
#define TIM1_CR1_CKD(x)                         (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_CKD_SHIFT)) & TIM1_CR1_CKD_MASK)

