RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define TIM2_EGR_UG_SHIFT                       (0)
#define TIM2_EGR_UG_MASK                        (0x01U << TIM2_EGR_UG_SHIFT)
#define TIM2_EGR_UG(x)                          (((uint32_t)(((uint32_t)(x)) << TIM2_EGR_UG_SHIFT)) & TIM2_EGR_UG_MASK)

/*!
 * @brief TIM2_CCMR1 Register Bit Definition
 */

#define TIM2_CCMR1_OC2CE_SHIFT                  (15)
#define TIM2_CCMR1_OC2CE_MASK                   (0x01U << TIM2_CCMR1_OC2CE_SHIFT)
#define TIM2_CCMR1_OC2CE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC2CE_SHIFT)) & TIM2_CCMR1_OC2CE_MASK)

#define TIM2_CCMR1_OC2M_SHIFT                   (12)
#define TIM2_CCMR1_OC2M_MASK                    (0x7U << TIM2_CCMR1_OC2M_SHIFT)
#define TIM2_CCMR1_OC2M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC2M_SHIFT)) & TIM2_CCMR1_OC2M_MASK)

#define TIM2_CCMR1_OC2PE_SHIFT                  (11)
#define TIM2_CCMR1_OC2PE_MASK                   (0x01U << TIM2_CCMR1_OC2PE_SHIFT)
#define TIM2_CCMR1_OC2PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC2PE_SHIFT)) & TIM2_CCMR1_OC2PE_MASK)

#define TIM2_CCMR1_OC2FE_SHIFT                  (10)
#define TIM2_CCMR1_OC2FE_MASK                   (0x01U << TIM2_CCMR1_OC2FE_SHIFT)
#define TIM2_CCMR1_OC2FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC2FE_SHIFT)) & TIM2_CCMR1_OC2FE_MASK)

#define TIM2_CCMR1_CC2S_SHIFT                   (8)
#define TIM2_CCMR1_CC2S_MASK                    (0x3U << TIM2_CCMR1_CC2S_SHIFT)
#define TIM2_CCMR1_CC2S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_CC2S_SHIFT)) & TIM2_CCMR1_CC2S_MASK)

#define TIM2_CCMR1_OC1CE_SHIFT                  (7)
#define TIM2_CCMR1_OC1CE_MASK                   (0x01U << TIM2_CCMR1_OC1CE_SHIFT)
#define TIM2_CCMR1_OC1CE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC1CE_SHIFT)) & TIM2_CCMR1_OC1CE_MASK)

#define TIM2_CCMR1_OC1M_SHIFT                   (4)
#define TIM2_CCMR1_OC1M_MASK                    (0x7U << TIM2_CCMR1_OC1M_SHIFT)
#define TIM2_CCMR1_OC1M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC1M_SHIFT)) & TIM2_CCMR1_OC1M_MASK)

#define TIM2_CCMR1_OC1PE_SHIFT                  (3)
#define TIM2_CCMR1_OC1PE_MASK                   (0x01U << TIM2_CCMR1_OC1PE_SHIFT)
#define TIM2_CCMR1_OC1PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC1PE_SHIFT)) & TIM2_CCMR1_OC1PE_MASK)

#define TIM2_CCMR1_OC1FE_SHIFT                  (2)
#define TIM2_CCMR1_OC1FE_MASK                   (0x01U << TIM2_CCMR1_OC1FE_SHIFT)
#define TIM2_CCMR1_OC1FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_OC1FE_SHIFT)) & TIM2_CCMR1_OC1FE_MASK)

#define TIM2_CCMR1_CC1S_SHIFT                   (0)
#define TIM2_CCMR1_CC1S_MASK                    (0x3U << TIM2_CCMR1_CC1S_SHIFT)
#define TIM2_CCMR1_CC1S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_CC1S_SHIFT)) & TIM2_CCMR1_CC1S_MASK)

/*!
 * @brief TIM2_CCMR1 Register Bit Definition
 */

#define TIM2_CCMR1_IC2F_SHIFT                   (12)
#define TIM2_CCMR1_IC2F_MASK                    (0xFU << TIM2_CCMR1_IC2F_SHIFT)
#define TIM2_CCMR1_IC2F(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_IC2F_SHIFT)) & TIM2_CCMR1_IC2F_MASK)

#define TIM2_CCMR1_IC2PSC_SHIFT                 (10)
#define TIM2_CCMR1_IC2PSC_MASK                  (0x3U << TIM2_CCMR1_IC2PSC_SHIFT)
#define TIM2_CCMR1_IC2PSC(x)                    (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_IC2PSC_SHIFT)) & TIM2_CCMR1_IC2PSC_MASK)

#define TIM2_CCMR1_CC2S_SHIFT                   (8)
#define TIM2_CCMR1_CC2S_MASK                    (0x3U << TIM2_CCMR1_CC2S_SHIFT)
#define TIM2_CCMR1_CC2S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_CC2S_SHIFT)) & TIM2_CCMR1_CC2S_MASK)

#define TIM2_CCMR1_IC1F_SHIFT                   (4)
#define TIM2_CCMR1_IC1F_MASK                    (0xFU << TIM2_CCMR1_IC1F_SHIFT)
#define TIM2_CCMR1_IC1F(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_IC1F_SHIFT)) & TIM2_CCMR1_IC1F_MASK)

#define TIM2_CCMR1_IC1PSC_SHIFT                 (2)
#define TIM2_CCMR1_IC1PSC_MASK                  (0x3U << TIM2_CCMR1_IC1PSC_SHIFT)
#define TIM2_CCMR1_IC1PSC(x)                    (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_IC1PSC_SHIFT)) & TIM2_CCMR1_IC1PSC_MASK)

#define TIM2_CCMR1_CC1S_SHIFT                   (0)
#define TIM2_CCMR1_CC1S_MASK                    (0x3U << TIM2_CCMR1_CC1S_SHIFT)
#define TIM2_CCMR1_CC1S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1_CC1S_SHIFT)) & TIM2_CCMR1_CC1S_MASK)

/*!
 * @brief TIM2_CCMR2 Register Bit Definition
 */

#define TIM2_CCMR2_OC4CE_SHIFT                  (15)
#define TIM2_CCMR2_OC4CE_MASK                   (0x01U << TIM2_CCMR2_OC4CE_SHIFT)
#define TIM2_CCMR2_OC4CE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC4CE_SHIFT)) & TIM2_CCMR2_OC4CE_MASK)

#define TIM2_CCMR2_OC4M_SHIFT                   (12)
#define TIM2_CCMR2_OC4M_MASK                    (0x7U << TIM2_CCMR2_OC4M_SHIFT)
#define TIM2_CCMR2_OC4M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC4M_SHIFT)) & TIM2_CCMR2_OC4M_MASK)

#define TIM2_CCMR2_OC4PE_SHIFT                  (11)
#define TIM2_CCMR2_OC4PE_MASK                   (0x01U << TIM2_CCMR2_OC4PE_SHIFT)
#define TIM2_CCMR2_OC4PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC4PE_SHIFT)) & TIM2_CCMR2_OC4PE_MASK)

#define TIM2_CCMR2_OC4FE_SHIFT                  (10)
#define TIM2_CCMR2_OC4FE_MASK                   (0x01U << TIM2_CCMR2_OC4FE_SHIFT)
#define TIM2_CCMR2_OC4FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC4FE_SHIFT)) & TIM2_CCMR2_OC4FE_MASK)

#define TIM2_CCMR2_CC4S_SHIFT                   (8)
#define TIM2_CCMR2_CC4S_MASK                    (0x3U << TIM2_CCMR2_CC4S_SHIFT)
#define TIM2_CCMR2_CC4S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_CC4S_SHIFT)) & TIM2_CCMR2_CC4S_MASK)

#define TIM2_CCMR2_OC3CE_SHIFT                  (7)
#define TIM2_CCMR2_OC3CE_MASK                   (0x01U << TIM2_CCMR2_OC3CE_SHIFT)
#define TIM2_CCMR2_OC3CE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC3CE_SHIFT)) & TIM2_CCMR2_OC3CE_MASK)

#define TIM2_CCMR2_OC3M_SHIFT                   (4)
#define TIM2_CCMR2_OC3M_MASK                    (0x7U << TIM2_CCMR2_OC3M_SHIFT)
#define TIM2_CCMR2_OC3M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC3M_SHIFT)) & TIM2_CCMR2_OC3M_MASK)

#define TIM2_CCMR2_OC3PE_SHIFT                  (3)
#define TIM2_CCMR2_OC3PE_MASK                   (0x01U << TIM2_CCMR2_OC3PE_SHIFT)
#define TIM2_CCMR2_OC3PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC3PE_SHIFT)) & TIM2_CCMR2_OC3PE_MASK)

#define TIM2_CCMR2_OC3FE_SHIFT                  (2)
#define TIM2_CCMR2_OC3FE_MASK                   (0x01U << TIM2_CCMR2_OC3FE_SHIFT)
#define TIM2_CCMR2_OC3FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_OC3FE_SHIFT)) & TIM2_CCMR2_OC3FE_MASK)

#define TIM2_CCMR2_CC3S_SHIFT                   (0)
#define TIM2_CCMR2_CC3S_MASK                    (0x3U << TIM2_CCMR2_CC3S_SHIFT)
#define TIM2_CCMR2_CC3S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_CC3S_SHIFT)) & TIM2_CCMR2_CC3S_MASK)

/*!
 * @brief TIM2_CCMR2 Register Bit Definition
 */

#define TIM2_CCMR2_IC4F_SHIFT                   (12)
#define TIM2_CCMR2_IC4F_MASK                    (0xFU << TIM2_CCMR2_IC4F_SHIFT)
#define TIM2_CCMR2_IC4F(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_IC4F_SHIFT)) & TIM2_CCMR2_IC4F_MASK)

#define TIM2_CCMR2_IC4PSC_SHIFT                 (10)
#define TIM2_CCMR2_IC4PSC_MASK                  (0x3U << TIM2_CCMR2_IC4PSC_SHIFT)
#define TIM2_CCMR2_IC4PSC(x)                    (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_IC4PSC_SHIFT)) & TIM2_CCMR2_IC4PSC_MASK)

#define TIM2_CCMR2_CC4S_SHIFT                   (8)
#define TIM2_CCMR2_CC4S_MASK                    (0x3U << TIM2_CCMR2_CC4S_SHIFT)
#define TIM2_CCMR2_CC4S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2_CC4S_SHIFT)) & TIM2_CCMR2_CC4S_MASK)

