RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define SPI_I2S_RXDNR_RXDNR_SHIFT               (0)
#define SPI_I2S_RXDNR_RXDNR_MASK                (0xFFFFU << SPI_I2S_RXDNR_RXDNR_SHIFT)
#define SPI_I2S_RXDNR_RXDNR(x)                  (((uint32_t)(((uint32_t)(x)) << SPI_I2S_RXDNR_RXDNR_SHIFT)) & SPI_I2S_RXDNR_RXDNR_MASK)

/*!
 * @brief SPI_I2S_NSSR Register Bit Definition
 */

#define SPI_I2S_NSSR_NSS_SHIFT                  (0)
#define SPI_I2S_NSSR_NSS_MASK                   (0x01U << SPI_I2S_NSSR_NSS_SHIFT)
#define SPI_I2S_NSSR_NSS(x)                     (((uint32_t)(((uint32_t)(x)) << SPI_I2S_NSSR_NSS_SHIFT)) & SPI_I2S_NSSR_NSS_MASK)

/*!
 * @brief SPI_I2S_EXTCTL Register Bit Definition
 */

#define SPI_I2S_EXTCTL_EXTLEN_SHIFT             (0)
#define SPI_I2S_EXTCTL_EXTLEN_MASK              (0x1FU << SPI_I2S_EXTCTL_EXTLEN_SHIFT)
#define SPI_I2S_EXTCTL_EXTLEN(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_EXTCTL_EXTLEN_SHIFT)) & SPI_I2S_EXTCTL_EXTLEN_MASK)

/*!
 * @brief SPI_I2S_I2SCFGR Register Bit Definition
 */

#define SPI_I2S_I2SCFGR_I2SDIV_SHIFT            (16)
#define SPI_I2S_I2SCFGR_I2SDIV_MASK             (0x1FFU << SPI_I2S_I2SCFGR_I2SDIV_SHIFT)
#define SPI_I2S_I2SCFGR_I2SDIV(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_I2SDIV_SHIFT)) & SPI_I2S_I2SCFGR_I2SDIV_MASK)

#define SPI_I2S_I2SCFGR_MCKOE_SHIFT             (11)
#define SPI_I2S_I2SCFGR_MCKOE_MASK              (0x01U << SPI_I2S_I2SCFGR_MCKOE_SHIFT)
#define SPI_I2S_I2SCFGR_MCKOE(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_MCKOE_SHIFT)) & SPI_I2S_I2SCFGR_MCKOE_MASK)

#define SPI_I2S_I2SCFGR_SPII2S_SHIFT            (10)
#define SPI_I2S_I2SCFGR_SPII2S_MASK             (0x01U << SPI_I2S_I2SCFGR_SPII2S_SHIFT)
#define SPI_I2S_I2SCFGR_SPII2S(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_SPII2S_SHIFT)) & SPI_I2S_I2SCFGR_SPII2S_MASK)

#define SPI_I2S_I2SCFGR_PCMSYNC_SHIFT           (6)
#define SPI_I2S_I2SCFGR_PCMSYNC_MASK            (0x01U << SPI_I2S_I2SCFGR_PCMSYNC_SHIFT)
#define SPI_I2S_I2SCFGR_PCMSYNC(x)              (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_PCMSYNC_SHIFT)) & SPI_I2S_I2SCFGR_PCMSYNC_MASK)

#define SPI_I2S_I2SCFGR_I2SSTD_SHIFT            (4)
#define SPI_I2S_I2SCFGR_I2SSTD_MASK             (0x3U << SPI_I2S_I2SCFGR_I2SSTD_SHIFT)
#define SPI_I2S_I2SCFGR_I2SSTD(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_I2SSTD_SHIFT)) & SPI_I2S_I2SCFGR_I2SSTD_MASK)

#define SPI_I2S_I2SCFGR_DATLEN_SHIFT            (1)
#define SPI_I2S_I2SCFGR_DATLEN_MASK             (0x3U << SPI_I2S_I2SCFGR_DATLEN_SHIFT)
#define SPI_I2S_I2SCFGR_DATLEN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_DATLEN_SHIFT)) & SPI_I2S_I2SCFGR_DATLEN_MASK)

#define SPI_I2S_I2SCFGR_CHLEN_SHIFT             (0)
#define SPI_I2S_I2SCFGR_CHLEN_MASK              (0x01U << SPI_I2S_I2SCFGR_CHLEN_SHIFT)
#define SPI_I2S_I2SCFGR_CHLEN(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_CHLEN_SHIFT)) & SPI_I2S_I2SCFGR_CHLEN_MASK)

/*!
 * @}
 */ /* end of group SPI_Register_Masks */
/******************************************************************************
 * SPI Instance
******************************************************************************/
#define SPI1                                ((SPI_Type*)SPI1_BASE)
#define SPI2                                ((SPI_Type*)SPI2_BASE)
#define SPI3                                ((SPI_Type*)SPI3_BASE)

/*!
 * @}
 */ /* end of group SPI_Peripheral_Access_Layer */



/*!
 * @addtogroup I2C_Peripheral_Access_Layer I2C Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * I2C Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< I2C control register                         offset: 0x00
    __IO uint32_t TAR;                                                            ///< I2C target address register                  offset: 0x04
    __IO uint32_t SAR;                                                            ///< I2C slave address register                   offset: 0x08
    __IO uint32_t Reserved14[1];                                                   ///< Reserved
    __IO uint32_t DR;                                                             ///< I2C data command register                    offset: 0x10
    __IO uint32_t SSHR;                                                           ///< Standard mode I2C clock high level count registeroffset: 0x14
    __IO uint32_t SSLR;                                                           ///< Standard mode I2C clock low count register   offset: 0x18
    __IO uint32_t FSHR;                                                           ///< Fast mode I2C clock high level count registeroffset: 0x1C
    __IO uint32_t FSLR;                                                           ///< Fast mode I2C clock low count register       offset: 0x20
    __IO uint32_t Reserved15[2];                                                   ///< Reserved
    __IO uint32_t ISR;                                                            ///< I2C interrupt status register                offset: 0x2C
    __IO uint32_t IMR;                                                            ///< I2C interrupt mask register                  offset: 0x30
    __IO uint32_t RAWISR;                                                         ///< I2C RAW interrupt register                   offset: 0x34
    __IO uint32_t RXTLR;                                                          ///< I2C receive threshold                        offset: 0x38
    __IO uint32_t TXTLR;                                                          ///< I2C send threshold                           offset: 0x3C
    __IO uint32_t ICR;                                                            ///< I2C combination and independent interrupt clear registeroffset: 0x40
    __IO uint32_t RXUNDER;                                                       ///< I2C clears the RXUNDER interrupt register   offset: 0x44
    __IO uint32_t RXOVER;                                                        ///< I2C clears the RXOVER interrupt register    offset: 0x48
    __IO uint32_t TXOVER;                                                        ///< I2C clear TXOVER interrupt register         offset: 0x4C
    __IO uint32_t RDREQ;                                                         ///< I2C clears the RDREQ interrupt register     offset: 0x50
    __IO uint32_t TXABRT;                                                        ///< I2C clear TXABRT interrupt register         offset: 0x54
    __IO uint32_t RXDONE;                                                        ///< I2C clears the RXDONE interrupt register    offset: 0x58
    __IO uint32_t ACTIV;                                                          ///< I2C clears the ACTIVITY interrupt register   offset: 0x5C
    __IO uint32_t STOP;                                                           ///< I2C clears the STOP_DET interrupt register   offset: 0x60
    __IO uint32_t START;                                                          ///< I2C clears the START_DET interrupt register  offset: 0x64
    __IO uint32_t GC;                                                             ///< I2C clears the GEN_CALL interrupt register   offset: 0x68
    __IO uint32_t ENR;                                                            ///< I2C enable register                          offset: 0x6C
    __IO uint32_t SR;                                                             ///< I2C status register                          offset: 0x70
    __IO uint32_t TXFLR;                                                          ///< I2C transmit buffer level register           offset: 0x74
    __IO uint32_t RXFLR;                                                          ///< I2C receive buffer level register            offset: 0x78
    __IO uint32_t HOLD;                                                           ///< I2C SDA hold time register                   offset: 0x7C
    __IO uint32_t Reserved16[2];                                                   ///< Reserved
    __IO uint32_t DMA;                                                            ///< I2C DMA control register                     offset: 0x88
    __IO uint32_t Reserved17[2];                                                   ///< Reserved
    __IO uint32_t SETUP;                                                          ///< I2C SDA Setup Time Register                  offset: 0x94
    __IO uint32_t GCR;                                                            ///< I2C general call ACK register                offset: 0x98
    __IO uint32_t Reserved18[5];                                                   ///< Reserved
    __IO uint32_t SLVMASK;                                                        ///< I2C slave address mask register              offset: 0xB0
    __IO uint32_t SLVRCVADDR;                                                     ///< I2C slave receiver address register          offset: 0xB4
} I2C_Type;

