RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
/*******************************************************************************
 * CAN Basic Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< CAN control register                         offset: 0x00
    __IO uint32_t CMR;                                                            ///< CAN command register                         offset: 0x04
    __IO uint32_t SR;                                                             ///< CAN status register                          offset: 0x08
    __IO uint32_t IR;                                                             ///< CAN Interrupt Register                     offset: 0x0C
    __IO uint32_t GROUP0ACR;                                                     ///< CAN Acceptance Code Register Group 0         offset: 0x10
    __IO uint32_t GROUP0AMR;                                                     ///< CAN acceptance mask register group 0         offset: 0x14
    __IO uint32_t BTR0;                                                           ///< CAN bus timing 0                             offset: 0x18
    __IO uint32_t BTR1;                                                           ///< CAN bus timing 1                             offset: 0x1C
    __IO uint32_t Reserved19[2];                                                   ///< Reserved
    __IO uint32_t TXID0;                                                          ///< CAN send identification code register 0      offset: 0x28
    __IO uint32_t TXID1;                                                          ///< CAN send identification code register 1      offset: 0x2C
    __IO uint32_t Reserved20[20];                                                  ///< Reserved
    __IO uint32_t CDR;                                                            ///< CAN clock divider register                   offset: 0x7C
    __IO uint32_t AFM0;                                                           ///< CAN filter mode register 0                   offset: 0x80
    __IO uint32_t AFM1;                                                           ///< CAN filter mode register 1                   offset: 0x84
    __IO uint32_t AFM2;                                                           ///< CAN filter mode register 2                   offset: 0x88
    __IO uint32_t FGA0;                                                           ///< CAN filter group enable register 0           offset: 0x8c
    __IO uint32_t FGA1;                                                           ///< CAN filter group enable register 1           offset: 0x90
    __IO uint32_t FGA2;                                                           ///< CAN filter group enable register 2           offset: 0x94
    __IO uint32_t GROUPACR;                                                     ///< CAN Acceptance Code Register Group x(X = 1~19)offset: 0x98
    __IO uint32_t Reserved21[3];                                                   ///< Reserved
    __IO uint32_t GROUPAMR;                                                     ///< CAN Acceptance Mask Register Group x(X = 1~19)offset: 0xA8
} CAN_Basic_Type;
/*******************************************************************************
 * CAN Peli Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MOD;                                                            ///< CAN mode register                            offset: 0x00
    __IO uint32_t CMR;                                                            ///< CAN command register                         offset: 0x04
    __IO uint32_t SR;                                                             ///< CAN status register                          offset: 0x08
    __IO uint32_t Reserved19a[1];                                                 ///< Reserved
    __IO uint32_t IER;                                                            ///< CAN interrupt enable register                offset: 0x10
    __IO uint32_t Reserved20a[1];                                                 ///< Reserved
    __IO uint32_t BTR0;                                                           ///< CAN bus timing 0                             offset: 0x18
    __IO uint32_t BTR1;                                                           ///< CAN bus timing 1                             offset: 0x1C
    __IO uint32_t Reserved21a[3];                                                 ///< Reserved
    __IO uint32_t ALC;                                                            ///< CAN Arbitration Loss Capture Register        offset: 0x2C
    __IO uint32_t ECC;                                                            ///< CAN error code capture                       offset: 0x30
    __IO uint32_t EWLR;                                                           ///< CAN error alarm limit register               offset: 0x34
    __IO uint32_t RXERR;                                                          ///< CAN RX error count register                  offset: 0x38
    __IO uint32_t TXERR;                                                          ///< CAN TX error count register                  offset: 0x3C
    __IO uint32_t SFF;                                                            ///< Send frame information register              offset: 0x40
    __IO uint32_t TXID0;                                                          ///< CAN send identification code register 0      offset: 0x44
    __IO uint32_t TXID1;                                                          ///< CAN send identification code register 1      offset: 0x48
    __IO uint32_t TXDATA0;                                                        ///< CAN send data register 0                     offset: 0x4C
    __IO uint32_t TXDATA1;                                                        ///< CAN send data register 1                     offset: 0x50
    __IO uint32_t Reserved20[10];                                                 ///< Reserved
    __IO uint32_t CDR;                                                            ///< CAN clock divider register                   offset: 0x7C
    __IO uint32_t AFM0;                                                           ///< CAN filter mode register 0                   offset: 0x80
    __IO uint32_t AFM1;                                                           ///< CAN filter mode register 1                   offset: 0x84
    __IO uint32_t AFM2;                                                           ///< CAN filter mode register 2                   offset: 0x88
    __IO uint32_t FGA0;                                                           ///< CAN filter group enable register 0           offset: 0x8c
    __IO uint32_t FGA1;                                                           ///< CAN filter group enable register 1           offset: 0x90
    __IO uint32_t FGA2;                                                           ///< CAN filter group enable register 2           offset: 0x94
    __IO uint32_t GROUPACR;                                                       ///< CAN Acceptance Code Register Group x(X = 1~19)offset: 0x98
    __IO uint32_t Reserved21[3];                                                  ///< Reserved
    __IO uint32_t GROUPAMR;                                                       ///< CAN Acceptance Mask Register Group x(X = 1~19)offset: 0xA8
} CAN_Peli_Type;

