RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define CAN_IR_ALI_SHIFT                        (6)
#define CAN_IR_ALI_MASK                         (0x01U << CAN_IR_ALI_SHIFT)
#define CAN_IR_ALI(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_IR_ALI_SHIFT)) & CAN_IR_ALI_MASK)

#define CAN_IR_EPI_SHIFT                        (5)
#define CAN_IR_EPI_MASK                         (0x01U << CAN_IR_EPI_SHIFT)
#define CAN_IR_EPI(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_IR_EPI_SHIFT)) & CAN_IR_EPI_MASK)

#define CAN_IR_DOI_SHIFT                        (3)
#define CAN_IR_DOI_MASK                         (0x01U << CAN_IR_DOI_SHIFT)
#define CAN_IR_DOI(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_IR_DOI_SHIFT)) & CAN_IR_DOI_MASK)

#define CAN_IR_EI_SHIFT                         (2)
#define CAN_IR_EI_MASK                          (0x01U << CAN_IR_EI_SHIFT)
#define CAN_IR_EI(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_IR_EI_SHIFT)) & CAN_IR_EI_MASK)

#define CAN_IR_TI_SHIFT                         (1)
#define CAN_IR_TI_MASK                          (0x01U << CAN_IR_TI_SHIFT)
#define CAN_IR_TI(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_IR_TI_SHIFT)) & CAN_IR_TI_MASK)

#define CAN_IR_RI_SHIFT                         (0)
#define CAN_IR_RI_MASK                          (0x01U << CAN_IR_RI_SHIFT)
#define CAN_IR_RI(x)                            (((uint32_t)(((uint32_t)(x)) << CAN_IR_RI_SHIFT)) & CAN_IR_RI_MASK)

/*!
 * @brief CAN_IER Register Bit Definition
 */

#define CAN_IER_BEIE_SHIFT                      (7)
#define CAN_IER_BEIE_MASK                       (0x01U << CAN_IER_BEIE_SHIFT)
#define CAN_IER_BEIE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_IER_BEIE_SHIFT)) & CAN_IER_BEIE_MASK)

#define CAN_IER_ALIE_SHIFT                      (6)
#define CAN_IER_ALIE_MASK                       (0x01U << CAN_IER_ALIE_SHIFT)
#define CAN_IER_ALIE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_IER_ALIE_SHIFT)) & CAN_IER_ALIE_MASK)

#define CAN_IER_EPIE_SHIFT                      (5)
#define CAN_IER_EPIE_MASK                       (0x01U << CAN_IER_EPIE_SHIFT)
#define CAN_IER_EPIE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_IER_EPIE_SHIFT)) & CAN_IER_EPIE_MASK)

#define CAN_IER_DOIE_SHIFT                      (3)
#define CAN_IER_DOIE_MASK                       (0x01U << CAN_IER_DOIE_SHIFT)
#define CAN_IER_DOIE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_IER_DOIE_SHIFT)) & CAN_IER_DOIE_MASK)

#define CAN_IER_EIE_SHIFT                       (2)
#define CAN_IER_EIE_MASK                        (0x01U << CAN_IER_EIE_SHIFT)
#define CAN_IER_EIE(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_IER_EIE_SHIFT)) & CAN_IER_EIE_MASK)

#define CAN_IER_TIE_SHIFT                       (1)
#define CAN_IER_TIE_MASK                        (0x01U << CAN_IER_TIE_SHIFT)
#define CAN_IER_TIE(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_IER_TIE_SHIFT)) & CAN_IER_TIE_MASK)

#define CAN_IER_RIE_SHIFT                       (0)
#define CAN_IER_RIE_MASK                        (0x01U << CAN_IER_RIE_SHIFT)
#define CAN_IER_RIE(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_IER_RIE_SHIFT)) & CAN_IER_RIE_MASK)

/*!
 * @brief CAN_GROUP0ACR Register Bit Definition
 */

#define CAN_GROUP0ACR_AC_SHIFT                 (0)
#define CAN_GROUP0ACR_AC_MASK                  (0xFFU << CAN_GROUP0ACR_AC_SHIFT)
#define CAN_GROUP0ACR_AC(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_GROUP0ACR_AC_SHIFT)) & CAN_GROUP0ACR_AC_MASK)

/*!
 * @brief CAN_GROUP0AMR Register Bit Definition
 */

#define CAN_GROUP0AMR_AM_SHIFT                 (0)
#define CAN_GROUP0AMR_AM_MASK                  (0xFFU << CAN_GROUP0AMR_AM_SHIFT)
#define CAN_GROUP0AMR_AM(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_GROUP0AMR_AM_SHIFT)) & CAN_GROUP0AMR_AM_MASK)

/*!
 * @brief CAN_BTR0 Register Bit Definition
 */

#define CAN_BTR0_SJW_SHIFT                      (6)
#define CAN_BTR0_SJW_MASK                       (0x3U << CAN_BTR0_SJW_SHIFT)
#define CAN_BTR0_SJW(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_BTR0_SJW_SHIFT)) & CAN_BTR0_SJW_MASK)

#define CAN_BTR0_BRP_SHIFT                      (0)
#define CAN_BTR0_BRP_MASK                       (0x3FU << CAN_BTR0_BRP_SHIFT)
#define CAN_BTR0_BRP(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_BTR0_BRP_SHIFT)) & CAN_BTR0_BRP_MASK)

/*!
 * @brief CAN_BTR1 Register Bit Definition
 */

#define CAN_BTR1_SAM_SHIFT                      (7)
#define CAN_BTR1_SAM_MASK                       (0x01U << CAN_BTR1_SAM_SHIFT)
#define CAN_BTR1_SAM(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_BTR1_SAM_SHIFT)) & CAN_BTR1_SAM_MASK)

#define CAN_BTR1_TSEG2TSEG1_SHIFT               (0)
#define CAN_BTR1_TSEG2TSEG1_MASK                (0x7FU << CAN_BTR1_TSEG2TSEG1_SHIFT)
#define CAN_BTR1_TSEG2TSEG1(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_BTR1_TSEG2TSEG1_SHIFT)) & CAN_BTR1_TSEG2TSEG1_MASK)

/*!
 * @brief CAN_TXID0 Register Bit Definition
 */

#define CAN_TXID0_IDX_SHIFT                     (0)
#define CAN_TXID0_IDX_MASK                      (0xFFU << CAN_TXID0_IDX_SHIFT)
#define CAN_TXID0_IDX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXID0_IDX_SHIFT)) & CAN_TXID0_IDX_MASK)

/*!
 * @brief CAN_TXID1 Register Bit Definition
 */

#define CAN_TXID1_IDX_SHIFT                     (5)
#define CAN_TXID1_IDX_MASK                      (0x7U << CAN_TXID1_IDX_SHIFT)
#define CAN_TXID1_IDX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXID1_IDX_SHIFT)) & CAN_TXID1_IDX_MASK)

#define CAN_TXID1_RTR_SHIFT                     (4)
#define CAN_TXID1_RTR_MASK                      (0x01U << CAN_TXID1_RTR_SHIFT)
#define CAN_TXID1_RTR(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXID1_RTR_SHIFT)) & CAN_TXID1_RTR_MASK)

#define CAN_TXID1_DLCX_SHIFT                    (0)
#define CAN_TXID1_DLCX_MASK                     (0xFU << CAN_TXID1_DLCX_SHIFT)
#define CAN_TXID1_DLCX(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_TXID1_DLCX_SHIFT)) & CAN_TXID1_DLCX_MASK)

/*!
 * @brief CAN_ALC Register Bit Definition
 */

#define CAN_ALC_BITNO_SHIFT                     (0)
#define CAN_ALC_BITNO_MASK                      (0x1FU << CAN_ALC_BITNO_SHIFT)
#define CAN_ALC_BITNO(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_ALC_BITNO_SHIFT)) & CAN_ALC_BITNO_MASK)

/*!
 * @brief CAN_ECC Register Bit Definition
 */

#define CAN_ECC_ERRC_SHIFT                      (6)
#define CAN_ECC_ERRC_MASK                       (0x3U << CAN_ECC_ERRC_SHIFT)
#define CAN_ECC_ERRC(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ECC_ERRC_SHIFT)) & CAN_ECC_ERRC_MASK)

