RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define CAN_ECC_DIR_SHIFT                       (5)
#define CAN_ECC_DIR_MASK                        (0x01U << CAN_ECC_DIR_SHIFT)
#define CAN_ECC_DIR(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_ECC_DIR_SHIFT)) & CAN_ECC_DIR_MASK)

#define CAN_ECC_SEG_SHIFT                       (0)
#define CAN_ECC_SEG_MASK                        (0x1FU << CAN_ECC_SEG_SHIFT)
#define CAN_ECC_SEG(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_ECC_SEG_SHIFT)) & CAN_ECC_SEG_MASK)

/*!
 * @brief CAN_EWLR Register Bit Definition
 */

#define CAN_EWLR_EWL_SHIFT                      (0)
#define CAN_EWLR_EWL_MASK                       (0xFFU << CAN_EWLR_EWL_SHIFT)
#define CAN_EWLR_EWL(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_EWLR_EWL_SHIFT)) & CAN_EWLR_EWL_MASK)

/*!
 * @brief CAN_RXERR Register Bit Definition
 */

#define CAN_RXERR_RXERR_SHIFT                   (0)
#define CAN_RXERR_RXERR_MASK                    (0xFFU << CAN_RXERR_RXERR_SHIFT)
#define CAN_RXERR_RXERR(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_RXERR_RXERR_SHIFT)) & CAN_RXERR_RXERR_MASK)

/*!
 * @brief CAN_TXERR Register Bit Definition
 */

#define CAN_TXERR_TXERR_SHIFT                   (0)
#define CAN_TXERR_TXERR_MASK                    (0xFFU << CAN_TXERR_TXERR_SHIFT)
#define CAN_TXERR_TXERR(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_TXERR_TXERR_SHIFT)) & CAN_TXERR_TXERR_MASK)

#define CAN_TXERR_RTR_SHIFT                     (6)
#define CAN_TXERR_RTR_MASK                      (0x01U << CAN_TXERR_RTR_SHIFT)
#define CAN_TXERR_RTR(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXERR_RTR_SHIFT)) & CAN_TXERR_RTR_MASK)

#define CAN_TXERR_DLC_SHIFT                     (0)
#define CAN_TXERR_DLC_MASK                      (0xFU << CAN_TXERR_DLC_SHIFT)
#define CAN_TXERR_DLC(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXERR_DLC_SHIFT)) & CAN_TXERR_DLC_MASK)

/*!
 * @brief CAN_SFF Register Bit Definition
 */

#define CAN_SFF_FF_SHIFT                        (7)
#define CAN_SFF_FF_MASK                         (0x01U << CAN_SFF_FF_SHIFT)
#define CAN_SFF_FF(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_SFF_FF_SHIFT)) & CAN_SFF_FF_MASK)

#define CAN_SFF_RTR_SHIFT                       (6)
#define CAN_SFF_RTR_MASK                        (0x01U << CAN_SFF_RTR_SHIFT)
#define CAN_SFF_RTR(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_SFF_RTR_SHIFT)) & CAN_SFF_RTR_MASK)

#define CAN_SFF_DLC_SHIFT                       (0)
#define CAN_SFF_DLC_MASK                        (0xFU << CAN_SFF_DLC_SHIFT)
#define CAN_SFF_DLC(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_SFF_DLC_SHIFT)) & CAN_SFF_DLC_MASK)

/*!
 * @brief CAN_TXID0 Register Bit Definition
 */

#define CAN_TXID0_IDX_SHIFT                     (0)
#define CAN_TXID0_IDX_MASK                      (0xFFU << CAN_TXID0_IDX_SHIFT)
#define CAN_TXID0_IDX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXID0_IDX_SHIFT)) & CAN_TXID0_IDX_MASK)

/*!
 * @brief CAN_TXID1 Register Bit Definition
 */

#define CAN_TXID1_ID_SHIFT                     (0)
#define CAN_TXID1_ID_MASK                      (0xFFU << CAN_TXID1_ID_SHIFT)
#define CAN_TXID1_ID(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_TXID1_ID_SHIFT)) & CAN_TXID1_ID_MASK)

/*!
 * @brief CAN_TXDATA0 Register Bit Definition
 */

#define CAN_TXDATA0_DATA0_SHIFT                 (0)
#define CAN_TXDATA0_DATA0_MASK                  (0xFFU << CAN_TXDATA0_DATA0_SHIFT)
#define CAN_TXDATA0_DATA0(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_TXDATA0_DATA0_SHIFT)) & CAN_TXDATA0_DATA0_MASK)

/*!
 * @brief CAN_TXDATA1 Register Bit Definition
 */

#define CAN_TXDATA1_DATA1_SHIFT                 (0)
#define CAN_TXDATA1_DATA1_MASK                  (0xFFU << CAN_TXDATA1_DATA1_SHIFT)
#define CAN_TXDATA1_DATA1(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_TXDATA1_DATA1_SHIFT)) & CAN_TXDATA1_DATA1_MASK)

/*!
 * @brief CAN_CDR Register Bit Definition
 */

#define CAN_CDR_MODE_SHIFT                      (7)
#define CAN_CDR_MODE_MASK                       (0x01U << CAN_CDR_MODE_SHIFT)
#define CAN_CDR_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_CDR_MODE_SHIFT)) & CAN_CDR_MODE_MASK)

/*!
 * @brief CAN_AFM0 Register Bit Definition
 */

#define CAN_AFM0_AFMX_SHIFT                     (1)
#define CAN_AFM0_AFMX_MASK                      (0x7FU << CAN_AFM0_AFMX_SHIFT)
#define CAN_AFM0_AFMX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_AFM0_AFMX_SHIFT)) & CAN_AFM0_AFMX_MASK)

/*!
 * @brief CAN_AFM1 Register Bit Definition
 */

#define CAN_AFM1_AFMX_SHIFT                     (0)
#define CAN_AFM1_AFMX_MASK                      (0xFFU << CAN_AFM1_AFMX_SHIFT)
#define CAN_AFM1_AFMX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_AFM1_AFMX_SHIFT)) & CAN_AFM1_AFMX_MASK)

/*!
 * @brief CAN_AFM2 Register Bit Definition
 */

#define CAN_AFM2_AFMX_SHIFT                     (0)
#define CAN_AFM2_AFMX_MASK                      (0xFU << CAN_AFM2_AFMX_SHIFT)
#define CAN_AFM2_AFMX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_AFM2_AFMX_SHIFT)) & CAN_AFM2_AFMX_MASK)

/*!
 * @brief CAN_FGA0 Register Bit Definition
 */

#define CAN_FGA0_FGAX_SHIFT                     (1)
#define CAN_FGA0_FGAX_MASK                      (0x7FU << CAN_FGA0_FGAX_SHIFT)
#define CAN_FGA0_FGAX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_FGA0_FGAX_SHIFT)) & CAN_FGA0_FGAX_MASK)

/*!
 * @brief CAN_FGA1 Register Bit Definition
 */

#define CAN_FGA1_FGAX_SHIFT                     (0)
#define CAN_FGA1_FGAX_MASK                      (0xFFU << CAN_FGA1_FGAX_SHIFT)
#define CAN_FGA1_FGAX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_FGA1_FGAX_SHIFT)) & CAN_FGA1_FGAX_MASK)

/*!
 * @brief CAN_FGA2 Register Bit Definition
 */

#define CAN_FGA2_FGAX_SHIFT                     (0)
#define CAN_FGA2_FGAX_MASK                      (0xFFU << CAN_FGA2_FGAX_SHIFT)
#define CAN_FGA2_FGAX(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_FGA2_FGAX_SHIFT)) & CAN_FGA2_FGAX_MASK)

/*!
 * @brief CAN_GROUPACR
 Register Bit Definition
 */

#define CAN_GROUPACR_AC_SHIFT                  (0)
#define CAN_GROUPACR_AC_MASK                   (0xFFU << CAN_GROUPACR_AC_SHIFT)
#define CAN_GROUPACR_AC(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_GROUPACR_AC_SHIFT)) & CAN_GROUPACR_AC_MASK)

/*!
 * @brief CAN_GROUPAMR
 Register Bit Definition
 */

