RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define CAN_GROUPAMR_AM_SHIFT                  (0)
#define CAN_GROUPAMR_AM_MASK                   (0xFFU << CAN_GROUPAMR_AM_SHIFT)
#define CAN_GROUPAMR_AM(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_GROUPAMR_AM_SHIFT)) & CAN_GROUPAMR_AM_MASK)

/*!
 * @}
 */ /* end of group CAN_Register_Masks */
/******************************************************************************
 * CAN Instance
******************************************************************************/
#define CAN_Basic                               ((CAN_Basic_Type*)CAN_BASE)
#define CAN_Peli                                ((CAN_Peli_Type*)CAN_BASE)

/*!
 * @}
 */ /* end of group CAN_Peripheral_Access_Layer */



/*!
 * @addtogroup USB_Peripheral_Access_Layer USB Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * USB Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t Reserved22[4];                                                  ///< Reserved
    __IO uint32_t OTGISTAT;                                                       ///< OTG Interrupt Status Register                offset: 0x10
    __IO uint32_t OTGICTRL;                                                       ///< OTG Interrupt Control Register               offset: 0x14
    __IO uint32_t OTGSTAT;                                                        ///< OTG Status Register                          offset: 0x18
    __IO uint32_t OTGCTRL;                                                        ///< OTG Control register                         offset: 0x1C
    __IO uint32_t Reserved23[24];                                                 ///< Reserved
    __IO uint32_t INTSTAT;                                                        ///< Interrupt status register                    offset: 0x80
    __IO uint32_t INTENB;                                                         ///< Interrupt enable register                    offset: 0x84
    __IO uint32_t ERRSTAT;                                                        ///< Error interrupt status register              offset: 0x88
    __IO uint32_t ERRENB;                                                         ///< Error interrupt enable register              offset: 0x8C
    __IO uint32_t STAT;                                                           ///< Status register                              offset: 0x90
    __IO uint32_t CTL;                                                            ///< Control register                             offset: 0x94
    __IO uint32_t ADDR;                                                           ///< Address register                             offset: 0x98
    __IO uint32_t BDTPAGE01;                                                      ///< BDT page register 1                          offset: 0x9C
    __IO uint32_t FRMNUML;                                                        ///< Frame number register                        offset: 0xA0
    __IO uint32_t FRMNUMH;                                                        ///< Frame number register                        offset: 0xA4
    __IO uint32_t TOKEN;                                                          ///< Token register                               offset: 0xA8
    __IO uint32_t SOFTHLD;                                                        ///< SOF threshold register                       offset: 0xAC
    __IO uint32_t BDTPAGE02;                                                      ///< BDT page register 2                          offset: 0xB0
    __IO uint32_t BDTPAGE03;                                                      ///< BDT page register 3                          offset: 0xB4
    __IO uint32_t Reserved24[2];                                                  ///< Reserved
    __IO uint32_t EPCTL[16];                                                      ///< Endpoint control register                    offset: 0xC0
} USB_Type;

/*******************************************************************************
 * USB Type
 ******************************************************************************/

/*!
 * @addtogroup USB_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief USB_OTGISTAT Register Bit Definition
 */

#define USB_OTGISTAT_IDCHG_SHIFT               (7)
#define USB_OTGISTAT_IDCHG_MASK                (0x01U << USB_OTGISTAT_IDCHG_SHIFT)
#define USB_OTGISTAT_IDCHG(x)                  (((uint32_t)(((uint32_t)(x)) << USB_OTGISTAT_IDCHG_SHIFT)) & USB_OTGISTAT_IDCHG_MASK)

#define USB_OTGISTAT_1MSEC_SHIFT               (6)
#define USB_OTGISTAT_1MSEC_MASK                (0x01U << USB_OTGISTAT_1MSEC_SHIFT)
#define USB_OTGISTAT_1MSEC(x)                  (((uint32_t)(((uint32_t)(x)) << USB_OTGISTAT_1MSEC_SHIFT)) & USB_OTGISTAT_1MSEC_MASK)

#define USB_OTGISTAT_LINESTATECHG_SHIFT        (5)
#define USB_OTGISTAT_LINESTATECHG_MASK         (0x01U << USB_OTGISTAT_LINESTATECHG_SHIFT)
#define USB_OTGISTAT_LINESTATECHG(x)           (((uint32_t)(((uint32_t)(x)) << USB_OTGISTAT_LINESTATECHG_SHIFT)) & USB_OTGISTAT_LINESTATECHG_MASK)

#define USB_OTGISTAT_SESSVLDCHG_SHIFT          (2)
#define USB_OTGISTAT_SESSVLDCHG_MASK           (0x01U << USB_OTGISTAT_SESSVLDCHG_SHIFT)
#define USB_OTGISTAT_SESSVLDCHG(x)             (((uint32_t)(((uint32_t)(x)) << USB_OTGISTAT_SESSVLDCHG_SHIFT)) & USB_OTGISTAT_SESSVLDCHG_MASK)

#define USB_OTGISTAT_BSESSENDCHG_SHIFT         (2)
#define USB_OTGISTAT_BSESSENDCHG_MASK          (0x01U << USB_OTGISTAT_BSESSENDCHG_SHIFT)
#define USB_OTGISTAT_BSESSENDCHG(x)            (((uint32_t)(((uint32_t)(x)) << USB_OTGISTAT_BSESSENDCHG_SHIFT)) & USB_OTGISTAT_BSESSENDCHG_MASK)

#define USB_OTGISTAT_AVBUSVLDCHG_SHIFT         (0)
#define USB_OTGISTAT_AVBUSVLDCHG_MASK          (0x01U << USB_OTGISTAT_AVBUSVLDCHG_SHIFT)
#define USB_OTGISTAT_AVBUSVLDCHG(x)            (((uint32_t)(((uint32_t)(x)) << USB_OTGISTAT_AVBUSVLDCHG_SHIFT)) & USB_OTGISTAT_AVBUSVLDCHG_MASK)

/*!
 * @brief USB_OTGICTRL Register Bit Definition
 */

