RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define USB_OTGICTRL_IDEN_SHIFT                (7)
#define USB_OTGICTRL_IDEN_MASK                 (0x01U << USB_OTGICTRL_IDEN_SHIFT)
#define USB_OTGICTRL_IDEN(x)                   (((uint32_t)(((uint32_t)(x)) << USB_OTGICTRL_IDEN_SHIFT)) & USB_OTGICTRL_IDEN_MASK)

#define USB_OTGICTRL_1MSECEN_SHIFT             (6)
#define USB_OTGICTRL_1MSECEN_MASK              (0x01U << USB_OTGICTRL_1MSECEN_SHIFT)
#define USB_OTGICTRL_1MSECEN(x)                (((uint32_t)(((uint32_t)(x)) << USB_OTGICTRL_1MSECEN_SHIFT)) & USB_OTGICTRL_1MSECEN_MASK)

#define USB_OTGICTRL_LINESTATEEN_SHIFT         (5)
#define USB_OTGICTRL_LINESTATEEN_MASK          (0x01U << USB_OTGICTRL_LINESTATEEN_SHIFT)
#define USB_OTGICTRL_LINESTATEEN(x)            (((uint32_t)(((uint32_t)(x)) << USB_OTGICTRL_LINESTATEEN_SHIFT)) & USB_OTGICTRL_LINESTATEEN_MASK)

#define USB_OTGICTRL_SESSVLDEN_SHIFT           (3)
#define USB_OTGICTRL_SESSVLDEN_MASK            (0x01U << USB_OTGICTRL_SESSVLDEN_SHIFT)
#define USB_OTGICTRL_SESSVLDEN(x)              (((uint32_t)(((uint32_t)(x)) << USB_OTGICTRL_SESSVLDEN_SHIFT)) & USB_OTGICTRL_SESSVLDEN_MASK)

#define USB_OTGICTRL_BSESSENDEN_SHIFT          (2)
#define USB_OTGICTRL_BSESSENDEN_MASK           (0x01U << USB_OTGICTRL_BSESSENDEN_SHIFT)
#define USB_OTGICTRL_BSESSENDEN(x)             (((uint32_t)(((uint32_t)(x)) << USB_OTGICTRL_BSESSENDEN_SHIFT)) & USB_OTGICTRL_BSESSENDEN_MASK)

#define USB_OTGICTRL_AVBUSVLDEN_SHIFT          (0)
#define USB_OTGICTRL_AVBUSVLDEN_MASK           (0x01U << USB_OTGICTRL_AVBUSVLDEN_SHIFT)
#define USB_OTGICTRL_AVBUSVLDEN(x)             (((uint32_t)(((uint32_t)(x)) << USB_OTGICTRL_AVBUSVLDEN_SHIFT)) & USB_OTGICTRL_AVBUSVLDEN_MASK)

/*!
 * @brief USB_OTGSTAT Register Bit Definition
 */

#define USB_OTGSTAT_ID_SHIFT                   (7)
#define USB_OTGSTAT_ID_MASK                    (0x01U << USB_OTGSTAT_ID_SHIFT)
#define USB_OTGSTAT_ID(x)                      (((uint32_t)(((uint32_t)(x)) << USB_OTGSTAT_ID_SHIFT)) & USB_OTGSTAT_ID_MASK)

#define USB_OTGSTAT_1MSEC_SHIFT                (6)
#define USB_OTGSTAT_1MSEC_MASK                 (0x01U << USB_OTGSTAT_1MSEC_SHIFT)
#define USB_OTGSTAT_1MSEC(x)                   (((uint32_t)(((uint32_t)(x)) << USB_OTGSTAT_1MSEC_SHIFT)) & USB_OTGSTAT_1MSEC_MASK)

#define USB_OTGSTAT_LINESTATESTABLE_SHIFT      (5)
#define USB_OTGSTAT_LINESTATESTABLE_MASK       (0x01U << USB_OTGSTAT_LINESTATESTABLE_SHIFT)
#define USB_OTGSTAT_LINESTATESTABLE(x)         (((uint32_t)(((uint32_t)(x)) << USB_OTGSTAT_LINESTATESTABLE_SHIFT)) & USB_OTGSTAT_LINESTATESTABLE_MASK)

#define USB_OTGSTAT_SESSVLD_SHIFT              (3)
#define USB_OTGSTAT_SESSVLD_MASK               (0x01U << USB_OTGSTAT_SESSVLD_SHIFT)
#define USB_OTGSTAT_SESSVLD(x)                 (((uint32_t)(((uint32_t)(x)) << USB_OTGSTAT_SESSVLD_SHIFT)) & USB_OTGSTAT_SESSVLD_MASK)

#define USB_OTGSTAT_BSESSEND_SHIFT             (2)
#define USB_OTGSTAT_BSESSEND_MASK              (0x01U << USB_OTGSTAT_BSESSEND_SHIFT)
#define USB_OTGSTAT_BSESSEND(x)                (((uint32_t)(((uint32_t)(x)) << USB_OTGSTAT_BSESSEND_SHIFT)) & USB_OTGSTAT_BSESSEND_MASK)

#define USB_OTGSTAT_AVBUSVLD_SHIFT             (0)
#define USB_OTGSTAT_AVBUSVLD_MASK              (0x01U << USB_OTGSTAT_AVBUSVLD_SHIFT)
#define USB_OTGSTAT_AVBUSVLD(x)                (((uint32_t)(((uint32_t)(x)) << USB_OTGSTAT_AVBUSVLD_SHIFT)) & USB_OTGSTAT_AVBUSVLD_MASK)

/*!
 * @brief USB_OTGCTRL Register Bit Definition
 */

#define USB_OTGCTRL_DPHIGH_SHIFT               (7)
#define USB_OTGCTRL_DPHIGH_MASK                (0x01U << USB_OTGCTRL_DPHIGH_SHIFT)
#define USB_OTGCTRL_DPHIGH(x)                  (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_DPHIGH_SHIFT)) & USB_OTGCTRL_DPHIGH_MASK)

#define USB_OTGCTRL_DMHIGH_SHIFT               (6)
#define USB_OTGCTRL_DMHIGH_MASK                (0x01U << USB_OTGCTRL_DMHIGH_SHIFT)
#define USB_OTGCTRL_DMHIGH(x)                  (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_DMHIGH_SHIFT)) & USB_OTGCTRL_DMHIGH_MASK)

#define USB_OTGCTRL_DPLOW_SHIFT                (5)
#define USB_OTGCTRL_DPLOW_MASK                 (0x01U << USB_OTGCTRL_DPLOW_SHIFT)
#define USB_OTGCTRL_DPLOW(x)                   (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_DPLOW_SHIFT)) & USB_OTGCTRL_DPLOW_MASK)

#define USB_OTGCTRL_DMLOW_SHIFT                (4)
#define USB_OTGCTRL_DMLOW_MASK                 (0x01U << USB_OTGCTRL_DMLOW_SHIFT)
#define USB_OTGCTRL_DMLOW(x)                   (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_DMLOW_SHIFT)) & USB_OTGCTRL_DMLOW_MASK)

#define USB_OTGCTRL_VBUSON_SHIFT               (3)
#define USB_OTGCTRL_VBUSON_MASK                (0x01U << USB_OTGCTRL_VBUSON_SHIFT)
#define USB_OTGCTRL_VBUSON(x)                  (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_VBUSON_SHIFT)) & USB_OTGCTRL_VBUSON_MASK)

#define USB_OTGCTRL_OTGEN_SHIFT                (2)
#define USB_OTGCTRL_OTGEN_MASK                 (0x01U << USB_OTGCTRL_OTGEN_SHIFT)
#define USB_OTGCTRL_OTGEN(x)                   (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_OTGEN_SHIFT)) & USB_OTGCTRL_OTGEN_MASK)

#define USB_OTGCTRL_VBUSCHG_SHIFT              (1)
#define USB_OTGCTRL_VBUSCHG_MASK               (0x01U << USB_OTGCTRL_VBUSCHG_SHIFT)
#define USB_OTGCTRL_VBUSCHG(x)                 (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_VBUSCHG_SHIFT)) & USB_OTGCTRL_VBUSCHG_MASK)

#define USB_OTGCTRL_VBUSDSCHG_SHIFT            (0)
#define USB_OTGCTRL_VBUSDSCHG_MASK             (0x01U << USB_OTGCTRL_VBUSDSCHG_SHIFT)
#define USB_OTGCTRL_VBUSDSCHG(x)               (((uint32_t)(((uint32_t)(x)) << USB_OTGCTRL_VBUSDSCHG_SHIFT)) & USB_OTGCTRL_VBUSDSCHG_MASK)

/*!
 * @brief USB_INTSTAT Register Bit Definition
 */

#define USB_INTSTAT_STALL_SHIFT                (7)
#define USB_INTSTAT_STALL_MASK                 (0x01U << USB_INTSTAT_STALL_SHIFT)
#define USB_INTSTAT_STALL(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_STALL_SHIFT)) & USB_INTSTAT_STALL_MASK)

#define USB_INTSTAT_ATTACH_SHIFT               (6)
#define USB_INTSTAT_ATTACH_MASK                (0x01U << USB_INTSTAT_ATTACH_SHIFT)
#define USB_INTSTAT_ATTACH(x)                  (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_ATTACH_SHIFT)) & USB_INTSTAT_ATTACH_MASK)

