RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define USB_INTSTAT_RESUME_SHIFT               (5)
#define USB_INTSTAT_RESUME_MASK                (0x01U << USB_INTSTAT_RESUME_SHIFT)
#define USB_INTSTAT_RESUME(x)                  (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_RESUME_SHIFT)) & USB_INTSTAT_RESUME_MASK)

#define USB_INTSTAT_SLEEP_SHIFT                (4)
#define USB_INTSTAT_SLEEP_MASK                 (0x01U << USB_INTSTAT_SLEEP_SHIFT)
#define USB_INTSTAT_SLEEP(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_SLEEP_SHIFT)) & USB_INTSTAT_SLEEP_MASK)

#define USB_INTSTAT_TOKDNE_SHIFT               (3)
#define USB_INTSTAT_TOKDNE_MASK                (0x01U << USB_INTSTAT_TOKDNE_SHIFT)
#define USB_INTSTAT_TOKDNE(x)                  (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_TOKDNE_SHIFT)) & USB_INTSTAT_TOKDNE_MASK)

#define USB_INTSTAT_SOFTOK_SHIFT               (2)
#define USB_INTSTAT_SOFTOK_MASK                (0x01U << USB_INTSTAT_SOFTOK_SHIFT)
#define USB_INTSTAT_SOFTOK(x)                  (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_SOFTOK_SHIFT)) & USB_INTSTAT_SOFTOK_MASK)

#define USB_INTSTAT_ERROR_SHIFT                (1)
#define USB_INTSTAT_ERROR_MASK                 (0x01U << USB_INTSTAT_ERROR_SHIFT)
#define USB_INTSTAT_ERROR(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_ERROR_SHIFT)) & USB_INTSTAT_ERROR_MASK)

#define USB_INTSTAT_USBRST_SHIFT               (0)
#define USB_INTSTAT_USBRST_MASK                (0x01U << USB_INTSTAT_USBRST_SHIFT)
#define USB_INTSTAT_USBRST(x)                  (((uint32_t)(((uint32_t)(x)) << USB_INTSTAT_USBRST_SHIFT)) & USB_INTSTAT_USBRST_MASK)

/*!
 * @brief USB_INTENB Register Bit Definition
 */

#define USB_INTENB_STALL_SHIFT                 (7)
#define USB_INTENB_STALL_MASK                  (0x01U << USB_INTENB_STALL_SHIFT)
#define USB_INTENB_STALL(x)                    (((uint32_t)(((uint32_t)(x)) << USB_INTENB_STALL_SHIFT)) & USB_INTENB_STALL_MASK)

#define USB_INTENB_ATTACH_SHIFT                (6)
#define USB_INTENB_ATTACH_MASK                 (0x01U << USB_INTENB_ATTACH_SHIFT)
#define USB_INTENB_ATTACH(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTENB_ATTACH_SHIFT)) & USB_INTENB_ATTACH_MASK)

#define USB_INTENB_RESUME_SHIFT                (5)
#define USB_INTENB_RESUME_MASK                 (0x01U << USB_INTENB_RESUME_SHIFT)
#define USB_INTENB_RESUME(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTENB_RESUME_SHIFT)) & USB_INTENB_RESUME_MASK)

#define USB_INTENB_SLEEP_SHIFT                 (4)
#define USB_INTENB_SLEEP_MASK                  (0x01U << USB_INTENB_SLEEP_SHIFT)
#define USB_INTENB_SLEEP(x)                    (((uint32_t)(((uint32_t)(x)) << USB_INTENB_SLEEP_SHIFT)) & USB_INTENB_SLEEP_MASK)

#define USB_INTENB_TOKDNE_SHIFT                (3)
#define USB_INTENB_TOKDNE_MASK                 (0x01U << USB_INTENB_TOKDNE_SHIFT)
#define USB_INTENB_TOKDNE(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTENB_TOKDNE_SHIFT)) & USB_INTENB_TOKDNE_MASK)

#define USB_INTENB_SOFTOK_SHIFT                (2)
#define USB_INTENB_SOFTOK_MASK                 (0x01U << USB_INTENB_SOFTOK_SHIFT)
#define USB_INTENB_SOFTOK(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTENB_SOFTOK_SHIFT)) & USB_INTENB_SOFTOK_MASK)

#define USB_INTENB_ERROR_SHIFT                 (1)
#define USB_INTENB_ERROR_MASK                  (0x01U << USB_INTENB_ERROR_SHIFT)
#define USB_INTENB_ERROR(x)                    (((uint32_t)(((uint32_t)(x)) << USB_INTENB_ERROR_SHIFT)) & USB_INTENB_ERROR_MASK)

#define USB_INTENB_USBRST_SHIFT                (0)
#define USB_INTENB_USBRST_MASK                 (0x01U << USB_INTENB_USBRST_SHIFT)
#define USB_INTENB_USBRST(x)                   (((uint32_t)(((uint32_t)(x)) << USB_INTENB_USBRST_SHIFT)) & USB_INTENB_USBRST_MASK)

/*!
 * @brief USB_ERRSTAT Register Bit Definition
 */

#define USB_ERRSTAT_BTSERR_SHIFT               (7)
#define USB_ERRSTAT_BTSERR_MASK                (0x01U << USB_ERRSTAT_BTSERR_SHIFT)
#define USB_ERRSTAT_BTSERR(x)                  (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_BTSERR_SHIFT)) & USB_ERRSTAT_BTSERR_MASK)

#define USB_ERRSTAT_DMAERR_SHIFT               (5)
#define USB_ERRSTAT_DMAERR_MASK                (0x01U << USB_ERRSTAT_DMAERR_SHIFT)
#define USB_ERRSTAT_DMAERR(x)                  (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_DMAERR_SHIFT)) & USB_ERRSTAT_DMAERR_MASK)

#define USB_ERRSTAT_BTOERR_SHIFT               (4)
#define USB_ERRSTAT_BTOERR_MASK                (0x01U << USB_ERRSTAT_BTOERR_SHIFT)
#define USB_ERRSTAT_BTOERR(x)                  (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_BTOERR_SHIFT)) & USB_ERRSTAT_BTOERR_MASK)

#define USB_ERRSTAT_DFN8_SHIFT                 (3)
#define USB_ERRSTAT_DFN8_MASK                  (0x01U << USB_ERRSTAT_DFN8_SHIFT)
#define USB_ERRSTAT_DFN8(x)                    (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_DFN8_SHIFT)) & USB_ERRSTAT_DFN8_MASK)

#define USB_ERRSTAT_CRC16_SHIFT                (2)
#define USB_ERRSTAT_CRC16_MASK                 (0x01U << USB_ERRSTAT_CRC16_SHIFT)
#define USB_ERRSTAT_CRC16(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_CRC16_SHIFT)) & USB_ERRSTAT_CRC16_MASK)

#define USB_ERRSTAT_CRC5EOF_SHIFT              (1)
#define USB_ERRSTAT_CRC5EOF_MASK               (0x01U << USB_ERRSTAT_CRC5EOF_SHIFT)
#define USB_ERRSTAT_CRC5EOF(x)                 (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_CRC5EOF_SHIFT)) & USB_ERRSTAT_CRC5EOF_MASK)

#define USB_ERRSTAT_PIDERR_SHIFT               (0)
#define USB_ERRSTAT_PIDERR_MASK                (0x01U << USB_ERRSTAT_PIDERR_SHIFT)
#define USB_ERRSTAT_PIDERR(x)                  (((uint32_t)(((uint32_t)(x)) << USB_ERRSTAT_PIDERR_SHIFT)) & USB_ERRSTAT_PIDERR_MASK)

/*!
 * @brief USB_ERRENB Register Bit Definition
 */

#define USB_ERRENB_BTSERR_SHIFT                (7)
#define USB_ERRENB_BTSERR_MASK                 (0x01U << USB_ERRENB_BTSERR_SHIFT)
#define USB_ERRENB_BTSERR(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_BTSERR_SHIFT)) & USB_ERRENB_BTSERR_MASK)

#define USB_ERRENB_DMAERR_SHIFT                (5)
#define USB_ERRENB_DMAERR_MASK                 (0x01U << USB_ERRENB_DMAERR_SHIFT)
#define USB_ERRENB_DMAERR(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_DMAERR_SHIFT)) & USB_ERRENB_DMAERR_MASK)

