RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define USB_ERRENB_BTOERR_SHIFT                (4)
#define USB_ERRENB_BTOERR_MASK                 (0x01U << USB_ERRENB_BTOERR_SHIFT)
#define USB_ERRENB_BTOERR(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_BTOERR_SHIFT)) & USB_ERRENB_BTOERR_MASK)

#define USB_ERRENB_DFN8_SHIFT                  (3)
#define USB_ERRENB_DFN8_MASK                   (0x01U << USB_ERRENB_DFN8_SHIFT)
#define USB_ERRENB_DFN8(x)                     (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_DFN8_SHIFT)) & USB_ERRENB_DFN8_MASK)

#define USB_ERRENB_CRC16_SHIFT                 (2)
#define USB_ERRENB_CRC16_MASK                  (0x01U << USB_ERRENB_CRC16_SHIFT)
#define USB_ERRENB_CRC16(x)                    (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_CRC16_SHIFT)) & USB_ERRENB_CRC16_MASK)

#define USB_ERRENB_CRC5EOF_SHIFT               (1)
#define USB_ERRENB_CRC5EOF_MASK                (0x01U << USB_ERRENB_CRC5EOF_SHIFT)
#define USB_ERRENB_CRC5EOF(x)                  (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_CRC5EOF_SHIFT)) & USB_ERRENB_CRC5EOF_MASK)

#define USB_ERRENB_PIDERR_SHIFT                (0)
#define USB_ERRENB_PIDERR_MASK                 (0x01U << USB_ERRENB_PIDERR_SHIFT)
#define USB_ERRENB_PIDERR(x)                   (((uint32_t)(((uint32_t)(x)) << USB_ERRENB_PIDERR_SHIFT)) & USB_ERRENB_PIDERR_MASK)

/*!
 * @brief USB_STAT Register Bit Definition
 */

#define USB_STAT_ENDP_SHIFT                     (4)
#define USB_STAT_ENDP_MASK                      (0xFU << USB_STAT_ENDP_SHIFT)
#define USB_STAT_ENDP(x)                        (((uint32_t)(((uint32_t)(x)) << USB_STAT_ENDP_SHIFT)) & USB_STAT_ENDP_MASK)

#define USB_STAT_TX_SHIFT                       (3)
#define USB_STAT_TX_MASK                        (0x01U << USB_STAT_TX_SHIFT)
#define USB_STAT_TX(x)                          (((uint32_t)(((uint32_t)(x)) << USB_STAT_TX_SHIFT)) & USB_STAT_TX_MASK)

#define USB_STAT_ODD_SHIFT                      (2)
#define USB_STAT_ODD_MASK                       (0x01U << USB_STAT_ODD_SHIFT)
#define USB_STAT_ODD(x)                         (((uint32_t)(((uint32_t)(x)) << USB_STAT_ODD_SHIFT)) & USB_STAT_ODD_MASK)

/*!
 * @brief USB_CTL Register Bit Definition
 */

#define USB_CTL_JSTATE_SHIFT                    (7)
#define USB_CTL_JSTATE_MASK                     (0x01U << USB_CTL_JSTATE_SHIFT)
#define USB_CTL_JSTATE(x)                       (((uint32_t)(((uint32_t)(x)) << USB_CTL_JSTATE_SHIFT)) & USB_CTL_JSTATE_MASK)

#define USB_CTL_SE0_SHIFT                       (6)
#define USB_CTL_SE0_MASK                        (0x01U << USB_CTL_SE0_SHIFT)
#define USB_CTL_SE0(x)                          (((uint32_t)(((uint32_t)(x)) << USB_CTL_SE0_SHIFT)) & USB_CTL_SE0_MASK)

#define USB_CTL_TXDSUSPENDTOKENBUSY_SHIFT       (5)
#define USB_CTL_TXDSUSPENDTOKENBUSY_MASK        (0x01U << USB_CTL_TXDSUSPENDTOKENBUSY_SHIFT)
#define USB_CTL_TXDSUSPENDTOKENBUSY(x)          (((uint32_t)(((uint32_t)(x)) << USB_CTL_TXDSUSPENDTOKENBUSY_SHIFT)) & USB_CTL_TXDSUSPENDTOKENBUSY_MASK)

#define USB_CTL_RESET_SHIFT                     (4)
#define USB_CTL_RESET_MASK                      (0x01U << USB_CTL_RESET_SHIFT)
#define USB_CTL_RESET(x)                        (((uint32_t)(((uint32_t)(x)) << USB_CTL_RESET_SHIFT)) & USB_CTL_RESET_MASK)

#define USB_CTL_HOSTMODEEN_SHIFT                (3)
#define USB_CTL_HOSTMODEEN_MASK                 (0x01U << USB_CTL_HOSTMODEEN_SHIFT)
#define USB_CTL_HOSTMODEEN(x)                   (((uint32_t)(((uint32_t)(x)) << USB_CTL_HOSTMODEEN_SHIFT)) & USB_CTL_HOSTMODEEN_MASK)

#define USB_CTL_RESUME_SHIFT                    (2)
#define USB_CTL_RESUME_MASK                     (0x01U << USB_CTL_RESUME_SHIFT)
#define USB_CTL_RESUME(x)                       (((uint32_t)(((uint32_t)(x)) << USB_CTL_RESUME_SHIFT)) & USB_CTL_RESUME_MASK)

#define USB_CTL_ODDRST_SHIFT                    (1)
#define USB_CTL_ODDRST_MASK                     (0x01U << USB_CTL_ODDRST_SHIFT)
#define USB_CTL_ODDRST(x)                       (((uint32_t)(((uint32_t)(x)) << USB_CTL_ODDRST_SHIFT)) & USB_CTL_ODDRST_MASK)

#define USB_CTL_USBEN_SHIFT                     (0)
#define USB_CTL_USBEN_MASK                      (0x01U << USB_CTL_USBEN_SHIFT)
#define USB_CTL_USBEN(x)                        (((uint32_t)(((uint32_t)(x)) << USB_CTL_USBEN_SHIFT)) & USB_CTL_USBEN_MASK)

/*!
 * @brief USB_ADDR Register Bit Definition
 */

#define USB_ADDR_LSEN_SHIFT                     (7)
#define USB_ADDR_LSEN_MASK                      (0x01U << USB_ADDR_LSEN_SHIFT)
#define USB_ADDR_LSEN(x)                        (((uint32_t)(((uint32_t)(x)) << USB_ADDR_LSEN_SHIFT)) & USB_ADDR_LSEN_MASK)

#define USB_ADDR_ADDR_SHIFT                     (0)
#define USB_ADDR_ADDR_MASK                      (0x7FU << USB_ADDR_ADDR_SHIFT)
#define USB_ADDR_ADDR(x)                        (((uint32_t)(((uint32_t)(x)) << USB_ADDR_ADDR_SHIFT)) & USB_ADDR_ADDR_MASK)

/*!
 * @brief USB_BDTPAGE01 Register Bit Definition
 */

#define USB_BDTPAGE01_BDTBA_SHIFT             (1)
#define USB_BDTPAGE01_BDTBA_MASK              (0x7FU << USB_BDTPAGE01_BDTBA_SHIFT)
#define USB_BDTPAGE01_BDTBA(x)                (((uint32_t)(((uint32_t)(x)) << USB_BDTPAGE01_BDTBA_SHIFT)) & USB_BDTPAGE01_BDTBA_MASK)

/*!
 * @brief USB_FRMNUML Register Bit Definition
 */

#define USB_FRMNUML_FRM_SHIFT                  (0)
#define USB_FRMNUML_FRM_MASK                   (0xFFU << USB_FRMNUML_FRM_SHIFT)
#define USB_FRMNUML_FRM(x)                     (((uint32_t)(((uint32_t)(x)) << USB_FRMNUML_FRM_SHIFT)) & USB_FRMNUML_FRM_MASK)

/*!
 * @brief USB_FRMNUMH Register Bit Definition
 */

#define USB_FRMNUMH_FRM_SHIFT                  (0)
#define USB_FRMNUMH_FRM_MASK                   (0x7U << USB_FRMNUMH_FRM_SHIFT)
#define USB_FRMNUMH_FRM(x)                     (((uint32_t)(((uint32_t)(x)) << USB_FRMNUMH_FRM_SHIFT)) & USB_FRMNUMH_FRM_MASK)

/*!
 * @brief USB_TOKEN Register Bit Definition
 */

#define USB_TOKEN_TOKENPID_SHIFT                (4)
#define USB_TOKEN_TOKENPID_MASK                 (0xFU << USB_TOKEN_TOKENPID_SHIFT)
#define USB_TOKEN_TOKENPID(x)                   (((uint32_t)(((uint32_t)(x)) << USB_TOKEN_TOKENPID_SHIFT)) & USB_TOKEN_TOKENPID_MASK)

#define USB_TOKEN_TOKENENDPT_SHIFT              (0)
#define USB_TOKEN_TOKENENDPT_MASK               (0xFU << USB_TOKEN_TOKENENDPT_SHIFT)
#define USB_TOKEN_TOKENENDPT(x)                 (((uint32_t)(((uint32_t)(x)) << USB_TOKEN_TOKENENDPT_SHIFT)) & USB_TOKEN_TOKENENDPT_MASK)

/*!
 * @brief USB_SOFTHLD Register Bit Definition
 */

#define USB_SOFTHLD_CNT_SHIFT                  (0)
#define USB_SOFTHLD_CNT_MASK                   (0xFFU << USB_SOFTHLD_CNT_SHIFT)
#define USB_SOFTHLD_CNT(x)                     (((uint32_t)(((uint32_t)(x)) << USB_SOFTHLD_CNT_SHIFT)) & USB_SOFTHLD_CNT_MASK)

/*!
 * @brief USB_BDTPAGE02 Register Bit Definition
 */

#define USB_BDTPAGE02_BDTBA_SHIFT             (0)
#define USB_BDTPAGE02_BDTBA_MASK              (0xFFU << USB_BDTPAGE02_BDTBA_SHIFT)
#define USB_BDTPAGE02_BDTBA(x)                (((uint32_t)(((uint32_t)(x)) << USB_BDTPAGE02_BDTBA_SHIFT)) & USB_BDTPAGE02_BDTBA_MASK)

/*!
 * @brief USB_BDTPAGE03 Register Bit Definition
 */

#define USB_BDTPAGE03_BDTBA_SHIFT             (0)
#define USB_BDTPAGE03_BDTBA_MASK              (0xFFU << USB_BDTPAGE03_BDTBA_SHIFT)
#define USB_BDTPAGE03_BDTBA(x)                (((uint32_t)(((uint32_t)(x)) << USB_BDTPAGE03_BDTBA_SHIFT)) & USB_BDTPAGE03_BDTBA_MASK)

/*!
 * @brief USB_EPCTL Register Bit Definition
 */

