RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define USB_EPCTL_HOSTWOHUB_SHIFT              (7)
#define USB_EPCTL_HOSTWOHUB_MASK               (0x01U << USB_EPCTL_HOSTWOHUB_SHIFT)
#define USB_EPCTL_HOSTWOHUB(x)                 (((uint32_t)(((uint32_t)(x)) << USB_EPCTL_HOSTWOHUB_SHIFT)) & USB_EPCTL_HOSTWOHUB_MASK)

#define USB_EPCTL_RETRYDIS_SHIFT               (6)
#define USB_EPCTL_RETRYDIS_MASK                (0x01U << USB_EPCTL_RETRYDIS_SHIFT)
#define USB_EPCTL_RETRYDIS(x)                  (((uint32_t)(((uint32_t)(x)) << USB_EPCTL_RETRYDIS_SHIFT)) & USB_EPCTL_RETRYDIS_MASK)

#define USB_EPCTL_EPCTLDISEPRXENEPTXEN_SHIFT   (2)
#define USB_EPCTL_EPCTLDISEPRXENEPTXEN_MASK    (0x7U << USB_EPCTL_EPCTLDISEPRXENEPTXEN_SHIFT)
#define USB_EPCTL_EPCTLDISEPRXENEPTXEN(x)      (((uint32_t)(((uint32_t)(x)) << USB_EPCTL_EPCTLDISEPRXENEPTXEN_SHIFT)) & USB_EPCTL_EPCTLDISEPRXENEPTXEN_MASK)

#define USB_EPCTL_EPSTALL_SHIFT                (1)
#define USB_EPCTL_EPSTALL_MASK                 (0x01U << USB_EPCTL_EPSTALL_SHIFT)
#define USB_EPCTL_EPSTALL(x)                   (((uint32_t)(((uint32_t)(x)) << USB_EPCTL_EPSTALL_SHIFT)) & USB_EPCTL_EPSTALL_MASK)

#define USB_EPCTL_EPHSHK_SHIFT                 (0)
#define USB_EPCTL_EPHSHK_MASK                  (0x01U << USB_EPCTL_EPHSHK_SHIFT)
#define USB_EPCTL_EPHSHK(x)                    (((uint32_t)(((uint32_t)(x)) << USB_EPCTL_EPHSHK_SHIFT)) & USB_EPCTL_EPHSHK_MASK)

/*!
 * @}
 */ /* end of group USB_Register_Masks */
/******************************************************************************
 * USB Instance
******************************************************************************/
#define USB                             ((USB_Type*)USB_FS_OTG_BASE)

/*!
 * @}
 */ /* end of group USB_Peripheral_Access_Layer */



/*!
 * @addtogroup ETH_Peripheral_Access_Layer ETH Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * ETH Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MACCR;                                                          ///< MAC configuration register                   offset: 0x0000
    __IO uint32_t MACAFR;                                                         ///< MAC address filter control register          offset: 0x0004
    __IO uint32_t MACHTHR;                                                        ///< MAC HASH table high register                 offset: 0x0008
    __IO uint32_t MACHTLR;                                                        ///< MAC HASH table low register                  offset: 0x000C
    __IO uint32_t MACSMIAR;                                                       ///< SMI address register                         offset: 0x0010
    __IO uint32_t MACSMIDR;                                                       ///< SMI data register                            offset: 0x0014
    __IO uint32_t MACFCR;                                                         ///< MAC flow control register                    offset: 0x0018
    __IO uint32_t MACVLTR;                                                        ///< MAC VLAN Tag Register                        offset: 0x001C
    __IO uint32_t Reserved25[1];                                                  ///< Reserved
    __IO uint32_t MACSR;                                                          ///< MAC status register                          offset: 0x0024
    __IO uint32_t Reserved26[6];                                                  ///< Reserved
    struct{
          __IO uint32_t MACAHR;                                                   ///< MAC filter address high register            offset: 0x0040
          __IO uint32_t MACALR;                                                   ///< MAC filter address low register             offset: 0x0044
        }MACAH_L[16];
    __IO uint32_t Reserved27[464];                                                ///< Reserved
    struct{
          __IO uint32_t MACAHR;                                                   ///< MAC filter address high register            offset: 0x0800
          __IO uint32_t MACALR;                                                   ///< MAC filter address low register             offset: 0x0804
        }MACAH_H[16];
    __IO uint32_t Reserved28[480];                                                ///< Reserved
    __IO uint32_t DMABSR;                                                         ///< DMA bus control register                     offset: 0x1000
    __IO uint32_t DMATXPDR;                                                       ///< DMA send polling register                    offset: 0x1004
    __IO uint32_t DMARXPDR;                                                       ///< DMA receive polling register                 offset: 0x1008
    __IO uint32_t DMARXDSAR;                                                      ///< DMA receive descriptor address register      offset: 0x100C
    __IO uint32_t DMATXDSAR;                                                      ///< DMA send descriptor address register         offset: 0x1010
    __IO uint32_t DMASR;                                                          ///< DMA status register                          offset: 0x1014
    __IO uint32_t DMAMDR;                                                         ///< DMA working mode register                    offset: 0x0018
    __IO uint32_t DMAIR;                                                          ///< DMA interrupt register                       offset: 0x101C
    __IO uint32_t DMAFLCR;                                                        ///< DMA frame loss statistics register           offset: 0x1020
    __IO uint32_t DMAWDTR;                                                        ///< DMA watchdog timer register                  offset: 0x1024
    __IO uint32_t Reserved32[8];                                                  ///< Reserved
    __IO uint32_t DMACUTTXDSAR;                                                   ///< DMA current send descriptor address register offset: 0x1048
    __IO uint32_t DMACUTRXDSAR;                                                   ///< DMA current receive descriptor address registeroffset: 0x104C
    __IO uint32_t DMACUTTXBFAR;                                                   ///< DMA current send buffer address register     offset: 0x1050
    __IO uint32_t DMACUTRXBFAR;                                                   ///< DMA current receive buffer address register  offset: 0x1054

} ETH_Type;

