RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
/*******************************************************************************
 * ETH Type
 ******************************************************************************/

/*!
 * @addtogroup ETH_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief ETH_MACSMIAR Register Bit Definition
 */

#define ETH_MACSMIAR_SMIADD_SHIFT               (11)
#define ETH_MACSMIAR_SMIADD_MASK                (0x1FU << ETH_MACSMIAR_SMIADD_SHIFT)
#define ETH_MACSMIAR_SMIADD(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_MACSMIAR_SMIADD_SHIFT)) & ETH_MACSMIAR_SMIADD_MASK)

#define ETH_MACSMIAR_SMIREG_SHIFT               (6)
#define ETH_MACSMIAR_SMIREG_MASK                (0x1FU << ETH_MACSMIAR_SMIREG_SHIFT)
#define ETH_MACSMIAR_SMIREG(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_MACSMIAR_SMIREG_SHIFT)) & ETH_MACSMIAR_SMIREG_MASK)

#define ETH_MACSMIAR_SMICLK_SHIFT               (2)
#define ETH_MACSMIAR_SMICLK_MASK                (0xFU << ETH_MACSMIAR_SMICLK_SHIFT)
#define ETH_MACSMIAR_SMICLK(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_MACSMIAR_SMICLK_SHIFT)) & ETH_MACSMIAR_SMICLK_MASK)

#define ETH_MACSMIAR_SMIWR_SHIFT                (1)
#define ETH_MACSMIAR_SMIWR_MASK                 (0x01U << ETH_MACSMIAR_SMIWR_SHIFT)
#define ETH_MACSMIAR_SMIWR(x)                   (((uint32_t)(((uint32_t)(x)) << ETH_MACSMIAR_SMIWR_SHIFT)) & ETH_MACSMIAR_SMIWR_MASK)

#define ETH_MACSMIAR_SMIBY_SHIFT                (0)
#define ETH_MACSMIAR_SMIBY_MASK                 (0x01U << ETH_MACSMIAR_SMIBY_SHIFT)
#define ETH_MACSMIAR_SMIBY(x)                   (((uint32_t)(((uint32_t)(x)) << ETH_MACSMIAR_SMIBY_SHIFT)) & ETH_MACSMIAR_SMIBY_MASK)

/*!
 * @brief ETH_MACSMIDR Register Bit Definition
 */

#define ETH_MACSMIDR_SMIDATA_SHIFT              (0)
#define ETH_MACSMIDR_SMIDATA_MASK               (0xFFFFU << ETH_MACSMIDR_SMIDATA_SHIFT)
#define ETH_MACSMIDR_SMIDATA(x)                 (((uint32_t)(((uint32_t)(x)) << ETH_MACSMIDR_SMIDATA_SHIFT)) & ETH_MACSMIDR_SMIDATA_MASK)

/*!
 * @brief ETH_MACCR Register Bit Definition
 */

#define ETH_MACCR_CST_SHIFT                     (25)
#define ETH_MACCR_CST_MASK                      (0x01U << ETH_MACCR_CST_SHIFT)
#define ETH_MACCR_CST(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_CST_SHIFT)) & ETH_MACCR_CST_MASK)

#define ETH_MACCR_WTD_SHIFT                     (23)
#define ETH_MACCR_WTD_MASK                      (0x01U << ETH_MACCR_WTD_SHIFT)
#define ETH_MACCR_WTD(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_WTD_SHIFT)) & ETH_MACCR_WTD_MASK)

#define ETH_MACCR_JD_SHIFT                      (22)
#define ETH_MACCR_JD_MASK                       (0x01U << ETH_MACCR_JD_SHIFT)
#define ETH_MACCR_JD(x)                         (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_JD_SHIFT)) & ETH_MACCR_JD_MASK)

#define ETH_MACCR_IFG_SHIFT                     (17)
#define ETH_MACCR_IFG_MASK                      (0x7U << ETH_MACCR_IFG_SHIFT)
#define ETH_MACCR_IFG(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_IFG_SHIFT)) & ETH_MACCR_IFG_MASK)

#define ETH_MACCR_MCRS_SHIFT                    (16)
#define ETH_MACCR_MCRS_MASK                     (0x01U << ETH_MACCR_MCRS_SHIFT)
#define ETH_MACCR_MCRS(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_MCRS_SHIFT)) & ETH_MACCR_MCRS_MASK)

#define ETH_MACCR_ROD_SHIFT                     (13)
#define ETH_MACCR_ROD_MASK                      (0x01U << ETH_MACCR_ROD_SHIFT)
#define ETH_MACCR_ROD(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_ROD_SHIFT)) & ETH_MACCR_ROD_MASK)

#define ETH_MACCR_LM_SHIFT                      (12)
#define ETH_MACCR_LM_MASK                       (0x01U << ETH_MACCR_LM_SHIFT)
#define ETH_MACCR_LM(x)                         (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_LM_SHIFT)) & ETH_MACCR_LM_MASK)

#define ETH_MACCR_DM_SHIFT                      (11)
#define ETH_MACCR_DM_MASK                       (0x01U << ETH_MACCR_DM_SHIFT)
#define ETH_MACCR_DM(x)                         (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_DM_SHIFT)) & ETH_MACCR_DM_MASK)

#define ETH_MACCR_IPCO_SHIFT                    (10)
#define ETH_MACCR_IPCO_MASK                     (0x01U << ETH_MACCR_IPCO_SHIFT)
#define ETH_MACCR_IPCO(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_IPCO_SHIFT)) & ETH_MACCR_IPCO_MASK)

#define ETH_MACCR_RETY_SHIFT                    (9)
#define ETH_MACCR_RETY_MASK                     (0x01U << ETH_MACCR_RETY_SHIFT)
#define ETH_MACCR_RETY(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_RETY_SHIFT)) & ETH_MACCR_RETY_MASK)

#define ETH_MACCR_APCS_SHIFT                    (7)
#define ETH_MACCR_APCS_MASK                     (0x01U << ETH_MACCR_APCS_SHIFT)
#define ETH_MACCR_APCS(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_APCS_SHIFT)) & ETH_MACCR_APCS_MASK)

#define ETH_MACCR_BL_SHIFT                      (5)
#define ETH_MACCR_BL_MASK                       (0x3U << ETH_MACCR_BL_SHIFT)
#define ETH_MACCR_BL(x)                         (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_BL_SHIFT)) & ETH_MACCR_BL_MASK)

#define ETH_MACCR_DLYC_SHIFT                    (4)
#define ETH_MACCR_DLYC_MASK                     (0x01U << ETH_MACCR_DLYC_SHIFT)
#define ETH_MACCR_DLYC(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_DLYC_SHIFT)) & ETH_MACCR_DLYC_MASK)

#define ETH_MACCR_TE_SHIFT                      (3)
#define ETH_MACCR_TE_MASK                       (0x01U << ETH_MACCR_TE_SHIFT)
#define ETH_MACCR_TE(x)                         (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_TE_SHIFT)) & ETH_MACCR_TE_MASK)

#define ETH_MACCR_RE_SHIFT                      (2)
#define ETH_MACCR_RE_MASK                       (0x01U << ETH_MACCR_RE_SHIFT)
#define ETH_MACCR_RE(x)                         (((uint32_t)(((uint32_t)(x)) << ETH_MACCR_RE_SHIFT)) & ETH_MACCR_RE_MASK)

/*!
 * @brief ETH_MACSR Register Bit Definition
 */

#define ETH_MACSR_TXFF_SHIFT                    (25)
#define ETH_MACSR_TXFF_MASK                     (0x01U << ETH_MACSR_TXFF_SHIFT)
#define ETH_MACSR_TXFF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_TXFF_SHIFT)) & ETH_MACSR_TXFF_MASK)

