RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define ETH_MACSR_TXFNE_SHIFT                   (24)
#define ETH_MACSR_TXFNE_MASK                    (0x01U << ETH_MACSR_TXFNE_SHIFT)
#define ETH_MACSR_TXFNE(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_TXFNE_SHIFT)) & ETH_MACSR_TXFNE_MASK)

#define ETH_MACSR_TXFWA_SHIFT                   (22)
#define ETH_MACSR_TXFWA_MASK                    (0x01U << ETH_MACSR_TXFWA_SHIFT)
#define ETH_MACSR_TXFWA(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_TXFWA_SHIFT)) & ETH_MACSR_TXFWA_MASK)

#define ETH_MACSR_TXFRS_SHIFT                   (20)
#define ETH_MACSR_TXFRS_MASK                    (0x3U << ETH_MACSR_TXFRS_SHIFT)
#define ETH_MACSR_TXFRS(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_TXFRS_SHIFT)) & ETH_MACSR_TXFRS_MASK)

#define ETH_MACSR_MTP_SHIFT                     (19)
#define ETH_MACSR_MTP_MASK                      (0x01U << ETH_MACSR_MTP_SHIFT)
#define ETH_MACSR_MTP(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_MTP_SHIFT)) & ETH_MACSR_MTP_MASK)

#define ETH_MACSR_MTS_SHIFT                     (17)
#define ETH_MACSR_MTS_MASK                      (0x3U << ETH_MACSR_MTS_SHIFT)
#define ETH_MACSR_MTS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_MTS_SHIFT)) & ETH_MACSR_MTS_MASK)

#define ETH_MACSR_MTE_SHIFT                     (16)
#define ETH_MACSR_MTE_MASK                      (0x01U << ETH_MACSR_MTE_SHIFT)
#define ETH_MACSR_MTE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_MTE_SHIFT)) & ETH_MACSR_MTE_MASK)

#define ETH_MACSR_RXFLL_SHIFT                   (8)
#define ETH_MACSR_RXFLL_MASK                    (0x3U << ETH_MACSR_RXFLL_SHIFT)
#define ETH_MACSR_RXFLL(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_RXFLL_SHIFT)) & ETH_MACSR_RXFLL_MASK)

#define ETH_MACSR_RXFRS_SHIFT                   (5)
#define ETH_MACSR_RXFRS_MASK                    (0x3U << ETH_MACSR_RXFRS_SHIFT)
#define ETH_MACSR_RXFRS(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_RXFRS_SHIFT)) & ETH_MACSR_RXFRS_MASK)

#define ETH_MACSR_RXFWA_SHIFT                   (4)
#define ETH_MACSR_RXFWA_MASK                    (0x01U << ETH_MACSR_RXFWA_SHIFT)
#define ETH_MACSR_RXFWA(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_RXFWA_SHIFT)) & ETH_MACSR_RXFWA_MASK)

#define ETH_MACSR_MRS_SHIFT                     (1)
#define ETH_MACSR_MRS_MASK                      (0x3U << ETH_MACSR_MRS_SHIFT)
#define ETH_MACSR_MRS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_MRS_SHIFT)) & ETH_MACSR_MRS_MASK)

#define ETH_MACSR_MRE_SHIFT                     (0)
#define ETH_MACSR_MRE_MASK                      (0x01U << ETH_MACSR_MRE_SHIFT)
#define ETH_MACSR_MRE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACSR_MRE_SHIFT)) & ETH_MACSR_MRE_MASK)

/*!
 * @brief ETH_MACFCR Register Bit Definition
 */

#define ETH_MACFCR_PSET_SHIFT                   (16)
#define ETH_MACFCR_PSET_MASK                    (0xFFFFU << ETH_MACFCR_PSET_SHIFT)
#define ETH_MACFCR_PSET(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_PSET_SHIFT)) & ETH_MACFCR_PSET_MASK)

#define ETH_MACFCR_DZPQ_SHIFT                   (7)
#define ETH_MACFCR_DZPQ_MASK                    (0x01U << ETH_MACFCR_DZPQ_SHIFT)
#define ETH_MACFCR_DZPQ(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_DZPQ_SHIFT)) & ETH_MACFCR_DZPQ_MASK)

#define ETH_MACFCR_PLT_SHIFT                    (4)
#define ETH_MACFCR_PLT_MASK                     (0x3U << ETH_MACFCR_PLT_SHIFT)
#define ETH_MACFCR_PLT(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_PLT_SHIFT)) & ETH_MACFCR_PLT_MASK)

#define ETH_MACFCR_UP_SHIFT                     (3)
#define ETH_MACFCR_UP_MASK                      (0x01U << ETH_MACFCR_UP_SHIFT)
#define ETH_MACFCR_UP(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_UP_SHIFT)) & ETH_MACFCR_UP_MASK)

#define ETH_MACFCR_FRE_SHIFT                    (2)
#define ETH_MACFCR_FRE_MASK                     (0x01U << ETH_MACFCR_FRE_SHIFT)
#define ETH_MACFCR_FRE(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_FRE_SHIFT)) & ETH_MACFCR_FRE_MASK)

#define ETH_MACFCR_FTE_SHIFT                    (1)
#define ETH_MACFCR_FTE_MASK                     (0x01U << ETH_MACFCR_FTE_SHIFT)
#define ETH_MACFCR_FTE(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_FTE_SHIFT)) & ETH_MACFCR_FTE_MASK)

#define ETH_MACFCR_FCBBPA_SHIFT                 (0)
#define ETH_MACFCR_FCBBPA_MASK                  (0x01U << ETH_MACFCR_FCBBPA_SHIFT)
#define ETH_MACFCR_FCBBPA(x)                    (((uint32_t)(((uint32_t)(x)) << ETH_MACFCR_FCBBPA_SHIFT)) & ETH_MACFCR_FCBBPA_MASK)

/*!
 * @brief ETH_MACAFR Register Bit Definition
 */

#define ETH_MACAFR_RALL_SHIFT                   (31)
#define ETH_MACAFR_RALL_MASK                    (0x01U << ETH_MACAFR_RALL_SHIFT)
#define ETH_MACAFR_RALL(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_RALL_SHIFT)) & ETH_MACAFR_RALL_MASK)

#define ETH_MACAFR_VTFE_SHIFT                   (16)
#define ETH_MACAFR_VTFE_MASK                    (0x01U << ETH_MACAFR_VTFE_SHIFT)
#define ETH_MACAFR_VTFE(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_VTFE_SHIFT)) & ETH_MACAFR_VTFE_MASK)

#define ETH_MACAFR_HPF_SHIFT                    (10)
#define ETH_MACAFR_HPF_MASK                     (0x01U << ETH_MACAFR_HPF_SHIFT)
#define ETH_MACAFR_HPF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_HPF_SHIFT)) & ETH_MACAFR_HPF_MASK)

#define ETH_MACAFR_SAF_SHIFT                    (9)
#define ETH_MACAFR_SAF_MASK                     (0x01U << ETH_MACAFR_SAF_SHIFT)
#define ETH_MACAFR_SAF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_SAF_SHIFT)) & ETH_MACAFR_SAF_MASK)

#define ETH_MACAFR_SAIF_SHIFT                   (8)
#define ETH_MACAFR_SAIF_MASK                    (0x01U << ETH_MACAFR_SAIF_SHIFT)
#define ETH_MACAFR_SAIF(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_SAIF_SHIFT)) & ETH_MACAFR_SAIF_MASK)

#define ETH_MACAFR_PCF_SHIFT                    (6)
#define ETH_MACAFR_PCF_MASK                     (0x3U << ETH_MACAFR_PCF_SHIFT)
#define ETH_MACAFR_PCF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_PCF_SHIFT)) & ETH_MACAFR_PCF_MASK)

