RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define ETH_MACAFR_DBF_SHIFT                    (5)
#define ETH_MACAFR_DBF_MASK                     (0x01U << ETH_MACAFR_DBF_SHIFT)
#define ETH_MACAFR_DBF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_DBF_SHIFT)) & ETH_MACAFR_DBF_MASK)

#define ETH_MACAFR_PMF_SHIFT                    (4)
#define ETH_MACAFR_PMF_MASK                     (0x01U << ETH_MACAFR_PMF_SHIFT)
#define ETH_MACAFR_PMF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_PMF_SHIFT)) & ETH_MACAFR_PMF_MASK)

#define ETH_MACAFR_DAIF_SHIFT                   (3)
#define ETH_MACAFR_DAIF_MASK                    (0x01U << ETH_MACAFR_DAIF_SHIFT)
#define ETH_MACAFR_DAIF(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_DAIF_SHIFT)) & ETH_MACAFR_DAIF_MASK)

#define ETH_MACAFR_HM_SHIFT                     (2)
#define ETH_MACAFR_HM_MASK                      (0x01U << ETH_MACAFR_HM_SHIFT)
#define ETH_MACAFR_HM(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_HM_SHIFT)) & ETH_MACAFR_HM_MASK)

#define ETH_MACAFR_HU_SHIFT                     (1)
#define ETH_MACAFR_HU_MASK                      (0x01U << ETH_MACAFR_HU_SHIFT)
#define ETH_MACAFR_HU(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_HU_SHIFT)) & ETH_MACAFR_HU_MASK)

#define ETH_MACAFR_PM_SHIFT                     (0)
#define ETH_MACAFR_PM_MASK                      (0x01U << ETH_MACAFR_PM_SHIFT)
#define ETH_MACAFR_PM(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_MACAFR_PM_SHIFT)) & ETH_MACAFR_PM_MASK)

/*!
 * @brief ETH_MACAHR0 Register Bit Definition
 */

#define ETH_MACAHR0_ADDE_SHIFT                  (31)
#define ETH_MACAHR0_ADDE_MASK                   (0x01U << ETH_MACAHR0_ADDE_SHIFT)
#define ETH_MACAHR0_ADDE(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_MACAHR0_ADDE_SHIFT)) & ETH_MACAHR0_ADDE_MASK)

#define ETH_MACAHR0_SELE_SHIFT                  (30)
#define ETH_MACAHR0_SELE_MASK                   (0x01U << ETH_MACAHR0_SELE_SHIFT)
#define ETH_MACAHR0_SELE(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_MACAHR0_SELE_SHIFT)) & ETH_MACAHR0_SELE_MASK)

#define ETH_MACAHR0_MBYTEC_SHIFT                (24)
#define ETH_MACAHR0_MBYTEC_MASK                 (0x3FU << ETH_MACAHR0_MBYTEC_SHIFT)
#define ETH_MACAHR0_MBYTEC(x)                   (((uint32_t)(((uint32_t)(x)) << ETH_MACAHR0_MBYTEC_SHIFT)) & ETH_MACAHR0_MBYTEC_MASK)

#define ETH_MACAHR0_MACADDH_SHIFT               (0)
#define ETH_MACAHR0_MACADDH_MASK                (0xFFFFU << ETH_MACAHR0_MACADDH_SHIFT)
#define ETH_MACAHR0_MACADDH(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_MACAHR0_MACADDH_SHIFT)) & ETH_MACAHR0_MACADDH_MASK)

/*!
 * @brief ETH_MACALR0 Register Bit Definition
 */

#define ETH_MACALR0_MACADDL_SHIFT               (0)
#define ETH_MACALR0_MACADDL_MASK                (0xFFFFFFFFU << ETH_MACALR0_MACADDL_SHIFT)
#define ETH_MACALR0_MACADDL(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_MACALR0_MACADDL_SHIFT)) & ETH_MACALR0_MACADDL_MASK)

/*!
 * @brief ETH_MACHTHR Register Bit Definition
 */

#define ETH_MACHTHR_MACHTABH_SHIFT              (0)
#define ETH_MACHTHR_MACHTABH_MASK               (0xFFFFFFFFU << ETH_MACHTHR_MACHTABH_SHIFT)
#define ETH_MACHTHR_MACHTABH(x)                 (((uint32_t)(((uint32_t)(x)) << ETH_MACHTHR_MACHTABH_SHIFT)) & ETH_MACHTHR_MACHTABH_MASK)

/*!
 * @brief ETH_MACHTLR Register Bit Definition
 */

#define ETH_MACHTLR_MACHTABL_SHIFT              (0)
#define ETH_MACHTLR_MACHTABL_MASK               (0xFFFFFFFFU << ETH_MACHTLR_MACHTABL_SHIFT)
#define ETH_MACHTLR_MACHTABL(x)                 (((uint32_t)(((uint32_t)(x)) << ETH_MACHTLR_MACHTABL_SHIFT)) & ETH_MACHTLR_MACHTABL_MASK)

/*!
 * @brief ETH_MACVLTR Register Bit Definition
 */

#define ETH_MACVLTR_VLANTAG_SHIFT               (0)
#define ETH_MACVLTR_VLANTAG_MASK                (0xFFFFU << ETH_MACVLTR_VLANTAG_SHIFT)
#define ETH_MACVLTR_VLANTAG(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_MACVLTR_VLANTAG_SHIFT)) & ETH_MACVLTR_VLANTAG_MASK)

/*!
 * @brief ETH_DMAMDR Register Bit Definition
 */

#define ETH_DMAMDR_DTCOE_SHIFT                  (26)
#define ETH_DMAMDR_DTCOE_MASK                   (0x01U << ETH_DMAMDR_DTCOE_SHIFT)
#define ETH_DMAMDR_DTCOE(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_DTCOE_SHIFT)) & ETH_DMAMDR_DTCOE_MASK)

#define ETH_DMAMDR_RSF_SHIFT                    (25)
#define ETH_DMAMDR_RSF_MASK                     (0x01U << ETH_DMAMDR_RSF_SHIFT)
#define ETH_DMAMDR_RSF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_RSF_SHIFT)) & ETH_DMAMDR_RSF_MASK)

#define ETH_DMAMDR_DFRF_SHIFT                   (24)
#define ETH_DMAMDR_DFRF_MASK                    (0x01U << ETH_DMAMDR_DFRF_SHIFT)
#define ETH_DMAMDR_DFRF(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_DFRF_SHIFT)) & ETH_DMAMDR_DFRF_MASK)

#define ETH_DMAMDR_TSF_SHIFT                    (21)
#define ETH_DMAMDR_TSF_MASK                     (0x01U << ETH_DMAMDR_TSF_SHIFT)
#define ETH_DMAMDR_TSF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_TSF_SHIFT)) & ETH_DMAMDR_TSF_MASK)

#define ETH_DMAMDR_FTF_SHIFT                    (20)
#define ETH_DMAMDR_FTF_MASK                     (0x01U << ETH_DMAMDR_FTF_SHIFT)
#define ETH_DMAMDR_FTF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_FTF_SHIFT)) & ETH_DMAMDR_FTF_MASK)

#define ETH_DMAMDR_TTC_SHIFT                    (14)
#define ETH_DMAMDR_TTC_MASK                     (0x7U << ETH_DMAMDR_TTC_SHIFT)
#define ETH_DMAMDR_TTC(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_TTC_SHIFT)) & ETH_DMAMDR_TTC_MASK)

#define ETH_DMAMDR_STT_SHIFT                    (13)
#define ETH_DMAMDR_STT_MASK                     (0x01U << ETH_DMAMDR_STT_SHIFT)
#define ETH_DMAMDR_STT(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_STT_SHIFT)) & ETH_DMAMDR_STT_MASK)

#define ETH_DMAMDR_FEF_SHIFT                    (7)
#define ETH_DMAMDR_FEF_MASK                     (0x01U << ETH_DMAMDR_FEF_SHIFT)
#define ETH_DMAMDR_FEF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_FEF_SHIFT)) & ETH_DMAMDR_FEF_MASK)

#define ETH_DMAMDR_FUF_SHIFT                    (6)
#define ETH_DMAMDR_FUF_MASK                     (0x01U << ETH_DMAMDR_FUF_SHIFT)
#define ETH_DMAMDR_FUF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_FUF_SHIFT)) & ETH_DMAMDR_FUF_MASK)

#define ETH_DMAMDR_DGF_SHIFT                    (5)
#define ETH_DMAMDR_DGF_MASK                     (0x01U << ETH_DMAMDR_DGF_SHIFT)
#define ETH_DMAMDR_DGF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_DGF_SHIFT)) & ETH_DMAMDR_DGF_MASK)

#define ETH_DMAMDR_RTC_SHIFT                    (3)
#define ETH_DMAMDR_RTC_MASK                     (0x3U << ETH_DMAMDR_RTC_SHIFT)
#define ETH_DMAMDR_RTC(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_RTC_SHIFT)) & ETH_DMAMDR_RTC_MASK)

#define ETH_DMAMDR_OSF_SHIFT                    (2)
#define ETH_DMAMDR_OSF_MASK                     (0x01U << ETH_DMAMDR_OSF_SHIFT)
#define ETH_DMAMDR_OSF(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_OSF_SHIFT)) & ETH_DMAMDR_OSF_MASK)

#define ETH_DMAMDR_SR_SHIFT                     (1)
#define ETH_DMAMDR_SR_MASK                      (0x01U << ETH_DMAMDR_SR_SHIFT)
#define ETH_DMAMDR_SR(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAMDR_SR_SHIFT)) & ETH_DMAMDR_SR_MASK)

/*!
 * @brief ETH_DMABSR Register Bit Definition
 */

