RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define ETH_DMABSR_ALL_SHIFT                    (25)
#define ETH_DMABSR_ALL_MASK                     (0x01U << ETH_DMABSR_ALL_SHIFT)
#define ETH_DMABSR_ALL(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_ALL_SHIFT)) & ETH_DMABSR_ALL_MASK)

#define ETH_DMABSR_FBST_SHIFT                   (16)
#define ETH_DMABSR_FBST_MASK                    (0x01U << ETH_DMABSR_FBST_SHIFT)
#define ETH_DMABSR_FBST(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_FBST_SHIFT)) & ETH_DMABSR_FBST_MASK)

#define ETH_DMABSR_FTPR_SHIFT                   (14)
#define ETH_DMABSR_FTPR_MASK                    (0x3U << ETH_DMABSR_FTPR_SHIFT)
#define ETH_DMABSR_FTPR(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_FTPR_SHIFT)) & ETH_DMABSR_FTPR_MASK)

#define ETH_DMABSR_PBL_SHIFT                    (8)
#define ETH_DMABSR_PBL_MASK                     (0x3FU << ETH_DMABSR_PBL_SHIFT)
#define ETH_DMABSR_PBL(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_PBL_SHIFT)) & ETH_DMABSR_PBL_MASK)

#define ETH_DMABSR_DSL_SHIFT                    (2)
#define ETH_DMABSR_DSL_MASK                     (0x1FU << ETH_DMABSR_DSL_SHIFT)
#define ETH_DMABSR_DSL(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_DSL_SHIFT)) & ETH_DMABSR_DSL_MASK)

#define ETH_DMABSR_DMAA_SHIFT                   (1)
#define ETH_DMABSR_DMAA_MASK                    (0x01U << ETH_DMABSR_DMAA_SHIFT)
#define ETH_DMABSR_DMAA(x)                      (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_DMAA_SHIFT)) & ETH_DMABSR_DMAA_MASK)

#define ETH_DMABSR_SR_SHIFT                     (0)
#define ETH_DMABSR_SR_MASK                      (0x01U << ETH_DMABSR_SR_SHIFT)
#define ETH_DMABSR_SR(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMABSR_SR_SHIFT)) & ETH_DMABSR_SR_MASK)

/*!
 * @brief ETH_DMAIR Register Bit Definition
 */

#define ETH_DMAIR_NIE_SHIFT                     (16)
#define ETH_DMAIR_NIE_MASK                      (0x01U << ETH_DMAIR_NIE_SHIFT)
#define ETH_DMAIR_NIE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_NIE_SHIFT)) & ETH_DMAIR_NIE_MASK)

#define ETH_DMAIR_AIE_SHIFT                     (15)
#define ETH_DMAIR_AIE_MASK                      (0x01U << ETH_DMAIR_AIE_SHIFT)
#define ETH_DMAIR_AIE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_AIE_SHIFT)) & ETH_DMAIR_AIE_MASK)

#define ETH_DMAIR_ERE_SHIFT                     (14)
#define ETH_DMAIR_ERE_MASK                      (0x01U << ETH_DMAIR_ERE_SHIFT)
#define ETH_DMAIR_ERE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_ERE_SHIFT)) & ETH_DMAIR_ERE_MASK)

#define ETH_DMAIR_FBE_SHIFT                     (13)
#define ETH_DMAIR_FBE_MASK                      (0x01U << ETH_DMAIR_FBE_SHIFT)
#define ETH_DMAIR_FBE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_FBE_SHIFT)) & ETH_DMAIR_FBE_MASK)

#define ETH_DMAIR_ETE_SHIFT                     (10)
#define ETH_DMAIR_ETE_MASK                      (0x01U << ETH_DMAIR_ETE_SHIFT)
#define ETH_DMAIR_ETE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_ETE_SHIFT)) & ETH_DMAIR_ETE_MASK)

#define ETH_DMAIR_RWE_SHIFT                     (9)
#define ETH_DMAIR_RWE_MASK                      (0x01U << ETH_DMAIR_RWE_SHIFT)
#define ETH_DMAIR_RWE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_RWE_SHIFT)) & ETH_DMAIR_RWE_MASK)

#define ETH_DMAIR_RSE_SHIFT                     (8)
#define ETH_DMAIR_RSE_MASK                      (0x01U << ETH_DMAIR_RSE_SHIFT)
#define ETH_DMAIR_RSE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_RSE_SHIFT)) & ETH_DMAIR_RSE_MASK)

#define ETH_DMAIR_RUE_SHIFT                     (7)
#define ETH_DMAIR_RUE_MASK                      (0x01U << ETH_DMAIR_RUE_SHIFT)
#define ETH_DMAIR_RUE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_RUE_SHIFT)) & ETH_DMAIR_RUE_MASK)

#define ETH_DMAIR_RIE_SHIFT                     (6)
#define ETH_DMAIR_RIE_MASK                      (0x01U << ETH_DMAIR_RIE_SHIFT)
#define ETH_DMAIR_RIE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_RIE_SHIFT)) & ETH_DMAIR_RIE_MASK)

#define ETH_DMAIR_UNE_SHIFT                     (5)
#define ETH_DMAIR_UNE_MASK                      (0x01U << ETH_DMAIR_UNE_SHIFT)
#define ETH_DMAIR_UNE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_UNE_SHIFT)) & ETH_DMAIR_UNE_MASK)

#define ETH_DMAIR_OVE_SHIFT                     (4)
#define ETH_DMAIR_OVE_MASK                      (0x01U << ETH_DMAIR_OVE_SHIFT)
#define ETH_DMAIR_OVE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_OVE_SHIFT)) & ETH_DMAIR_OVE_MASK)

#define ETH_DMAIR_TJE_SHIFT                     (3)
#define ETH_DMAIR_TJE_MASK                      (0x01U << ETH_DMAIR_TJE_SHIFT)
#define ETH_DMAIR_TJE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_TJE_SHIFT)) & ETH_DMAIR_TJE_MASK)

#define ETH_DMAIR_TUE_SHIFT                     (2)
#define ETH_DMAIR_TUE_MASK                      (0x01U << ETH_DMAIR_TUE_SHIFT)
#define ETH_DMAIR_TUE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_TUE_SHIFT)) & ETH_DMAIR_TUE_MASK)

#define ETH_DMAIR_TSE_SHIFT                     (1)
#define ETH_DMAIR_TSE_MASK                      (0x01U << ETH_DMAIR_TSE_SHIFT)
#define ETH_DMAIR_TSE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_TSE_SHIFT)) & ETH_DMAIR_TSE_MASK)

#define ETH_DMAIR_TIE_SHIFT                     (0)
#define ETH_DMAIR_TIE_MASK                      (0x01U << ETH_DMAIR_TIE_SHIFT)
#define ETH_DMAIR_TIE(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMAIR_TIE_SHIFT)) & ETH_DMAIR_TIE_MASK)

/*!
 * @brief ETH_DMASR Register Bit Definition
 */

#define ETH_DMASR_EBUS_SHIFT                    (23)
#define ETH_DMASR_EBUS_MASK                     (0x7U << ETH_DMASR_EBUS_SHIFT)
#define ETH_DMASR_EBUS(x)                       (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_EBUS_SHIFT)) & ETH_DMASR_EBUS_MASK)

