RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define ETH_DMASR_TPS_SHIFT                     (20)
#define ETH_DMASR_TPS_MASK                      (0x7U << ETH_DMASR_TPS_SHIFT)
#define ETH_DMASR_TPS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_TPS_SHIFT)) & ETH_DMASR_TPS_MASK)

#define ETH_DMASR_RPS_SHIFT                     (17)
#define ETH_DMASR_RPS_MASK                      (0x7U << ETH_DMASR_RPS_SHIFT)
#define ETH_DMASR_RPS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_RPS_SHIFT)) & ETH_DMASR_RPS_MASK)

#define ETH_DMASR_NIS_SHIFT                     (16)
#define ETH_DMASR_NIS_MASK                      (0x01U << ETH_DMASR_NIS_SHIFT)
#define ETH_DMASR_NIS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_NIS_SHIFT)) & ETH_DMASR_NIS_MASK)

#define ETH_DMASR_AIS_SHIFT                     (15)
#define ETH_DMASR_AIS_MASK                      (0x01U << ETH_DMASR_AIS_SHIFT)
#define ETH_DMASR_AIS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_AIS_SHIFT)) & ETH_DMASR_AIS_MASK)

#define ETH_DMASR_ERS_SHIFT                     (14)
#define ETH_DMASR_ERS_MASK                      (0x01U << ETH_DMASR_ERS_SHIFT)
#define ETH_DMASR_ERS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_ERS_SHIFT)) & ETH_DMASR_ERS_MASK)

#define ETH_DMASR_FBS_SHIFT                     (13)
#define ETH_DMASR_FBS_MASK                      (0x01U << ETH_DMASR_FBS_SHIFT)
#define ETH_DMASR_FBS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_FBS_SHIFT)) & ETH_DMASR_FBS_MASK)

#define ETH_DMASR_ETS_SHIFT                     (10)
#define ETH_DMASR_ETS_MASK                      (0x01U << ETH_DMASR_ETS_SHIFT)
#define ETH_DMASR_ETS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_ETS_SHIFT)) & ETH_DMASR_ETS_MASK)

#define ETH_DMASR_RWS_SHIFT                     (9)
#define ETH_DMASR_RWS_MASK                      (0x01U << ETH_DMASR_RWS_SHIFT)
#define ETH_DMASR_RWS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_RWS_SHIFT)) & ETH_DMASR_RWS_MASK)

#define ETH_DMASR_RSS_SHIFT                     (8)
#define ETH_DMASR_RSS_MASK                      (0x01U << ETH_DMASR_RSS_SHIFT)
#define ETH_DMASR_RSS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_RSS_SHIFT)) & ETH_DMASR_RSS_MASK)

#define ETH_DMASR_RUS_SHIFT                     (7)
#define ETH_DMASR_RUS_MASK                      (0x01U << ETH_DMASR_RUS_SHIFT)
#define ETH_DMASR_RUS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_RUS_SHIFT)) & ETH_DMASR_RUS_MASK)

#define ETH_DMASR_RIS_SHIFT                     (6)
#define ETH_DMASR_RIS_MASK                      (0x01U << ETH_DMASR_RIS_SHIFT)
#define ETH_DMASR_RIS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_RIS_SHIFT)) & ETH_DMASR_RIS_MASK)

#define ETH_DMASR_UNS_SHIFT                     (5)
#define ETH_DMASR_UNS_MASK                      (0x01U << ETH_DMASR_UNS_SHIFT)
#define ETH_DMASR_UNS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_UNS_SHIFT)) & ETH_DMASR_UNS_MASK)

#define ETH_DMASR_OVS_SHIFT                     (4)
#define ETH_DMASR_OVS_MASK                      (0x01U << ETH_DMASR_OVS_SHIFT)
#define ETH_DMASR_OVS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_OVS_SHIFT)) & ETH_DMASR_OVS_MASK)

#define ETH_DMASR_TJS_SHIFT                     (3)
#define ETH_DMASR_TJS_MASK                      (0x01U << ETH_DMASR_TJS_SHIFT)
#define ETH_DMASR_TJS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_TJS_SHIFT)) & ETH_DMASR_TJS_MASK)

#define ETH_DMASR_TUS_SHIFT                     (2)
#define ETH_DMASR_TUS_MASK                      (0x01U << ETH_DMASR_TUS_SHIFT)
#define ETH_DMASR_TUS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_TUS_SHIFT)) & ETH_DMASR_TUS_MASK)

#define ETH_DMASR_TSS_SHIFT                     (1)
#define ETH_DMASR_TSS_MASK                      (0x01U << ETH_DMASR_TSS_SHIFT)
#define ETH_DMASR_TSS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_TSS_SHIFT)) & ETH_DMASR_TSS_MASK)

#define ETH_DMASR_TIS_SHIFT                     (0)
#define ETH_DMASR_TIS_MASK                      (0x01U << ETH_DMASR_TIS_SHIFT)
#define ETH_DMASR_TIS(x)                        (((uint32_t)(((uint32_t)(x)) << ETH_DMASR_TIS_SHIFT)) & ETH_DMASR_TIS_MASK)

/*!
 * @brief ETH_DMAFLCR Register Bit Definition
 */

#define ETH_DMAFLCR_OVFF_SHIFT                  (28)
#define ETH_DMAFLCR_OVFF_MASK                   (0x01U << ETH_DMAFLCR_OVFF_SHIFT)
#define ETH_DMAFLCR_OVFF(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_DMAFLCR_OVFF_SHIFT)) & ETH_DMAFLCR_OVFF_MASK)

#define ETH_DMAFLCR_OVFC_SHIFT                  (17)
#define ETH_DMAFLCR_OVFC_MASK                   (0x7FFU << ETH_DMAFLCR_OVFC_SHIFT)
#define ETH_DMAFLCR_OVFC(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_DMAFLCR_OVFC_SHIFT)) & ETH_DMAFLCR_OVFC_MASK)

#define ETH_DMAFLCR_BNAF_SHIFT                  (16)
#define ETH_DMAFLCR_BNAF_MASK                   (0x01U << ETH_DMAFLCR_BNAF_SHIFT)
#define ETH_DMAFLCR_BNAF(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_DMAFLCR_BNAF_SHIFT)) & ETH_DMAFLCR_BNAF_MASK)

#define ETH_DMAFLCR_BNAC_SHIFT                  (0)
#define ETH_DMAFLCR_BNAC_MASK                   (0xFFFFU << ETH_DMAFLCR_BNAC_SHIFT)
#define ETH_DMAFLCR_BNAC(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_DMAFLCR_BNAC_SHIFT)) & ETH_DMAFLCR_BNAC_MASK)

/*!
 * @brief ETH_DMAWDTR Register Bit Definition
 */

#define ETH_DMAWDTR_RIWT_SHIFT                  (0)
#define ETH_DMAWDTR_RIWT_MASK                   (0xFFU << ETH_DMAWDTR_RIWT_SHIFT)
#define ETH_DMAWDTR_RIWT(x)                     (((uint32_t)(((uint32_t)(x)) << ETH_DMAWDTR_RIWT_SHIFT)) & ETH_DMAWDTR_RIWT_MASK)

/*!
 * @brief ETH_DMARXPDR Register Bit Definition
 */

#define ETH_DMARXPDR_RXPD_SHIFT                 (0)
#define ETH_DMARXPDR_RXPD_MASK                  (0xFFFFFFFFU << ETH_DMARXPDR_RXPD_SHIFT)
#define ETH_DMARXPDR_RXPD(x)                    (((uint32_t)(((uint32_t)(x)) << ETH_DMARXPDR_RXPD_SHIFT)) & ETH_DMARXPDR_RXPD_MASK)

/*!
 * @brief ETH_DMATXPDR Register Bit Definition
 */

#define ETH_DMATXPDR_TXPD_SHIFT                 (0)
#define ETH_DMATXPDR_TXPD_MASK                  (0xFFFFFFFFU << ETH_DMATXPDR_TXPD_SHIFT)
#define ETH_DMATXPDR_TXPD(x)                    (((uint32_t)(((uint32_t)(x)) << ETH_DMATXPDR_TXPD_SHIFT)) & ETH_DMATXPDR_TXPD_MASK)

/*!
 * @brief ETH_DMARXDSAR Register Bit Definition
 */

#define ETH_DMARXDSAR_RXDSA_SHIFT               (0)
#define ETH_DMARXDSAR_RXDSA_MASK                (0xFFFFFFFFU << ETH_DMARXDSAR_RXDSA_SHIFT)
#define ETH_DMARXDSAR_RXDSA(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_DMARXDSAR_RXDSA_SHIFT)) & ETH_DMARXDSAR_RXDSA_MASK)

/*!
 * @brief ETH_DMATXDSAR Register Bit Definition
 */

