RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define ETH_DMATXDSAR_TXDSA_SHIFT               (0)
#define ETH_DMATXDSAR_TXDSA_MASK                (0xFFFFFFFFU << ETH_DMATXDSAR_TXDSA_SHIFT)
#define ETH_DMATXDSAR_TXDSA(x)                  (((uint32_t)(((uint32_t)(x)) << ETH_DMATXDSAR_TXDSA_SHIFT)) & ETH_DMATXDSAR_TXDSA_MASK)

/*!
 * @brief ETH_DMACUTRXDSAR Register Bit Definition
 */

#define ETH_DMACUTRXDSAR_CUTRXDSA_SHIFT         (0)
#define ETH_DMACUTRXDSAR_CUTRXDSA_MASK          (0xFFFFFFFFU << ETH_DMACUTRXDSAR_CUTRXDSA_SHIFT)
#define ETH_DMACUTRXDSAR_CUTRXDSA(x)            (((uint32_t)(((uint32_t)(x)) << ETH_DMACUTRXDSAR_CUTRXDSA_SHIFT)) & ETH_DMACUTRXDSAR_CUTRXDSA_MASK)

/*!
 * @brief ETH_DMACUTTXDSAR Register Bit Definition
 */

#define ETH_DMACUTTXDSAR_CUTTXDSA_SHIFT         (0)
#define ETH_DMACUTTXDSAR_CUTTXDSA_MASK          (0xFFFFFFFFU << ETH_DMACUTTXDSAR_CUTTXDSA_SHIFT)
#define ETH_DMACUTTXDSAR_CUTTXDSA(x)            (((uint32_t)(((uint32_t)(x)) << ETH_DMACUTTXDSAR_CUTTXDSA_SHIFT)) & ETH_DMACUTTXDSAR_CUTTXDSA_MASK)

/*!
 * @brief ETH_DMACUTRXBFAR Register Bit Definition
 */

#define ETH_DMACUTRXBFAR_CUTRXBUF_SHIFT         (0)
#define ETH_DMACUTRXBFAR_CUTRXBUF_MASK          (0xFFFFFFFFU << ETH_DMACUTRXBFAR_CUTRXBUF_SHIFT)
#define ETH_DMACUTRXBFAR_CUTRXBUF(x)            (((uint32_t)(((uint32_t)(x)) << ETH_DMACUTRXBFAR_CUTRXBUF_SHIFT)) & ETH_DMACUTRXBFAR_CUTRXBUF_MASK)

/*!
 * @brief ETH_DMACUTTXBFAR Register Bit Definition
 */

#define ETH_DMACUTTXBFAR_CUTTXBUF_SHIFT         (0)
#define ETH_DMACUTTXBFAR_CUTTXBUF_MASK          (0xFFFFFFFFU << ETH_DMACUTTXBFAR_CUTTXBUF_SHIFT)
#define ETH_DMACUTTXBFAR_CUTTXBUF(x)            (((uint32_t)(((uint32_t)(x)) << ETH_DMACUTTXBFAR_CUTTXBUF_SHIFT)) & ETH_DMACUTTXBFAR_CUTTXBUF_MASK)

/*!
 * @}
 */ /* end of group ETH_Register_Masks */
/******************************************************************************
 * ETH Instance
******************************************************************************/
#define ETH                             ((ETH_Type*)ETHERNET_BASE)

/*!
 * @}
 */ /* end of group ETH_Peripheral_Access_Layer */



/*!
 * @addtogroup SDIO_Peripheral_Access_Layer SDIO Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * SDIO Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MMCCTRL;                                                       ///< MMCCTRL                                     offset: 0x00
    __IO uint32_t MMCIO;                                                         ///< MMCIO                                       offset: 0x04
    __IO uint32_t MMCBYTECNTL;                                                   ///< MMCBYTECNTL                                 offset: 0x08
    __IO uint32_t MMCTRBLOCKCNT;                                                 ///< MMCTRBLOCKCNT                               offset: 0x0C
    __IO uint32_t MMCCRCCTL;                                                     ///< MMCCRCCTL                                   offset: 0x10
    __IO uint32_t CMDCRC;                                                        ///< CMDCRC                                      offset: 0x14
    __IO uint32_t DATCRCL;                                                       ///< DATCRCL                                     offset: 0x18
    __IO uint32_t DATCRCH;                                                       ///< DATCRCH                                     offset: 0x1C
    __IO uint32_t MMCPORT;                                                       ///< MMCPORT                                     offset: 0x20
    __IO uint32_t MMCINTMASK;                                                    ///< MMCINTMASK                                  offset: 0x24
    __IO uint32_t CLRMMCINT;                                                     ///< CLRMMCINT                                   offset: 0x28
    __IO uint32_t MMCCARDSEL;                                                    ///< MMCCARDSEL                                  offset: 0x2C
    __IO uint32_t MMCSIQ;                                                        ///< MMCSIQ                                      offset: 0x30
    __IO uint32_t MMCIOMBCTL;                                                    ///< MMCIOMBCTL                                  offset: 0x34
    __IO uint32_t MMCBLOCKCNT;                                                   ///< MMCBLOCKCNT                                 offset: 0x38
    __IO uint32_t MMCTIMEOUTCNT;                                                 ///< MMCTIMEOUTCN                                offset: 0x3C
    __IO uint32_t CMDBUF[16];                                                    ///< CMDBUFx (0..15)                             offset: 0x40
    __IO uint32_t BUFCTL;                                                       ///< BUFCTL                                      offset: 0x80
    __IO uint32_t Reserved36[31];                                                ///< Reserved
    __IO uint32_t DATABUF[126];                                                  ///< DATABUF                                     offset: 0x100
} SDIO_Type;

/*******************************************************************************
 * SDIO Type
 ******************************************************************************/

/*!
 * @addtogroup SDIO_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SDIO_MMCCTRL Register Bit Definition
 */

#define SDIO_MMCCTRL_RDWTEN_SHIFT              (10)
#define SDIO_MMCCTRL_RDWTEN_MASK               (0x01U << SDIO_MMCCTRL_RDWTEN_SHIFT)
#define SDIO_MMCCTRL_RDWTEN(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_RDWTEN_SHIFT)) & SDIO_MMCCTRL_RDWTEN_MASK)

#define SDIO_MMCCTRL_INTEN_SHIFT               (9)
#define SDIO_MMCCTRL_INTEN_MASK                (0x01U << SDIO_MMCCTRL_INTEN_SHIFT)
#define SDIO_MMCCTRL_INTEN(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_INTEN_SHIFT)) & SDIO_MMCCTRL_INTEN_MASK)

#define SDIO_MMCCTRL_MDEN_SHIFT                (8)
#define SDIO_MMCCTRL_MDEN_MASK                 (0x01U << SDIO_MMCCTRL_MDEN_SHIFT)
#define SDIO_MMCCTRL_MDEN(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_MDEN_SHIFT)) & SDIO_MMCCTRL_MDEN_MASK)

#define SDIO_MMCCTRL_DATWT_SHIFT               (7)
#define SDIO_MMCCTRL_DATWT_MASK                (0x01U << SDIO_MMCCTRL_DATWT_SHIFT)
#define SDIO_MMCCTRL_DATWT(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_DATWT_SHIFT)) & SDIO_MMCCTRL_DATWT_MASK)

#define SDIO_MMCCTRL_SELPTSM_SHIFT             (6)
#define SDIO_MMCCTRL_SELPTSM_MASK              (0x01U << SDIO_MMCCTRL_SELPTSM_SHIFT)
#define SDIO_MMCCTRL_SELPTSM(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_SELPTSM_SHIFT)) & SDIO_MMCCTRL_SELPTSM_MASK)

#define SDIO_MMCCTRL_CLKSP_SHIFT               (3)
#define SDIO_MMCCTRL_CLKSP_MASK                (0x7U << SDIO_MMCCTRL_CLKSP_SHIFT)
#define SDIO_MMCCTRL_CLKSP(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_CLKSP_SHIFT)) & SDIO_MMCCTRL_CLKSP_MASK)

#define SDIO_MMCCTRL_OUTM_SHIFT                (2)
#define SDIO_MMCCTRL_OUTM_MASK                 (0x01U << SDIO_MMCCTRL_OUTM_SHIFT)
#define SDIO_MMCCTRL_OUTM(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_OUTM_SHIFT)) & SDIO_MMCCTRL_OUTM_MASK)

#define SDIO_MMCCTRL_SELSM_SHIFT               (1)
#define SDIO_MMCCTRL_SELSM_MASK                (0x01U << SDIO_MMCCTRL_SELSM_SHIFT)
#define SDIO_MMCCTRL_SELSM(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_SELSM_SHIFT)) & SDIO_MMCCTRL_SELSM_MASK)

