RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define SDIO_MMCCTRL_OPMSEL_SHIFT              (0)
#define SDIO_MMCCTRL_OPMSEL_MASK               (0x01U << SDIO_MMCCTRL_OPMSEL_SHIFT)
#define SDIO_MMCCTRL_OPMSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCTRL_OPMSEL_SHIFT)) & SDIO_MMCCTRL_OPMSEL_MASK)

/*!
 * @brief SDIO_MMCIO Register Bit Definition
 */

#define SDIO_MMCIO_CMDAF_SHIFT                 (9)
#define SDIO_MMCIO_CMDAF_MASK                  (0x01U << SDIO_MMCIO_CMDAF_SHIFT)
#define SDIO_MMCIO_CMDAF(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_CMDAF_SHIFT)) & SDIO_MMCIO_CMDAF_MASK)

#define SDIO_MMCIO_CMDCH_SHIFT                 (8)
#define SDIO_MMCIO_CMDCH_MASK                  (0x01U << SDIO_MMCIO_CMDCH_SHIFT)
#define SDIO_MMCIO_CMDCH(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_CMDCH_SHIFT)) & SDIO_MMCIO_CMDCH_MASK)

#define SDIO_MMCIO_AUTOCLKG_SHIFT              (7)
#define SDIO_MMCIO_AUTOCLKG_MASK               (0x01U << SDIO_MMCIO_AUTOCLKG_SHIFT)
#define SDIO_MMCIO_AUTOCLKG(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_AUTOCLKG_SHIFT)) & SDIO_MMCIO_AUTOCLKG_MASK)

#define SDIO_MMCIO_ENRRESP_SHIFT               (6)
#define SDIO_MMCIO_ENRRESP_MASK                (0x01U << SDIO_MMCIO_ENRRESP_SHIFT)
#define SDIO_MMCIO_ENRRESP(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_ENRRESP_SHIFT)) & SDIO_MMCIO_ENRRESP_MASK)

#define SDIO_MMCIO_PCLKG_SHIFT                 (5)
#define SDIO_MMCIO_PCLKG_MASK                  (0x01U << SDIO_MMCIO_PCLKG_SHIFT)
#define SDIO_MMCIO_PCLKG(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_PCLKG_SHIFT)) & SDIO_MMCIO_PCLKG_MASK)

#define SDIO_MMCIO_CIDCSDRD_SHIFT              (4)
#define SDIO_MMCIO_CIDCSDRD_MASK               (0x01U << SDIO_MMCIO_CIDCSDRD_SHIFT)
#define SDIO_MMCIO_CIDCSDRD(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_CIDCSDRD_SHIFT)) & SDIO_MMCIO_CIDCSDRD_MASK)

#define SDIO_MMCIO_RESPCMDSEL_SHIFT            (3)
#define SDIO_MMCIO_RESPCMDSEL_MASK             (0x01U << SDIO_MMCIO_RESPCMDSEL_SHIFT)
#define SDIO_MMCIO_RESPCMDSEL(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_RESPCMDSEL_SHIFT)) & SDIO_MMCIO_RESPCMDSEL_MASK)

#define SDIO_MMCIO_AUTOTR_SHIFT                (2)
#define SDIO_MMCIO_AUTOTR_MASK                 (0x01U << SDIO_MMCIO_AUTOTR_SHIFT)
#define SDIO_MMCIO_AUTOTR(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_AUTOTR_SHIFT)) & SDIO_MMCIO_AUTOTR_MASK)

#define SDIO_MMCIO_TRANSFDIR_SHIFT             (1)
#define SDIO_MMCIO_TRANSFDIR_MASK              (0x01U << SDIO_MMCIO_TRANSFDIR_SHIFT)
#define SDIO_MMCIO_TRANSFDIR(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_TRANSFDIR_SHIFT)) & SDIO_MMCIO_TRANSFDIR_MASK)

#define SDIO_MMCIO_AUTODATTR_SHIFT             (0)
#define SDIO_MMCIO_AUTODATTR_MASK              (0x01U << SDIO_MMCIO_AUTODATTR_SHIFT)
#define SDIO_MMCIO_AUTODATTR(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIO_AUTODATTR_SHIFT)) & SDIO_MMCIO_AUTODATTR_MASK)

/*!
 * @brief SDIO_MMCBYTECNTL Register Bit Definition
 */

#define SDIO_MMCBYTECNTL_CNT_SHIFT             (0)
#define SDIO_MMCBYTECNTL_CNT_MASK              (0xFFFFU << SDIO_MMCBYTECNTL_CNT_SHIFT)
#define SDIO_MMCBYTECNTL_CNT(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_MMCBYTECNTL_CNT_SHIFT)) & SDIO_MMCBYTECNTL_CNT_MASK)

/*!
 * @brief SDIO_MMCTRBLOCKCNT Register Bit Definition
 */

#define SDIO_MMCTRBLOCKCNT_CNT_SHIFT          (0)
#define SDIO_MMCTRBLOCKCNT_CNT_MASK           (0xFFFFU << SDIO_MMCTRBLOCKCNT_CNT_SHIFT)
#define SDIO_MMCTRBLOCKCNT_CNT(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCTRBLOCKCNT_CNT_SHIFT)) & SDIO_MMCTRBLOCKCNT_CNT_MASK)

/*!
 * @brief SDIO_MMCCRCCTL Register Bit Definition
 */

#define SDIO_MMCCRCCTL_CMDCRCEN_SHIFT          (7)
#define SDIO_MMCCRCCTL_CMDCRCEN_MASK           (0x01U << SDIO_MMCCRCCTL_CMDCRCEN_SHIFT)
#define SDIO_MMCCRCCTL_CMDCRCEN(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_CMDCRCEN_SHIFT)) & SDIO_MMCCRCCTL_CMDCRCEN_MASK)

#define SDIO_MMCCRCCTL_DATCRCEN_SHIFT          (6)
#define SDIO_MMCCRCCTL_DATCRCEN_MASK           (0x01U << SDIO_MMCCRCCTL_DATCRCEN_SHIFT)
#define SDIO_MMCCRCCTL_DATCRCEN(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_DATCRCEN_SHIFT)) & SDIO_MMCCRCCTL_DATCRCEN_MASK)

#define SDIO_MMCCRCCTL_ENCHK_SHIFT             (5)
#define SDIO_MMCCRCCTL_ENCHK_MASK              (0x01U << SDIO_MMCCRCCTL_ENCHK_SHIFT)
#define SDIO_MMCCRCCTL_ENCHK(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_ENCHK_SHIFT)) & SDIO_MMCCRCCTL_ENCHK_MASK)

#define SDIO_MMCCRCCTL_ENRDMB_SHIFT            (4)
#define SDIO_MMCCRCCTL_ENRDMB_MASK             (0x01U << SDIO_MMCCRCCTL_ENRDMB_SHIFT)
#define SDIO_MMCCRCCTL_ENRDMB(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_ENRDMB_SHIFT)) & SDIO_MMCCRCCTL_ENRDMB_MASK)

#define SDIO_MMCCRCCTL_DATCRCS_SHIFT           (2)
#define SDIO_MMCCRCCTL_DATCRCS_MASK            (0x3U << SDIO_MMCCRCCTL_DATCRCS_SHIFT)
#define SDIO_MMCCRCCTL_DATCRCS(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_DATCRCS_SHIFT)) & SDIO_MMCCRCCTL_DATCRCS_MASK)

#define SDIO_MMCCRCCTL_CMDCRCE_SHIFT           (1)
#define SDIO_MMCCRCCTL_CMDCRCE_MASK            (0x01U << SDIO_MMCCRCCTL_CMDCRCE_SHIFT)
#define SDIO_MMCCRCCTL_CMDCRCE(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_CMDCRCE_SHIFT)) & SDIO_MMCCRCCTL_CMDCRCE_MASK)

#define SDIO_MMCCRCCTL_DATCRCE_SHIFT           (0)
#define SDIO_MMCCRCCTL_DATCRCE_MASK            (0x01U << SDIO_MMCCRCCTL_DATCRCE_SHIFT)
#define SDIO_MMCCRCCTL_DATCRCE(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCRCCTL_DATCRCE_SHIFT)) & SDIO_MMCCRCCTL_DATCRCE_MASK)

/*!
 * @brief SDIO_CMDCRC Register Bit Definition
 */

#define SDIO_CMDCRC_CMDCRCV_SHIFT              (0)
#define SDIO_CMDCRC_CMDCRCV_MASK               (0x7FU << SDIO_CMDCRC_CMDCRCV_SHIFT)
#define SDIO_CMDCRC_CMDCRCV(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_CMDCRC_CMDCRCV_SHIFT)) & SDIO_CMDCRC_CMDCRCV_MASK)

/*!
 * @brief SDIO_DATCRCL Register Bit Definition
 */

