RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define SDIO_DATCRCL_DATCRCLV_SHIFT            (0)
#define SDIO_DATCRCL_DATCRCLV_MASK             (0x7FU << SDIO_DATCRCL_DATCRCLV_SHIFT)
#define SDIO_DATCRCL_DATCRCLV(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_DATCRCL_DATCRCLV_SHIFT)) & SDIO_DATCRCL_DATCRCLV_MASK)

/*!
 * @brief SDIO_DATCRCH Register Bit Definition
 */

#define SDIO_DATCRCH_DATCRCHV_SHIFT            (0)
#define SDIO_DATCRCH_DATCRCHV_MASK             (0x7FU << SDIO_DATCRCH_DATCRCHV_SHIFT)
#define SDIO_DATCRCH_DATCRCHV(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_DATCRCH_DATCRCHV_SHIFT)) & SDIO_DATCRCH_DATCRCHV_MASK)

/*!
 * @brief SDIO_MMCPORT Register Bit Definition
 */

#define SDIO_MMCPORT_PCLKS_SHIFT               (7)
#define SDIO_MMCPORT_PCLKS_MASK                (0x01U << SDIO_MMCPORT_PCLKS_SHIFT)
#define SDIO_MMCPORT_PCLKS(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCPORT_PCLKS_SHIFT)) & SDIO_MMCPORT_PCLKS_MASK)

#define SDIO_MMCPORT_PCMDS_SHIFT               (6)
#define SDIO_MMCPORT_PCMDS_MASK                (0x01U << SDIO_MMCPORT_PCMDS_SHIFT)
#define SDIO_MMCPORT_PCMDS(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCPORT_PCMDS_SHIFT)) & SDIO_MMCPORT_PCMDS_MASK)

#define SDIO_MMCPORT_PDATS_SHIFT               (5)
#define SDIO_MMCPORT_PDATS_MASK                (0x01U << SDIO_MMCPORT_PDATS_SHIFT)
#define SDIO_MMCPORT_PDATS(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCPORT_PDATS_SHIFT)) & SDIO_MMCPORT_PDATS_MASK)

#define SDIO_MMCPORT_AUTONTEN_SHIFT            (4)
#define SDIO_MMCPORT_AUTONTEN_MASK             (0x01U << SDIO_MMCPORT_AUTONTEN_SHIFT)
#define SDIO_MMCPORT_AUTONTEN(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCPORT_AUTONTEN_SHIFT)) & SDIO_MMCPORT_AUTONTEN_MASK)

#define SDIO_MMCPORT_NTCR_SHIFT                (0)
#define SDIO_MMCPORT_NTCR_MASK                 (0xFU << SDIO_MMCPORT_NTCR_SHIFT)
#define SDIO_MMCPORT_NTCR(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCPORT_NTCR_SHIFT)) & SDIO_MMCPORT_NTCR_MASK)

/*!
 * @brief SDIO_MMCINTMASK Register Bit Definition
 */

#define SDIO_MMCINTMASK_D1INTM_SHIFT          (8)
#define SDIO_MMCINTMASK_D1INTM_MASK           (0x01U << SDIO_MMCINTMASK_D1INTM_SHIFT)
#define SDIO_MMCINTMASK_D1INTM(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_D1INTM_SHIFT)) & SDIO_MMCINTMASK_D1INTM_MASK)

#define SDIO_MMCINTMASK_CRCINTM_SHIFT         (7)
#define SDIO_MMCINTMASK_CRCINTM_MASK          (0x01U << SDIO_MMCINTMASK_CRCINTM_SHIFT)
#define SDIO_MMCINTMASK_CRCINTM(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_CRCINTM_SHIFT)) & SDIO_MMCINTMASK_CRCINTM_MASK)

#define SDIO_MMCINTMASK_CRTINTM_SHIFT         (6)
#define SDIO_MMCINTMASK_CRTINTM_MASK          (0x01U << SDIO_MMCINTMASK_CRTINTM_SHIFT)
#define SDIO_MMCINTMASK_CRTINTM(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_CRTINTM_SHIFT)) & SDIO_MMCINTMASK_CRTINTM_MASK)

#define SDIO_MMCINTMASK_MBTINTM_SHIFT         (5)
#define SDIO_MMCINTMASK_MBTINTM_MASK          (0x01U << SDIO_MMCINTMASK_MBTINTM_SHIFT)
#define SDIO_MMCINTMASK_MBTINTM(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_MBTINTM_SHIFT)) & SDIO_MMCINTMASK_MBTINTM_MASK)

#define SDIO_MMCINTMASK_MBDINTM_SHIFT         (4)
#define SDIO_MMCINTMASK_MBDINTM_MASK          (0x01U << SDIO_MMCINTMASK_MBDINTM_SHIFT)
#define SDIO_MMCINTMASK_MBDINTM(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_MBDINTM_SHIFT)) & SDIO_MMCINTMASK_MBDINTM_MASK)

#define SDIO_MMCINTMASK_CMDEINT_SHIFT         (3)
#define SDIO_MMCINTMASK_CMDEINT_MASK          (0x01U << SDIO_MMCINTMASK_CMDEINT_SHIFT)
#define SDIO_MMCINTMASK_CMDEINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_CMDEINT_SHIFT)) & SDIO_MMCINTMASK_CMDEINT_MASK)

#define SDIO_MMCINTMASK_DATEINT_SHIFT         (2)
#define SDIO_MMCINTMASK_DATEINT_MASK          (0x01U << SDIO_MMCINTMASK_DATEINT_SHIFT)
#define SDIO_MMCINTMASK_DATEINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_DATEINT_SHIFT)) & SDIO_MMCINTMASK_DATEINT_MASK)

#define SDIO_MMCINTMASK_DATDINT_SHIFT         (1)
#define SDIO_MMCINTMASK_DATDINT_MASK          (0x01U << SDIO_MMCINTMASK_DATDINT_SHIFT)
#define SDIO_MMCINTMASK_DATDINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_DATDINT_SHIFT)) & SDIO_MMCINTMASK_DATDINT_MASK)

#define SDIO_MMCINTMASK_CMDDINT_SHIFT         (0)
#define SDIO_MMCINTMASK_CMDDINT_MASK          (0x01U << SDIO_MMCINTMASK_CMDDINT_SHIFT)
#define SDIO_MMCINTMASK_CMDDINT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCINTMASK_CMDDINT_SHIFT)) & SDIO_MMCINTMASK_CMDDINT_MASK)

/*!
 * @brief SDIO_CLRMMCINT Register Bit Definition
 */

#define SDIO_CLRMMCINT_D1MC_SHIFT             (8)
#define SDIO_CLRMMCINT_D1MC_MASK              (0x01U << SDIO_CLRMMCINT_D1MC_SHIFT)
#define SDIO_CLRMMCINT_D1MC(x)                (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_D1MC_SHIFT)) & SDIO_CLRMMCINT_D1MC_MASK)

#define SDIO_CLRMMCINT_CRCEMC_SHIFT           (7)
#define SDIO_CLRMMCINT_CRCEMC_MASK            (0x01U << SDIO_CLRMMCINT_CRCEMC_SHIFT)
#define SDIO_CLRMMCINT_CRCEMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CRCEMC_SHIFT)) & SDIO_CLRMMCINT_CRCEMC_MASK)

#define SDIO_CLRMMCINT_CRNTMC_SHIFT           (6)
#define SDIO_CLRMMCINT_CRNTMC_MASK            (0x01U << SDIO_CLRMMCINT_CRNTMC_SHIFT)
#define SDIO_CLRMMCINT_CRNTMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CRNTMC_SHIFT)) & SDIO_CLRMMCINT_CRNTMC_MASK)

#define SDIO_CLRMMCINT_MBTMC_SHIFT            (5)
#define SDIO_CLRMMCINT_MBTMC_MASK             (0x01U << SDIO_CLRMMCINT_MBTMC_SHIFT)
#define SDIO_CLRMMCINT_MBTMC(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_MBTMC_SHIFT)) & SDIO_CLRMMCINT_MBTMC_MASK)

#define SDIO_CLRMMCINT_MBDMC_SHIFT            (4)
#define SDIO_CLRMMCINT_MBDMC_MASK             (0x01U << SDIO_CLRMMCINT_MBDMC_SHIFT)
#define SDIO_CLRMMCINT_MBDMC(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_MBDMC_SHIFT)) & SDIO_CLRMMCINT_MBDMC_MASK)

#define SDIO_CLRMMCINT_CMDEMC_SHIFT           (3)
#define SDIO_CLRMMCINT_CMDEMC_MASK            (0x01U << SDIO_CLRMMCINT_CMDEMC_SHIFT)
#define SDIO_CLRMMCINT_CMDEMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CMDEMC_SHIFT)) & SDIO_CLRMMCINT_CMDEMC_MASK)

#define SDIO_CLRMMCINT_DATEMC_SHIFT           (2)
#define SDIO_CLRMMCINT_DATEMC_MASK            (0x01U << SDIO_CLRMMCINT_DATEMC_SHIFT)
#define SDIO_CLRMMCINT_DATEMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_DATEMC_SHIFT)) & SDIO_CLRMMCINT_DATEMC_MASK)

#define SDIO_CLRMMCINT_DATDMC_SHIFT           (1)
#define SDIO_CLRMMCINT_DATDMC_MASK            (0x01U << SDIO_CLRMMCINT_DATDMC_SHIFT)
#define SDIO_CLRMMCINT_DATDMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_DATDMC_SHIFT)) & SDIO_CLRMMCINT_DATDMC_MASK)

