RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define SDIO_CLRMMCINT_CMDDMC_SHIFT           (0)
#define SDIO_CLRMMCINT_CMDDMC_MASK            (0x01U << SDIO_CLRMMCINT_CMDDMC_SHIFT)
#define SDIO_CLRMMCINT_CMDDMC(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_CLRMMCINT_CMDDMC_SHIFT)) & SDIO_CLRMMCINT_CMDDMC_MASK)

/*!
 * @brief SDIO_MMCCARDSEL Register Bit Definition
 */

#define SDIO_MMCCARDSEL_CTREN_SHIFT            (7)
#define SDIO_MMCCARDSEL_CTREN_MASK             (0x01U << SDIO_MMCCARDSEL_CTREN_SHIFT)
#define SDIO_MMCCARDSEL_CTREN(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCARDSEL_CTREN_SHIFT)) & SDIO_MMCCARDSEL_CTREN_MASK)

#define SDIO_MMCCARDSEL_ENPCLK_SHIFT           (6)
#define SDIO_MMCCARDSEL_ENPCLK_MASK            (0x01U << SDIO_MMCCARDSEL_ENPCLK_SHIFT)
#define SDIO_MMCCARDSEL_ENPCLK(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCARDSEL_ENPCLK_SHIFT)) & SDIO_MMCCARDSEL_ENPCLK_MASK)

#define SDIO_MMCCARDSEL_TSCALE_SHIFT           (0)
#define SDIO_MMCCARDSEL_TSCALE_MASK            (0x3FU << SDIO_MMCCARDSEL_TSCALE_SHIFT)
#define SDIO_MMCCARDSEL_TSCALE(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCCARDSEL_TSCALE_SHIFT)) & SDIO_MMCCARDSEL_TSCALE_MASK)

/*!
 * @brief SDIO_MMCSIQ Register Bit Definition
 */

#define SDIO_MMCSIQ_PCMDS_SHIFT                (7)
#define SDIO_MMCSIQ_PCMDS_MASK                 (0x01U << SDIO_MMCSIQ_PCMDS_SHIFT)
#define SDIO_MMCSIQ_PCMDS(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PCMDS_SHIFT)) & SDIO_MMCSIQ_PCMDS_MASK)

#define SDIO_MMCSIQ_CRCSTATUS_SHIFT            (4)
#define SDIO_MMCSIQ_CRCSTATUS_MASK             (0x7U << SDIO_MMCSIQ_CRCSTATUS_SHIFT)
#define SDIO_MMCSIQ_CRCSTATUS(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_CRCSTATUS_SHIFT)) & SDIO_MMCSIQ_CRCSTATUS_MASK)

#define SDIO_MMCSIQ_PDAT3S_SHIFT               (3)
#define SDIO_MMCSIQ_PDAT3S_MASK                (0x01U << SDIO_MMCSIQ_PDAT3S_SHIFT)
#define SDIO_MMCSIQ_PDAT3S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT3S_SHIFT)) & SDIO_MMCSIQ_PDAT3S_MASK)

#define SDIO_MMCSIQ_PDAT2S_SHIFT               (2)
#define SDIO_MMCSIQ_PDAT2S_MASK                (0x01U << SDIO_MMCSIQ_PDAT2S_SHIFT)
#define SDIO_MMCSIQ_PDAT2S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT2S_SHIFT)) & SDIO_MMCSIQ_PDAT2S_MASK)

#define SDIO_MMCSIQ_PDAT1S_SHIFT               (1)
#define SDIO_MMCSIQ_PDAT1S_MASK                (0x01U << SDIO_MMCSIQ_PDAT1S_SHIFT)
#define SDIO_MMCSIQ_PDAT1S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT1S_SHIFT)) & SDIO_MMCSIQ_PDAT1S_MASK)

#define SDIO_MMCSIQ_PDAT0S_SHIFT               (0)
#define SDIO_MMCSIQ_PDAT0S_MASK                (0x01U << SDIO_MMCSIQ_PDAT0S_SHIFT)
#define SDIO_MMCSIQ_PDAT0S(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_MMCSIQ_PDAT0S_SHIFT)) & SDIO_MMCSIQ_PDAT0S_MASK)

/*!
 * @brief SDIO_MMCIOMBCTL Register Bit Definition
 */

#define SDIO_MMCIOMBCTL_NTSSEL_SHIFT          (6)
#define SDIO_MMCIOMBCTL_NTSSEL_MASK           (0x3U << SDIO_MMCIOMBCTL_NTSSEL_SHIFT)
#define SDIO_MMCIOMBCTL_NTSSEL(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_NTSSEL_SHIFT)) & SDIO_MMCIOMBCTL_NTSSEL_MASK)

#define SDIO_MMCIOMBCTL_BTSSEL_SHIFT          (4)
#define SDIO_MMCIOMBCTL_BTSSEL_MASK           (0x3U << SDIO_MMCIOMBCTL_BTSSEL_SHIFT)
#define SDIO_MMCIOMBCTL_BTSSEL(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_BTSSEL_SHIFT)) & SDIO_MMCIOMBCTL_BTSSEL_MASK)

#define SDIO_MMCIOMBCTL_PCLKP_SHIFT           (3)
#define SDIO_MMCIOMBCTL_PCLKP_MASK            (0x01U << SDIO_MMCIOMBCTL_PCLKP_SHIFT)
#define SDIO_MMCIOMBCTL_PCLKP(x)              (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_PCLKP_SHIFT)) & SDIO_MMCIOMBCTL_PCLKP_MASK)

#define SDIO_MMCIOMBCTL_PAUTOTR_SHIFT         (2)
#define SDIO_MMCIOMBCTL_PAUTOTR_MASK          (0x01U << SDIO_MMCIOMBCTL_PAUTOTR_SHIFT)
#define SDIO_MMCIOMBCTL_PAUTOTR(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_PAUTOTR_SHIFT)) & SDIO_MMCIOMBCTL_PAUTOTR_MASK)

#define SDIO_MMCIOMBCTL_SMBDTD_SHIFT          (1)
#define SDIO_MMCIOMBCTL_SMBDTD_MASK           (0x01U << SDIO_MMCIOMBCTL_SMBDTD_SHIFT)
#define SDIO_MMCIOMBCTL_SMBDTD(x)             (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_SMBDTD_SHIFT)) & SDIO_MMCIOMBCTL_SMBDTD_MASK)

#define SDIO_MMCIOMBCTL_SPMBDTR_SHIFT         (0)
#define SDIO_MMCIOMBCTL_SPMBDTR_MASK          (0x01U << SDIO_MMCIOMBCTL_SPMBDTR_SHIFT)
#define SDIO_MMCIOMBCTL_SPMBDTR(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCIOMBCTL_SPMBDTR_SHIFT)) & SDIO_MMCIOMBCTL_SPMBDTR_MASK)

/*!
 * @brief SDIO_MMCBLOCKCNT Register Bit Definition
 */

#define SDIO_MMCBLOCKCNT_BCNT_SHIFT            (0)
#define SDIO_MMCBLOCKCNT_BCNT_MASK             (0xFFFFU << SDIO_MMCBLOCKCNT_BCNT_SHIFT)
#define SDIO_MMCBLOCKCNT_BCNT(x)               (((uint32_t)(((uint32_t)(x)) << SDIO_MMCBLOCKCNT_BCNT_SHIFT)) & SDIO_MMCBLOCKCNT_BCNT_MASK)

/*!
 * @brief SDIO_MMCTIMEOUTCNT Register Bit Definition
 */

#define SDIO_MMCTIMEOUTCNT_DTCNT_SHIFT         (0)
#define SDIO_MMCTIMEOUTCNT_DTCNT_MASK          (0xFFU << SDIO_MMCTIMEOUTCNT_DTCNT_SHIFT)
#define SDIO_MMCTIMEOUTCNT_DTCNT(x)            (((uint32_t)(((uint32_t)(x)) << SDIO_MMCTIMEOUTCNT_DTCNT_SHIFT)) & SDIO_MMCTIMEOUTCNT_DTCNT_MASK)

/*!
 * @brief SDIO_CMDBUF Register Bit Definition
 */

#define SDIO_CMDBUF_DAT_SHIFT                  (0)
#define SDIO_CMDBUF_DAT_MASK                   (0xFFU << SDIO_CMDBUF_DAT_SHIFT)
#define SDIO_CMDBUF_DAT(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_CMDBUF_DAT_SHIFT)) & SDIO_CMDBUF_DAT_MASK)

/*!
 * @brief SDIO_BUFCTL Register Bit Definition
 */

#define SDIO_BUFCTL_DBFEN_SHIFT                (15)
#define SDIO_BUFCTL_DBFEN_MASK                 (0x01U << SDIO_BUFCTL_DBFEN_SHIFT)
#define SDIO_BUFCTL_DBFEN(x)                   (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBFEN_SHIFT)) & SDIO_BUFCTL_DBFEN_MASK)

#define SDIO_BUFCTL_DRM_SHIFT                  (14)
#define SDIO_BUFCTL_DRM_MASK                   (0x01U << SDIO_BUFCTL_DRM_SHIFT)
#define SDIO_BUFCTL_DRM(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DRM_SHIFT)) & SDIO_BUFCTL_DRM_MASK)

#define SDIO_BUFCTL_DFIFOSM_SHIFT              (12)
#define SDIO_BUFCTL_DFIFOSM_MASK               (0x01U << SDIO_BUFCTL_DFIFOSM_SHIFT)
#define SDIO_BUFCTL_DFIFOSM(x)                 (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DFIFOSM_SHIFT)) & SDIO_BUFCTL_DFIFOSM_MASK)

#define SDIO_BUFCTL_SBAD_SHIFT                 (11)
#define SDIO_BUFCTL_SBAD_MASK                  (0x01U << SDIO_BUFCTL_SBAD_SHIFT)
#define SDIO_BUFCTL_SBAD(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_SBAD_SHIFT)) & SDIO_BUFCTL_SBAD_MASK)

#define SDIO_BUFCTL_DMAHEN_SHIFT               (10)
#define SDIO_BUFCTL_DMAHEN_MASK                (0x01U << SDIO_BUFCTL_DMAHEN_SHIFT)
#define SDIO_BUFCTL_DMAHEN(x)                  (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DMAHEN_SHIFT)) & SDIO_BUFCTL_DMAHEN_MASK)

#define SDIO_BUFCTL_DBML_SHIFT                 (2)
#define SDIO_BUFCTL_DBML_MASK                  (0xFFU << SDIO_BUFCTL_DBML_SHIFT)
#define SDIO_BUFCTL_DBML(x)                    (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBML_SHIFT)) & SDIO_BUFCTL_DBML_MASK)

