RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
#define SDIO_BUFCTL_DBE_SHIFT                  (1)
#define SDIO_BUFCTL_DBE_MASK                   (0x01U << SDIO_BUFCTL_DBE_SHIFT)
#define SDIO_BUFCTL_DBE(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBE_SHIFT)) & SDIO_BUFCTL_DBE_MASK)

#define SDIO_BUFCTL_DBF_SHIFT                  (0)
#define SDIO_BUFCTL_DBF_MASK                   (0x01U << SDIO_BUFCTL_DBF_SHIFT)
#define SDIO_BUFCTL_DBF(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_BUFCTL_DBF_SHIFT)) & SDIO_BUFCTL_DBF_MASK)

/*!
 * @brief SDIO_DATABUF Register Bit Definition
 */

#define SDIO_DATABUF_DB_SHIFT                  (0)
#define SDIO_DATABUF_DB_MASK                   (0xFFFFFFFFU << SDIO_DATABUF_DB_SHIFT)
#define SDIO_DATABUF_DB(x)                     (((uint32_t)(((uint32_t)(x)) << SDIO_DATABUF_DB_SHIFT)) & SDIO_DATABUF_DB_MASK)

/*!
 * @}
 */ /* end of group SDIO_Register_Masks */
/******************************************************************************
 * SDIO Instance
******************************************************************************/
#define SDIO                                ((SDIO_Type*)SDIO_BASE)

/*!
 * @}
 */ /* end of group SDIO_Peripheral_Access_Layer */



/*!
 * @addtogroup FSMC_Peripheral_Access_Layer FSMC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FSMC Type
 ******************************************************************************/
#define FSMC_SMTMGR_REG_NUM 3u /*!< the number of FSMC SMTMGR. */
typedef struct {
    __IO uint32_t Reserved37[21];                                                 ///< Reserved
    __IO uint32_t SMSKR0;                                                         ///< Memory mask register                         offset: 0x54
    __IO uint32_t Reserved38[15];                                                 ///< Reserved
    __IO uint32_t SMTMGRSET[FSMC_SMTMGR_REG_NUM];                                 ///< Memory timing register 0                     offset: 0x94
    __IO uint32_t Reserved39[1];                                                  ///< Reserved
    __IO uint32_t SMCTLR;                                                         ///< Memory control register                      offset: 0xA4
} FSMC_Type;

/*******************************************************************************
 * FSMC Type
 ******************************************************************************/

/*!
 * @addtogroup FSMC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief FSMC_SMSKR0 Register Bit Definition
 */

#define FSMC_SMSKR0_REGSELECT_SHIFT             (8)
#define FSMC_SMSKR0_REGSELECT_MASK              (0x7U << FSMC_SMSKR0_REGSELECT_SHIFT)
#define FSMC_SMSKR0_REGSELECT(x)                (((uint32_t)(((uint32_t)(x)) << FSMC_SMSKR0_REGSELECT_SHIFT)) & FSMC_SMSKR0_REGSELECT_MASK)

#define FSMC_SMSKR0_MEMTYPE_SHIFT               (5)
#define FSMC_SMSKR0_MEMTYPE_MASK                (0x7U << FSMC_SMSKR0_MEMTYPE_SHIFT)
#define FSMC_SMSKR0_MEMTYPE(x)                  (((uint32_t)(((uint32_t)(x)) << FSMC_SMSKR0_MEMTYPE_SHIFT)) & FSMC_SMSKR0_MEMTYPE_MASK)

#define FSMC_SMSKR0_MEMSIZE_SHIFT               (0)
#define FSMC_SMSKR0_MEMSIZE_MASK                (0x1FU << FSMC_SMSKR0_MEMSIZE_SHIFT)
#define FSMC_SMSKR0_MEMSIZE(x)                  (((uint32_t)(((uint32_t)(x)) << FSMC_SMSKR0_MEMSIZE_SHIFT)) & FSMC_SMSKR0_MEMSIZE_MASK)

/*!
 * @brief FSMC_SMTMGRSET Register Bit Definition
 */

#define FSMC_SMTMGRSET_SMREADPIPE_SHIFT         (28)
#define FSMC_SMTMGRSET_SMREADPIPE_MASK          (0x3U << FSMC_SMTMGRSET_SMREADPIPE_SHIFT)
#define FSMC_SMTMGRSET_SMREADPIPE(x)            (((uint32_t)(((uint32_t)(x)) << FSMC_SMTMGRSET_SMREADPIPE_SHIFT)) & FSMC_SMTMGRSET_SMREADPIPE_MASK)

#define FSMC_SMTMGRSET_READYMODE_SHIFT          (26)
#define FSMC_SMTMGRSET_READYMODE_MASK           (0x01U << FSMC_SMTMGRSET_READYMODE_SHIFT)
#define FSMC_SMTMGRSET_READYMODE(x)             (((uint32_t)(((uint32_t)(x)) << FSMC_SMTMGRSET_READYMODE_SHIFT)) & FSMC_SMTMGRSET_READYMODE_MASK)

#define FSMC_SMTMGRSET_TWP_SHIFT                (10)
#define FSMC_SMTMGRSET_TWP_MASK                 (0x3FU << FSMC_SMTMGRSET_TWP_SHIFT)
#define FSMC_SMTMGRSET_TWP(x)                   (((uint32_t)(((uint32_t)(x)) << FSMC_SMTMGRSET_TWP_SHIFT)) & FSMC_SMTMGRSET_TWP_MASK)

#define FSMC_SMTMGRSET_TWR_SHIFT                (8)
#define FSMC_SMTMGRSET_TWR_MASK                 (0x3U << FSMC_SMTMGRSET_TWR_SHIFT)
#define FSMC_SMTMGRSET_TWR(x)                   (((uint32_t)(((uint32_t)(x)) << FSMC_SMTMGRSET_TWR_SHIFT)) & FSMC_SMTMGRSET_TWR_MASK)

#define FSMC_SMTMGRSET_TAS_SHIFT                (6)
#define FSMC_SMTMGRSET_TAS_MASK                 (0x3U << FSMC_SMTMGRSET_TAS_SHIFT)
#define FSMC_SMTMGRSET_TAS(x)                   (((uint32_t)(((uint32_t)(x)) << FSMC_SMTMGRSET_TAS_SHIFT)) & FSMC_SMTMGRSET_TAS_MASK)

#define FSMC_SMTMGRSET_TRC_SHIFT                (0)
#define FSMC_SMTMGRSET_TRC_MASK                 (0x3FU << FSMC_SMTMGRSET_TRC_SHIFT)
#define FSMC_SMTMGRSET_TRC(x)                   (((uint32_t)(((uint32_t)(x)) << FSMC_SMTMGRSET_TRC_SHIFT)) & FSMC_SMTMGRSET_TRC_MASK)


/*!
 * @brief FSMC_SMCTLR Register Bit Definition
 */

#define FSMC_SMCTLR_SMDATAWIDTHSET2_SHIFT       (13)
#define FSMC_SMCTLR_SMDATAWIDTHSET2_MASK        (0x7U << FSMC_SMCTLR_SMDATAWIDTHSET2_SHIFT)
#define FSMC_SMCTLR_SMDATAWIDTHSET2(x)          (((uint32_t)(((uint32_t)(x)) << FSMC_SMCTLR_SMDATAWIDTHSET2_SHIFT)) & FSMC_SMCTLR_SMDATAWIDTHSET2_MASK)

#define FSMC_SMCTLR_SMDATAWIDTHSET1_SHIFT       (10)
#define FSMC_SMCTLR_SMDATAWIDTHSET1_MASK        (0x7U << FSMC_SMCTLR_SMDATAWIDTHSET1_SHIFT)
#define FSMC_SMCTLR_SMDATAWIDTHSET1(x)          (((uint32_t)(((uint32_t)(x)) << FSMC_SMCTLR_SMDATAWIDTHSET1_SHIFT)) & FSMC_SMCTLR_SMDATAWIDTHSET1_MASK)

#define FSMC_SMCTLR_SMDATAWIDTHSET0_SHIFT       (7)
#define FSMC_SMCTLR_SMDATAWIDTHSET0_MASK        (0x7U << FSMC_SMCTLR_SMDATAWIDTHSET0_SHIFT)
#define FSMC_SMCTLR_SMDATAWIDTHSET0(x)          (((uint32_t)(((uint32_t)(x)) << FSMC_SMCTLR_SMDATAWIDTHSET0_SHIFT)) & FSMC_SMCTLR_SMDATAWIDTHSET0_MASK)

#define FSMC_SMCTLR_FLASHRP_SHIFT               (0)
#define FSMC_SMCTLR_FLASHRP_MASK                (0x01U << FSMC_SMCTLR_FLASHRP_SHIFT)
#define FSMC_SMCTLR_FLASHRP(x)                  (((uint32_t)(((uint32_t)(x)) << FSMC_SMCTLR_FLASHRP_SHIFT)) & FSMC_SMCTLR_FLASHRP_MASK)

/*!
 * @}
 */ /* end of group FSMC_Register_Masks */
/******************************************************************************
 * FSMC Instance
******************************************************************************/
#define FSMC                                ((FSMC_Type*)FSMC_BASE)

/*!
 * @}
 */ /* end of group FSMC_Peripheral_Access_Layer */



/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 *  @{
 */

