RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
/*******************************************************************************
 * ADC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ADDATA;                                                         ///< A/D data register                            offset: 0x00
    __IO uint32_t ADCFG;                                                          ///< A/D configuration register                   offset: 0x04
    __IO uint32_t ADCR;                                                           ///< A/D control register                         offset: 0x08
    __IO uint32_t ADCHS;                                                          ///< A/D channel selection register               offset: 0x0C
    __IO uint32_t ADCMPR;                                                         ///< A/D window compare register                  offset: 0x10
    __IO uint32_t ADSTA;                                                          ///< A/D status register                          offset: 0x14
    __IO uint32_t ADDR[16];                                                       ///< A/D data register                            offset: 0x18
    __IO uint32_t ADSTAEXT;                                                       ///< A/D extended status register                 offset: 0x58
    __IO uint32_t CHANY0;                                                         ///< A/D any channel channel selection register 0 offset: 0x5C
    __IO uint32_t CHANY1;                                                         ///< A/D any channel channel selection register 1 offset: 0x60
    __IO uint32_t ANYCFG;                                                         ///< A/D arbitrary channel configuration register offset: 0x64
    __IO uint32_t ANYCR;                                                          ///< A/D arbitrary channel control register       offset: 0x68
    __IO uint32_t Reserved41[1];                                                  ///< Reserved
    __IO uint32_t SMPR1;                                                          ///< A/D sampling configuration register 1        offset: 0x70
    __IO uint32_t SMPR2;                                                          ///< A/D sampling configuration register 2        offset: 0x74
    __IO uint32_t Reserved42[1];                                                  ///< Reserved
    __IO uint32_t JOFR[4];                                                        ///< A/D injection channel data compensation registeroffset: 0x7C
    __IO uint32_t JSQR;                                                           ///< A/D injection channel continuous register    offset: 0x8C
    __IO uint32_t JADDATA;                                                        ///< A/D injection channel data register          offset: 0x90
    __IO uint32_t Reserved44[7];                                                  ///< Reserved
    __IO uint32_t JDR[4];                                                         ///< A/D injection channel data register          offset: 0xB0
} ADC_Type;

/*******************************************************************************
 * ADC Type
 ******************************************************************************/

/*!
 * @addtogroup ADC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief ADC_ADDATA Register Bit Definition
 */

#define ADC_ADDATA_VALID_SHIFT                  (21)
#define ADC_ADDATA_VALID_MASK                   (0x01U << ADC_ADDATA_VALID_SHIFT)
#define ADC_ADDATA_VALID(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_VALID_SHIFT)) & ADC_ADDATA_VALID_MASK)

#define ADC_ADDATA_OVERRUN_SHIFT                (20)
#define ADC_ADDATA_OVERRUN_MASK                 (0x01U << ADC_ADDATA_OVERRUN_SHIFT)
#define ADC_ADDATA_OVERRUN(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_OVERRUN_SHIFT)) & ADC_ADDATA_OVERRUN_MASK)

#define ADC_ADDATA_CHANNELSEL_SHIFT             (16)
#define ADC_ADDATA_CHANNELSEL_MASK              (0xFU << ADC_ADDATA_CHANNELSEL_SHIFT)
#define ADC_ADDATA_CHANNELSEL(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_CHANNELSEL_SHIFT)) & ADC_ADDATA_CHANNELSEL_MASK)

#define ADC_ADDATA_DATA_SHIFT                   (0)
#define ADC_ADDATA_DATA_MASK                    (0xFFFFU << ADC_ADDATA_DATA_SHIFT)
#define ADC_ADDATA_DATA(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_DATA_SHIFT)) & ADC_ADDATA_DATA_MASK)

/*!
 * @brief ADC_ADCFG Register Bit Definition
 */

#define ADC_ADCFG_JADWEN_SHIFT                  (16)
#define ADC_ADCFG_JADWEN_MASK                   (0x01U << ADC_ADCFG_JADWEN_SHIFT)
#define ADC_ADCFG_JADWEN(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_JADWEN_SHIFT)) & ADC_ADCFG_JADWEN_MASK)

#define ADC_ADCFG_ADCPREL_SHIFT                  (14)
#define ADC_ADCFG_ADCPREL_MASK                   (0x01U << ADC_ADCFG_ADCPREL_SHIFT)
#define ADC_ADCFG_ADCPREL(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_ADCPREL_SHIFT)) & ADC_ADCFG_ADCPREL_MASK)

#define ADC_ADCFG_RSLTCTL_SHIFT                 (7)
#define ADC_ADCFG_RSLTCTL_MASK                  (0x7U << ADC_ADCFG_RSLTCTL_SHIFT)
#define ADC_ADCFG_RSLTCTL(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_RSLTCTL_SHIFT)) & ADC_ADCFG_RSLTCTL_MASK)

#define ADC_ADCFG_ADCPREH_SHIFT                  (4)
#define ADC_ADCFG_ADCPREH_MASK                   (0x7U << ADC_ADCFG_ADCPREH_SHIFT)
#define ADC_ADCFG_ADCPREH(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_ADCPREH_SHIFT)) & ADC_ADCFG_ADCPREH_MASK)

#define ADC_ADCFG_VSEN_SHIFT                    (3)
#define ADC_ADCFG_VSEN_MASK                     (0x01U << ADC_ADCFG_VSEN_SHIFT)
#define ADC_ADCFG_VSEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_VSEN_SHIFT)) & ADC_ADCFG_VSEN_MASK)

#define ADC_ADCFG_TSEN_SHIFT                    (2)
#define ADC_ADCFG_TSEN_MASK                     (0x01U << ADC_ADCFG_TSEN_SHIFT)
#define ADC_ADCFG_TSEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_TSEN_SHIFT)) & ADC_ADCFG_TSEN_MASK)

