RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g.h
/*******************************************************************************
 * CRC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t DR;                                                             ///< CRC data register                            offset: 0x00
    __IO uint32_t IDR;                                                            ///< CRC independent data register                offset: 0x04
    __IO uint32_t CTRL;                                                           ///< CRC control register                         offset: 0x08
    __IO uint32_t MIR;                                                            ///< CRC intermediate data register               offset: 0x0C
} CRC_Type;

/*******************************************************************************
 * CRC Type
 ******************************************************************************/

/*!
 * @addtogroup CRC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CRC_DR Register Bit Definition
 */

#define CRC_DR_DR_SHIFT                         (0)
#define CRC_DR_DR_MASK                          (0xFFFFFFFFU << CRC_DR_DR_SHIFT)
#define CRC_DR_DR(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_DR_DR_SHIFT)) & CRC_DR_DR_MASK)

/*!
 * @brief CRC_IDR Register Bit Definition
 */

#define CRC_IDR_IDR_SHIFT                       (0)
#define CRC_IDR_IDR_MASK                        (0xFFU << CRC_IDR_IDR_SHIFT)
#define CRC_IDR_IDR(x)                          (((uint32_t)(((uint32_t)(x)) << CRC_IDR_IDR_SHIFT)) & CRC_IDR_IDR_MASK)

/*!
 * @brief CRC_CTRL Register Bit Definition
 */

#define CRC_CTRL_BIGEO_SHIFT                    (5)
#define CRC_CTRL_BIGEO_MASK                     (0x01U << CRC_CTRL_BIGEO_SHIFT)
#define CRC_CTRL_BIGEO(x)                       (((uint32_t)(((uint32_t)(x)) << CRC_CTRL_BIGEO_SHIFT)) & CRC_CTRL_BIGEO_MASK)

#define CRC_CTRL_BIGEI_SHIFT                    (4)
#define CRC_CTRL_BIGEI_MASK                     (0x01U << CRC_CTRL_BIGEI_SHIFT)
#define CRC_CTRL_BIGEI(x)                       (((uint32_t)(((uint32_t)(x)) << CRC_CTRL_BIGEI_SHIFT)) & CRC_CTRL_BIGEI_MASK)

#define CRC_CTRL_CRCBITSEL_SHIFT                (2)
#define CRC_CTRL_CRCBITSEL_MASK                 (0x3U << CRC_CTRL_CRCBITSEL_SHIFT)
#define CRC_CTRL_CRCBITSEL(x)                   (((uint32_t)(((uint32_t)(x)) << CRC_CTRL_CRCBITSEL_SHIFT)) & CRC_CTRL_CRCBITSEL_MASK)

#define CRC_CTRL_POLY32MGN_SHIFT                (1)
#define CRC_CTRL_POLY32MGN_MASK                 (0x01U << CRC_CTRL_POLY32MGN_SHIFT)
#define CRC_CTRL_POLY32MGN(x)                   (((uint32_t)(((uint32_t)(x)) << CRC_CTRL_POLY32MGN_SHIFT)) & CRC_CTRL_POLY32MGN_MASK)

#define CRC_CTRL_RESET_SHIFT                    (0)
#define CRC_CTRL_RESET_MASK                     (0x01U << CRC_CTRL_RESET_SHIFT)
#define CRC_CTRL_RESET(x)                       (((uint32_t)(((uint32_t)(x)) << CRC_CTRL_RESET_SHIFT)) & CRC_CTRL_RESET_MASK)

/*!
 * @brief CRC_MIR Register Bit Definition
 */

#define CRC_MIR_CRCMIR_SHIFT                    (0)
#define CRC_MIR_CRCMIR_MASK                     (0xFFFFFFFFU << CRC_MIR_CRCMIR_SHIFT)
#define CRC_MIR_CRCMIR(x)                       (((uint32_t)(((uint32_t)(x)) << CRC_MIR_CRCMIR_SHIFT)) & CRC_MIR_CRCMIR_MASK)

/*!
 * @}
 */ /* end of group CRC_Register_Masks */
/******************************************************************************
 * CRC Instance
******************************************************************************/
#define CRC                                     ((CRC_Type*)CRC_BASE)

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */



/*!
 * @addtogroup DEBUG_Peripheral_Access_Layer DEBUG Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * DEBUG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< DEBUG control register                       offset: 0x00
} DBG_Type;

/*******************************************************************************
 * DEBUG Type
 ******************************************************************************/

/*!
 * @addtogroup DEBUG_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief DBG_CR Register Bit Definition
 */

#define DBG_CR_DEBUGTIM8STOP_SHIFT            (17)
#define DBG_CR_DEBUGTIM8STOP_MASK             (0xFU << DBG_CR_DEBUGTIM8STOP_SHIFT)
#define DBG_CR_DEBUGTIM8STOP(x)               (((uint32_t)(((uint32_t)(x)) << DBG_CR_DEBUGTIM8STOP_SHIFT)) & DBG_CR_DEBUGTIMXSTOP_MASK)

#define DBG_CR_DEBUGTIM1STOP_SHIFT            (10)
#define DBG_CR_DEBUGTIM1STOP_MASK             (0xFU << DBG_CR_DEBUGTIM1STOP_SHIFT)
#define DBG_CR_DEBUGTIM1STOP(x)               (((uint32_t)(((uint32_t)(x)) << DBG_CR_DEBUGTIM1STOP_SHIFT)) & DBG_CR_DEBUGTIMXSTOP_MASK)

#define DBG_CR_DEBUGWWDGSTOP_SHIFT            (9)
#define DBG_CR_DEBUGWWDGSTOP_MASK             (0x01U << DBG_CR_DEBUGWWDGSTOP_SHIFT)
#define DBG_CR_DEBUGWWDGSTOP(x)               (((uint32_t)(((uint32_t)(x)) << DBG_CR_DEBUGWWDGSTOP_SHIFT)) & DBG_CR_DEBUGWWDGSTOP_MASK)

#define DBG_CR_DEBUGIWDGSTOP_SHIFT            (8)
#define DBG_CR_DEBUGIWDGSTOP_MASK             (0x01U << DBG_CR_DEBUGIWDGSTOP_SHIFT)
#define DBG_CR_DEBUGIWDGSTOP(x)               (((uint32_t)(((uint32_t)(x)) << DBG_CR_DEBUGIWDGSTOP_SHIFT)) & DBG_CR_DEBUGIWDGSTOP_MASK)

#define DBG_CR_DEBUGSTOPFORLDO_SHIFT          (3)
#define DBG_CR_DEBUGSTOPFORLDO_MASK           (0x01U << DBG_CR_DEBUGSTOPFORLDO_SHIFT)
#define DBG_CR_DEBUGSTOPFORLDO(x)             (((uint32_t)(((uint32_t)(x)) << DBG_CR_DEBUGSTOPFORLDO_SHIFT)) & DBG_CR_DEBUGSTOPFORLDO_MASK)

/*!
 * @}
 */ /* end of group DEBUG_Register_Masks */
/******************************************************************************
 * DEBUG Instance
******************************************************************************/
#define DBG                                   ((DBG_Type*)DBG_BASE)

/*!
 * @}
 */ /* end of group DEBUG_Peripheral_Access_Layer */




/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error "Not supported compiler type"
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */

#endif /* __MM32F3277G_H__ */
